{
  "event_id": "AAPL_2026-01-29",
  "ticker": "AAPL",
  "company": "Apple Inc.",
  "quarter": 1,
  "fiscal_year": 2026,
  "call_date": "2026-01-29",
  "call_start_ts": "2026-01-29 22:00:00+00:00",
  "raw_text": "Apple Inc. NasdaqGS:AAPL\nFQ1 2026 Earnings Call Transcripts\nThursday, January 29, 2026 10:00 PM GMT\nS&P Global Market Intelligence Estimates\n\nPresentation\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nGood afternoon, and welcome to the Apple Q1 Fiscal Year 2026 Earnings\nConference Call. My name is Suhasini Chandramouli, Director of Investor\nRelations. Today's call is being recorded. Speaking first today is Apple's\nCEO, Tim Cook, and he'll be followed by CFO, Kevan Parekh. After that,\nwe'll open the call to questions from analysts.\n\nPlease note that some of the information you'll hear during our discussion\ntoday will consist of forward-looking statements, including, without\nlimitation, those regarding revenue, gross margin, operating expenses,\nother income and expense, taxes, capital allocation and future business\noutlook. These statements involve risks and uncertainties that may cause\nactual results or trends to differ materially from our forecast including\nrisks related to the potential impact to the company's business and results\nof operations from macroeconomic conditions, tariffs and other measures and\nlegal and regulatory proceedings.\n\nFor more information, please refer to the risk factors discussed in Apple's\nmost recently filed reports on Form 10-Q and Form 10-K and the Form 8-K\nfiled with the SEC today, along with the associated press release.\nAdditional information will also be in our report on Form 10-Q for the\nquarter ended December 27, 2025, to be filed tomorrow and in other reports\nand filings we make with the SEC. Apple assumes no obligation to update any\nforward-looking statements, which speak only as of the date they are made.\n\nI'd now like to turn the call over to Tim for introductory remarks.\n\nTimothy D. Cook\nCEO & Director\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the\ncall. I am proud to say that we just had a quarter for the record books. We\nare reporting our best-ever quarter with $143.8 billion in revenue, up 16%\nfrom a year ago and exceeding our expectations. The demand for iPhone was\nsimply staggering with revenue growing 23% year-over-year and all-time\nrecords across every geographic segment.\n\nServices set an all-time revenue record as well, up 14% from a year ago,\nand EPS reached an all-time record of $2.84, growing a robust 19% year-over-\nyear. We set all-time revenue records in the Americas, Europe, Japan and\nrest of Asia Pacific and grew in the vast majority of markets we track. We\ncontinue to gain momentum in emerging markets which includes India, where\nwe saw strong double-digit revenue growth. Greater China also grew 38% year-\nover-year, driven by iPhone, which had record upgraders and double-digit\ngrowth on switchers.\n\nApple's December quarter results underscore our relentless commitment to\ninnovation to our customers and to our mission to build the best products\nand services in the world.\n\nNow I'd like to take a closer look at results from across our lineup,\nbeginning with iPhone. As I mentioned earlier, it was a fantastic quarter\nfor iPhone with an all-time revenue record of $85.3 billion, up 23% year-\nover-year. This is the strongest iPhone lineup we've ever had and by far,\nthe most popular. Throughout the quarter, customer enthusiasm for iPhone\nwas simply extraordinary. Users were incredibly excited about everything\nenables them to do. iPhone 17 Pro and 17 Pro Max delivered the ultimate\niPhone experience. They feature the best ever performance in battery life\non an iPhone, the most advanced camera system and a striking design. iPhone\nAir, our slimmest and lightest smartphone yet, packs powerful capabilities\ninto an ultra slim and sleek design. And iPhone 17 is a truly fantastic\nupgrade at an incredible value.\n\nTurning to Mac. Revenue was $8.4 billion for the December quarter. We were\npleased to see the Mac installed base reach another all-time high with\nnearly half of customers who purchased the Mac being new to the product.\nThe M5 powered 14-inch MacBook Pro takes a huge leap in AI performance,\nthanks to the next-generation GPU architecture and a faster neural engine.\n\nFrom the world's most popular laptop for consumers and businesses in\nMacBook Air to the small and spectacular Mac Mini, every Mac in our lineup\nhas something special to offer users. And with the recently released Apple\nCreator Studio available across Mac, iPad and iPhone, creators have more\ntools at their fingertips to make incredible music or turn their devices\ninto a video production studio.\n\nMeanwhile, iPad saw December quarter revenue of $8.6 billion, up 6% from a\nyear ago with an all-time record for upgraders. We are proud to have our\nstrongest lineup ever from iPad powered by A16, which is proving to be\nincredibly popular to iPad Air with its amazing versatility to the\nunbelievably powerful M5 iPad Pro with its remarkably thin and light\ndesign. It's no wonder that iPad continued to be the most popular tablet in\nthe world. Across Wearables, Home and Accessories, revenue was $11.5\nbillion. With Apple Watch Ultra 3 and Apple Watch Series 11, users are\ntapping into a comprehensive set of health and wellness features to help\nthem meet their health goals.\n\nIn a recent survey, we see an increasing number of users telling us they're\nwearing their watch to sleep, which allows them to check their sleep scores\neach morning and find ways to improve their sleep quality. And Apple Watch\nalerts are enabling important conversations between users and their doctors\nregarding potential signs of hypertension.\n\nThese are just some of the many ways that watch is helping people live\nhealthier lives. The response to AirPods Pro 3 has been amazing. Customers\nare raving about the rich immersive sound quality, the unmatched level of\nactive noise cancellation and the noticeably improved comfort that makes\nthem effortless to wear.\n\nFeatures like live translation are also changing the way people can\ncommunicate by helping users connect across languages in real time and\nmaking everyday conversations feel more natural and accessible. Together,\nthese innovations create an experience that feels both powerful and\npersonal and the enthusiasm we are seeing reflects just how strongly\nAirPods Pro 3 are resonating with customers.\n\nAcross our product categories, we are seeing very high levels of customer\nsatisfaction, and we are proud to report that we have a new record for our\ninstalled base with more than 2.5 billion active devices. During the\nquarter, we were excited to see that the majority of users on enabled\niPhones are actively leveraging the power of Apple Intelligence. Since the\nlaunch of Apple Intelligence, we've introduced dozens of features,\nincluding writing tools and cleanup and made it available in 15 languages.\n\nThese AI experiences are personal, private, integrated across our platforms\nand relevant to what our users do every day. We are bringing intelligence\nto more of what people already love about our products so we can make every\nexperience even more capable and effortless.\n\nOne of our most popular features is visual intelligence which helps users\nlearn and do more than ever with the content on their iPhone screen, making\nit faster to search, take action and answer questions across their apps.\nAnd as I touched on earlier, we are hearing powerful stories of people\nusing live translation to communicate seamlessly across languages.\n\nAnd these are just some of the many powerful AI features that are enabling\nour users to do remarkable things with our products, which are far and away\nthe best platforms in the world for AI. That's a no small part because of\nthe extraordinary power and performance of Apple Silicon. Building on our\nefforts in the AI space, we are also collaborating with Google to develop\nthe next generation of Apple foundation models. This will help power future\nApple Intelligence features, including a more personalized series coming\nthis year. We're incredibly excited for what's to come with so many new\nexperiences to unlock.\n\nTurning to services. We achieved an all-time revenue record of $30 billion,\n14% higher from a year ago. Services also set all-time revenue records in\nboth developed and emerging markets. Apple TV has seen fantastic momentum\nwith December seeing a 36% increase in viewership over the previous year.\nIt's no wonder with shows like Pluribus which are creating landmark\ncultural moments that audiences are loving. Anticipation is building for\nupcoming new productions like Cape Fear from Steven Spielberg and Martin\nScorsese. And we are thrilled to announce that Ted Lasso will be returning\nfor a fourth season this summer.\n\nSix years since launch, we're excited by the growing enthusiasm viewers\nhave for Apple TV, and we are grateful for the accolades that have\nfollowed, most recently at the Critics Choice and Golden Globe Awards. To\ndate, Apple TV productions have earned more than 650 wins and more than\n3,200 nominations, including a recently announced Oscar nomination for Best\nPicture for F1, the movie. And speaking of F1, we're also approaching the\nstart of a new Formula 1 season, and for F1 fans in the U.S., Apple TV will\nbe the place to watch every practice, qualifying, Sprint and Grand Prix.\nMLS fans will also be able to watch every regular and post-season game with\ntheir Apple TV subscription this year, and we're looking forward to kick\noff in the coming weeks.\n\nLooking back, 2025 was a fantastic year for services as we rolled out\namazing new features and broke records. Apple Music climbed to all-time\nhighs in both listenership and new subscriber growth. Apple Pay eliminated\nmore than $1 billion in fraud for our partners last year, and we've made it\navailable in more markets than ever before. And last year, we welcomed more\nthan 850 million users every week on average to the App Store, the world's\nsafest and most innovative app marketplace. Developers have now earned more\nthan $550 billion on our platform since 2008.\n\nIn retail, we continue to bring a magical experience to our customers all\naround the world, and we were thrilled to have our best ever results in\nretail during the quarter. We were excited to open our fifth store in India\nin December and have plans to open another store in Mumbai soon.\n\nWherever we are, we see ourselves as part of a larger whole. That's why we\nshow up with our values in everything we do. That means working with\npartners in places like Vietnam to bring more clean water to rural areas.\nIt means celebrating graduations of new classes of innovators from our\ndeveloper academies in places such as Brazil, Indonesia and South Korea. It\nmeans 3D printing titanium cases for Apple Watch using recycled materials\nso that they're better for the planet without compromising quality and so\nmuch more.\n\nWe're especially proud of the work we're doing to support American\ninnovation. Last year, we committed to invest $600 billion over 4 years in\nvital industries like advanced manufacturing, silicon engineering and\nartificial intelligence. As we're building on our long-standing investments\nin America, we're supporting nearly 0.5 million jobs with thousands of\nsuppliers across all 50 states.\n\nIn the year since we made our initial commitment, we're making great\nprogress. Today, we're shipping servers to power Apple intelligence from\nour new manufacturing facility in Houston. Through our advanced\nmanufacturing program, we're working with Corning in Kentucky to make 100%\nof cover glass for iPhone and Apple Watch. We're working with Micron, which\nbroke ground on a new advanced chip packaging and test facility, and we\ncontinue to advance the development of an end-to-end silicon supply chain\nacross the country sourcing 20 billion U.S. chips in 2025.\n\nThrough our Apple Manufacturing Academy in Detroit, we're already training\nAmerican businesses and innovators on the latest smart manufacturing and\nartificial intelligence techniques. Six months since opening, the Academy\nis already making an enormously positive impact for businesses working\nalongside Apple engineers to drive productivity, efficiency and quality in\ntheir supply chains. As I said at the beginning of my remarks, this was in\nso many ways, a remarkable quarter for Apple. And we're excited for all the\nopportunities we'll have in the year ahead to deliver innovations that have\nnever been seen before and enrich the lives of users every step of the way.\n\nWith so much to look forward to in the weeks and months ahead, I have every\nconfidence that our best work is yet to come.\n\nWith that, I'll turn it over to Kevan.\n\nKevan Parekh\nSenior VP & CFO\n\nThanks, Tim, and good afternoon, everyone. Our revenue of $143.8 billion\nwas up 16% year-over-year, our best quarter ever. Across the world, we set\nall-time revenue records in both developed and emerging markets. And we saw\ndouble-digit growth year-over-year across the majority of the markets we\ntrack, including the U.S., Latin America, Western Europe, Greater China,\nIndia and South Asia.\n\nProducts revenue was $113.7 billion, up 16% year-over-year, driven by\ndouble-digit growth in iPhone, setting a new all-time record. And as Tim\nmentioned, thanks to our strong levels of customer loyalty and\nsatisfaction, our installed base of active devices has now surpassed $2.5\nbillion, reaching another all-time high across all product categories and\ngeographic segments.\n\nServices revenue was $30 billion, up 14% year-over-year. This performance\ncontinues to be broad-based with double-digit growth in almost every market\nwe track. We also reached all-time revenue records for advertising, cloud\nservices, music and payment services with December quarter records on the\nApp Store and video. Company gross margin was at 48.2%, above the high end\nof our guidance range and up 100 basis points sequentially, driven by\nfavorable mix and leverage. Products gross margin was 40.7%, up 450 basis\npoints sequentially driven by favorable mix and leverage. Services gross\nmargin was 76.5%, up 120 basis points sequentially, driven by mix.\n\nOperating expenses landed at $18.4 billion, up 19% year-over-year. This was\nwithin the range we provided and driven by increased investment in R&D. Net\nincome was $42.1 billion and diluted earnings per share was $2.84, up 19%\nyear-over-year. Both net income and diluted EPS were all-time records and\nthese incredibly strong business results drove an all-time record for\noperating cash flow coming in at $53.9 billion.\n\nNow I'm going to provide some more details for each of our revenue\ncategories. iPhone revenue was $85.3 billion, up 23% year-over-year, driven\nby the iPhone 17 family. iPhone saw strength around the world reaching all-\ntime revenue records in many of the markets we track, including the U.S.,\nGreater China, Latin America, Western Europe, the Middle East, Australia\nand South Asia as well as a December quarter record in India. The iPhone\nactive installed base grew to an all-time high and set a new all-time\nrecord for upgraders in aggregate and across many countries, including the\nU.S., China Mainland, Japan and India.\n\nAccording to a recent survey from World Panel, iPhone was a top-selling\nmodel in the U.S., Urban China, the U.K., Australia and Japan. Customers\nare loving the latest iPhone lineup. The latest customer satisfaction for\nthe iPhone 17 family in the U.S. was measured at 99% by 451 Research. Mac\nrevenue was $8.4 billion, down 7% year-over-year. As we described in the\nlast call, we faced a very difficult compare against an M4 MacBook Pro, Mac\nMini and iMac launches in the year ago quarter. Despite this difficult\ncompare, we continue to see growth in several emerging markets, including\nBrazil, India, Malaysia, Vietnam and more.\n\nAnd as Tim mentioned earlier, the Mac installed base reached another all-\ntime high with nearly half of the customers who purchased the Mac being new\nto the product. And in the U.S., customer satisfaction for Mac was measured\nat 97%. iPad revenue was $8.6 billion, up 6% year-over-year, driven by the\nM5 powered iPad Pro and the A16 powered iPad. We continue to add new users\nto the iPad. In fact, over half the customers who purchased the iPad during\nthe quarter were new to the product. This helped the iPad installed base to\nreach an all-time high and we also reached an all-time high for upgraders.\nBased on the latest reports from 451 Research, customer satisfaction was\n98% in the U.S.\n\nWearables, Home and Accessories revenue was $11.5 billion, down 2% year-\nover-year. During the quarter, we experienced constraints on the AirPods\nPro 3, and we believe the overall category would have grown had it not been\nfor these constraints. The Wearables installed base reached a new all-time\nhigh, with over half of the customers purchasing an Apple Watch during the\nquarter being new to the product. And in the U.S., customer satisfaction\nwas recently reported at 96%.\n\nOur services revenue reached an all-time high of $30 billion, up 14% year-\nover-year. As we said earlier, we had all-time revenue records on\nadvertising, music, payment services and cloud services where we saw a\ndouble-digit growth on paid subscribers. We continue to be optimistic about\nthe future of our services business. With our installed base of over 2.5\nbillion active devices, we have an incredibly strong foundation for new\ngrowth opportunities. We saw increased customer engagement across our\nservice offerings with both transacting and paid accounts reaching all-time\nhighs in the quarter.\n\nAnd we continue to improve quality and expand the breadth of our services\nofferings. From new wallet features like Digital ID, which provides a way\nfor users to create an ID in wallet using information from their U.S.\nPassport to additional ads coming to search in the App Store, which\nprovides advertisers more ways to drive downloads from search.\n\nTurning now to enterprise. Organizations are continuing to expand their\nfleet of Apple devices to drive productivity while remaining secure.\nSnowflake has deployed over 9,000 Mac devices company-wide, establishing\nMac as a primary laptop across all business units, resulting in increased\nperformance and a reduction in support tickets. AstraZeneca is rolling out\nover 5,000 M5 powered iPad Pros to its pharmaceutical sales team to take\nadvantage of AI capabilities, including Apple Intelligence, while meeting\nwith clinicians daily. And in Mexico, Coppel, the country's largest\ndomestic retailer recently added MacBook Air in addition to a growing fleet\nof over 10,000 iPad devices.\n\nLet's turn to our cash position and capital return program. We ended the\nquarter with $145 billion in cash and marketable securities. We had $2.2\nbillion of debt maturities and decreased commercial paper by $6 billion,\nresulting in $91 billion in total debt. Therefore, at the end of the\nquarter, net cash was $54 billion. During the quarter, we returned nearly\n$32 billion to shareholders. This included $3.9 billion in dividends and\nequivalents and $25 billion through open market repurchases of 93 million\nApple shares. As we move ahead into the March quarter, I'd like to review\nour outlook which includes the types of forward-looking information that\nSuhasini referred to.\n\nImportantly, the color we're providing assumes that global tariff rates,\npolicies and their application remain in effect as of this call, and the\nglobal macroeconomic outlook does not worsen from today. We expect our\nMarch quarter total company revenue to grow by 13% to 16% year-over-year,\nwhich comprehends our best estimates of constrained iPhone supply during\nthe quarter.\n\nWe expect services revenue to grow at a year-over-year rate similar to what\nwe reported in the December quarter. We expect gross margin to be between\n48% and 49%. We expect operating expenses to be between $18.4 billion and\n$18.7 billion, which is at a similar level to what we reported in the\nDecember quarter and driven by higher R&D on a year-over-year basis. We\nexpect OI&E to be around $100 million, excluding any potential impact from\nthe mark-to-market of minority investments and our tax rate to be around\n17.5%.\n\nFinally, today, our Board of Directors has declared a cash dividend of\n$0.26 per share of common stock payable on February 12, 2026, to\nshareholders of record as of February 9, 2026.\nWith that, let's open the call to questions.\n\nQuestion and Answer\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\n[Operator Instructions] Operator, may we have the first question, please?\n\nOperator\n\nCertainly. We'll go ahead and take our first question from Amit Daryanani\nof Evercore.\n\nAmit Jawaharlaz Daryanani\nEvercore ISI Institutional Equities, Research Division\n\nYes, I have 2. Maybe to start with -- there's a lot of focus on the impact\nof memory to a host of companies, and I'd love to kind of get your\nperspective when you folks are guiding gross margins up into the March\nquarter. Just talk about, a, your comfort in securing the bits that you\nneed for shipments? And b, how do we think about memory inflation flowing\nthrough Apple's model over time?\n\nTimothy D. Cook\nCEO & Director\n\nYes, Amit, it's Tim. Let me back up a bit and talk about the constraints\nthat Kevan referred to in his remarks and memory and try to get both of\nthese out at once. First of all, we were thrilled with the customer\nresponse on the latest iPhone lineup. It exceeded our expectations to say\nthe least. And iPhone grew 23%. What the result of that was, was that we\nexited the December quarter with very lean channel inventory due to that\nstaggering level of demand.\n\nAnd based on that, we're in a supply chase mode to meet the very high\nlevels of customer demand. We are currently constrained. And at this point,\nit's difficult to predict when supply and demand will balance. The\nconstraints that we have are driven by the availability of the advanced\nnodes that our SoCs are produced on. And at this time, we're seeing less\nflexibility in supply chain than normal, partly because of our increased\ndemand that I just spoke about.\n\nFrom a memory point of view, to answer your question, memory had a minimal\nimpact on the Q1, so the December quarter gross margin. We do expect it to\nbe a bit more of an impact to the Q2 gross margin and that was comprehended\nin the outlook of 48% to 49% that Kevan gave earlier.\n\nBeyond Q2, we don't obviously provide outlooks beyond the current quarter.\nBut we do continue to see market pricing for memory increasing\nsignificantly. As always, we'll look at a range of options to deal with\nthat. So hopefully, that gives you the full view.\n\nAmit Jawaharlaz Daryanani\nEvercore ISI Institutional Equities, Research Division\n\nI appreciate all the clarity on that, Tim. Maybe the other -- second\nquestion I have for you is maybe just touch on the China strength you folks\nhad. I think this is very close to all-time high revenues we've had in\nChina. What's driving the strength over here? And just sort of the\ndurability of the growth rate we saw in the December quarter would be\nhelpful to understand.\n\nTimothy D. Cook\nCEO & Director\n\nSure. Greater China was up 38% year-on-year. It was driven by iPhone where\nwe set an all-time revenue record. So it was the best iPhone quarter in\nhistory in Greater China. It's driven by the customer enthusiasm for the\niPhone 17 lineup. And I would tell you that during the quarter, traffic in\nour stores in China grew by strong double digits year-over-year. it was a\nterrific quarter. Our installed base reached an all-time high in both\nGreater China and Mainland China. And we set an all-time record for the\nupgraders and we saw strong double-digit growth on switchers.\n\nAnd according to a survey from World Panel, iPhones were the top 3\nsmartphones in urban China during the quarter. So it was -- and it's really\ndriven primarily by the product strength and the customer response to the\nproduct strength. We do see on non-iPhone products that the majority of\ncustomers that are buying a Mac, an iPad, a watch are still new to that\nproduct. So that's a very good sign for us. And if you look at iPad on that\nsame survey iPad was the top tablet model in urban China.\n\nAnd according to counterpoint the MacBook Air was the top-selling laptop\nmodel, and Mac Mini was the top selling desktop model in the December\nquarter. So Overall, a great quarter in China. We could not be more happy\nwith it.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Amit. Operator, could we get the next question, please?\n\nOperator\n\nOur next question is from Erik Woodring of Morgan Stanley.\n\nErik William Richard Woodring\nMorgan Stanley, Research Division\n\nTim, congrats on announcing the partnership with Google, and we're all\nexcited to see what you bring to market later this year. When I think about\nyour AI initiatives, it's clear there are added costs associated with that.\nWe're obviously seeing that flow through in OpEx. Can you help us\nunderstand maybe what the revenue upside potential that exists with AI?\nMany of your competitors have already integrated AI into their devices. And\nit's just not clear yet what incremental monetization they're seeing\nbecause of AI, but you're always disciplined with investing. You obviously\nhave a differentiated product. So how do you monetize AI? And what's the\ntime line to realizing that ROI? Then a quick follow-up.\n\nTimothy D. Cook\nCEO & Director\n\nWell, let me just say that we're bringing intelligence to more of what\npeople love, and we're integrating it across the operating system in\npersonal and private way. And I think that by doing so, it creates great\nvalue and that opens up a range of opportunities across our products and\nservices. And we're very happy with the collaboration with Google as well,\nI should add.\n\nErik William Richard Woodring\nMorgan Stanley, Research Division\n\nOkay. And then maybe just a follow-up. Now that you have kind of more time\nand data to evaluate this cycle, can you maybe help us understand what the\nprimary factors are driving strength in the iPhone? I'm sure there's a\nnumber of factors, but if you had to point to 1 or 2, just what would they\nbe? And how sustainable do you think those are?\n\nTimothy D. Cook\nCEO & Director\n\nI think it's different for different cohorts of where people are coming\nfrom in the device that they have. But it's a combination of things always\nthat make the product thing. It's the display. It's the camera. It's the\nperformance. It's the new selfie camera. It's the design. The design is\nbeloved. And so it's all of these things that come together at once and\nhave -- are producing a very strong product cycle as witnessed by our\nDecember quarter results.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Erik. Operator, could we get the next question, please?\n\nOperator\n\nWe'll now go to Michael Ng of Goldman Sachs.\n\nMichael Ng\nGoldman Sachs Group, Inc., Research Division\n\nWonderful. I have 2 as well, if I could. First, it was encouraging to hear\nabout the revenue growth outlook of 13% to 16% for the March quarter. I was\njust wondering if you could talk about any comps that we should be\nparticularly aware of as we kind of think about each of the product\ncategories? I know last year, you guys had MacBook Air with M4, the iPhone\n16E, the iPad A16 and the iPad Air with M3. So just wanted to ask if those\nthings would create tough comps? Or is it just less of an issue just given\nthe new product outlook?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Mike, it's Kevan. Thanks for the question. Yes, I wouldn't say there's\nany particular comp issue that we'd note. As you recall, last quarter, we\ntalked about the difficult comparison we had on Mac. But there's nothing\nthat rises to that kind of color that we'd outlined in the outlook. And so\nI think it's just a continuation of the strong cycle. We're seeing subject\nto the constraints that I had mentioned in the prepared remarks, and that\nTim alluded to a little earlier as well.\n\nMichael Ng\nGoldman Sachs Group, Inc., Research Division\n\nGreat. Wonderful. And then just on services, advertising, strong in the\nquarter. I wanted to ask about some of the new growth opportunities in\nadvertising. I know you guys are doing the new ad slots in the App Store.\nMaybe you could just talk a little bit about that? And then any plans to do\nmore in advertising across other products like Maps or TV?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, sure. Michael, what I would say, just if I step back in general, I\nthink as we outlined, we saw really good broad-based performance in our\nacross our services business, so ranging from all-time records in\nadvertising, music, payment services and cloud services. So I think we see\nreally good opportunities across a lot of our service categories. And we\ncontinue to add new service offerings. We talked about what we added to the\nwallet like Digital ID, and you referenced the additional kind of\nadditional ads coming in the search in the App Store, which we are excited\nabout. It provides advertisers more ways to be discovered.\n\nAnd so I think we'll continue to look for ways to expand opportunities to\nadd value to users and also create opportunities for Apple. I think as we\ntalked about, we created -- crossed really significant milestone at 2.5\nbillion active devices. So we really feel excited about the opportunity\nthat provides for our services business as well.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Mike. Operator, could we get the next question, please?\n\nOperator\n\nThe next question will be coming from Ben Reitzes of Melius.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nFirst question is on Google partnership again. I wanted to understand how\nyou came to that decision with regard to the AI and Siri in particular? And\nif there's an opportunity for you guys to share in revenue too with that\npartnership like you do in search?\n\nTimothy D. Cook\nCEO & Director\n\nYes. We basically determined that Google's AI technology would provide the\nmost capable foundation for AFM -- I'm sorry, Apple foundation models. And\nwe believe that we can unlock a lot of experiences and innovate in a key\nway due to the collaboration. We'll continue to run on the device and run\nin private cloud compute and maintain our industry-leading privacy\nstandards in doing so. In terms of the arrangement with Google, we're not\nreleasing the details of that.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nBummer. Okay. I tried. So yes, you knew it would be me. So the next\nquestion is on gross margin. I'm pretty shocked. I got to hand it to you,\nTim, that you're able to do 48% to 49%. What's really going on there? How\nare you doing that with this memory, the NAND prices? Is it due to mix that\nthere's a good -- less hardware and more services and services margins are\ngoing up? How are you doing it to go -- to keep it at 48% to 49%?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Ben, this is Kevan. Let me start maybe by just reflecting on the Q1\ngross margin. I think we talked about the fact that we landed at 48.2%. So\njust above the high end of the range that we provided on the last call. And\nI think if you look at that performance, we were up 100 basis points\nsequentially. We talked about the fact that we had favorable mix. I mean,\nas you know, when we have a good product cycle, a strong price cycle we're\nseeing for iPhone, that does lend itself to a bit more favorable\nopportunity on the mix and leverage side. So we're having a strong iPhone\ncycle, as Tim outlined. And so that also translated itself. We talked about\nproducts sequentially went up by 450 basis points.\n\nSo I think, in general, I think we're just seeing favorable mix dynamics as\nwell. Services continues to contribute as well. That business is growing\ndouble digits. So that also is a contributor. And I think that as we looked\nat our guidance, we're providing a similar range to where we reported in\nDecember. And there's going to be a few puts and takes. We do expect to see\nfavorable mix in the services. As you know, when we move from Q1 to Q2,\nthat tends to be the case, and that's partly offset by a seasonal loss of\nleverage. So there will be puts and takes. But again, we feel pretty good\nabout the guide of 48% to 49%, which is similar to the range we reported in\nDecember.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAll right. Thanks, Ben. Operator, could we get the next question, please?\n\nOperator\n\nThe next question will be coming from David Vogt of UBS.\n\nDavid Vogt\nUBS Investment Bank, Research Division\n\nMaybe Tim or Kevan, if we could pull out a little bit. Can you help us\nunderstand how you're thinking about the overall kind of smartphone market\ndemand, particularly given where memory prices are headed? And we've heard\nsome conversations with some other OEMs as well as component providers that\nare worried about either the availability of components, potential market\nweakness in terms of demand destruction and some of the actions to offset\nour higher prices? I know you don't give outlooks for the full year, but\nhow are you thinking about all of those different vectors and what that\nmight mean for the overall smartphone market? And then ultimately, what\nthat might mean for demand for iPhones as we move through the rest of this\ncalendar year?\n\nTimothy D. Cook\nCEO & Director\n\nYes. On the supply side, I had made comments earlier about the constraint\nthat we are seeing in Q2. We -- and that's reflected in the revenue\nguidance that Kevan gave earlier. The constraint, as I'd mentioned, is due\nto the advanced node capacity. And it's really a result of growing so well\nin Q1 with the 23% and having less flexibility partly due to that in the\nprocess to increase it as much as we would like to increase it. Beyond Q2,\nI don't really want to comment on supply. Its -- supply is a function of a\nlot of things in the industry that move around a lot. So I wouldn't want to\ncomment on that.\n\nAnd I commented before on the -- on memory pricing. And so hopefully, that\nanswers your question. In terms of smartphone demand, we believe that based\non the information that we've got is we gained share in the December\nquarter. Obviously, the market wasn't growing at 23%. So we feel good about\ndoing that. And -- but I don't -- I wouldn't want to predict how the market\nreacts in the future. It's very difficult to do that.\n\nDavid Vogt\nUBS Investment Bank, Research Division\n\nGot it. At the risk of not getting this answered, I'm going to follow up\nwith, can you maybe help us understand, you mentioned there's a range of\noptions that you're looking at. How do -- how should we think about kind of\nlike LTAs in the marketplace? I mean, is that an option as we move through\nthe year? Or is it more spot-based from -- on a perspective, particularly\naround memory? Just want to get a better sense for how we should think\nabout kind of the dynamics in the marketplace.\n\nTimothy D. Cook\nCEO & Director\n\nIt's a range. And so I don't want to get more specific than that. I mean\nthere are different levers that we can push and who knows how successful\nthey'll be, but there's just a range of options.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nGreat. Thank you, David. Operator, could we get the next question, please?\n\nOperator\n\nWe'll now be taking questions from Wamsi Mohan from Bank of America.\n\nWamsi Mohan\nBofA Securities, Research Division\n\nTim, on services, you grew a pretty impressive 14%. And I know you said\nthat the App Store was a record for the December quarter. But third-party\ndata is showing a notable deceleration in App Store growth, maybe 7% in the\nDecember quarter relative to your 14% growth. I was hoping if you could\nmaybe confirm that. And secondarily, if it's correct, what might be some of\nthe drivers of that? And what could be things that you could do to reverse\nthat in future quarters? And I have a follow-up.\n\nKevan Parekh\nSenior VP & CFO\n\nWamsi, it's Kevan here. Look, I think we want to reiterate the fact that\nduring the December quarter, we had a quarterly record on the App Store. As\nyou know, we don't provide specific color on how the individual services\ncategories have done. But again, if we step back, I think we saw, again,\nbroad-based growth across all the different categories, also across various\ngeographies. We had all-time records in both developed and emerging markets\nas well. So -- and double-digit growth in both of those too. And so I think\nin general, we don't provide the color at the detailed services level.\n\nWamsi Mohan\nBofA Securities, Research Division\n\nOkay. I guess back to the memory price. I appreciate you have a range of\noptions to address that. Historically, Apple has not used a pricing lever\nunless FX markets got maybe very dislocated to prevent arbitrage or issues\nlike that. But given some of these unprecedented moves in memory, would\npricing be a lever that you would be willing to pull or push outside of\nevery other thing that -- outside of everything else that you can do?\n\nTimothy D. Cook\nCEO & Director\n\nYes, I wouldn't want to speculate on that one.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThanks, Wamsi. Operator, could we have the next question, please?\n\nOperator\n\nWe'll now go to Samik Chatterjee of JPMorgan.\n\nSamik Chatterjee\nJPMorgan Chase & Co, Research Division\n\nMaybe for the first one, I'm just looking at your capital investment in the\nfirst quarter, which did moderate from the last one. And wondering if the\npartnership with Google on Gemini and sort of help collaboration to develop\nthe next generation of Apple foundation models, does that have any near-\nterm sort of impact on your intent to use Apple Private Cloud? I know you\nemphasized sort of the role Apple Private Cloud plays in the long term. But\nare there any changes on that front through this collaboration? Any\nthoughts around that? And I have a quick follow-up.\n\nKevan Parekh\nSenior VP & CFO\n\nYes, sure. I think -- this is Kevan here. I think in general, as Tim\noutlined, we weren't going to provide any details on our arrangement and\ncollaboration with Google. Just speaking of CapEx, in general, as you know,\nwe have a hybrid model for CapEx. And so I think that what happens is our\nCapEx can be volatile, independent of kind of the volume and the\nperformance of our business. And as you know, our CapEx is made of several\ndifferent line items that include tooling, our facilities, retail\ninvestments -- investments in our retail store, data centers. And on\ntooling and data centers, we leverage this hybrid model that I mentioned\nbefore, which we leverage a combination of first and third-party capacity.\n\nSo in general, it's hard to read into the CapEx and draw any conclusions.\nAnd so I think I would just say there's going to be some ebbs and flows in\nCapEx. Last year, remember, we did build out our private cloud compute\nenvironment. And so we did have CapEx spending related to that in our\nresults in December.\n\nSamik Chatterjee\nJPMorgan Chase & Co, Research Division\n\nGot it. Got it. And my follow-up probably is for you again. You did mention\nproduct gross margin and the sort of drivers there for the product gross\nmargin improvement. When you sort of highlighted mix as a driver, can you\njust sort of talk through what are the big differences in mix you're seeing\nfor iPhone 17 versus 16? And did tariffs and tariffs coming in more\nfavorable play a role at all and what you're expecting for tariffs for the\nnext quarter?\n\nKevan Parekh\nSenior VP & CFO\n\nYes. So there's a few things to unpack there. So on the overall margin on\nproduct side, I think I mentioned that we had favorable mix of products and\nleverage. I think given the strong iPhone cycle we're seeing, that was, I\nwould say, probably a higher favorability than you might have seen in maybe\nother cycles. And as well, as you know, in Q1, typically, we do see the\nimpact of the cost structure of our new products that we launch. And in\nthis case, we are seeing a more favorable offset from mix of products and\nleverage versus historical -- sequential changes from Q4 to Q1. On the\ntariff piece, we had outlined an amount of $1.4 billion for the December\nquarter, and we landed roughly in that range at that level.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Samik. Operator, could we have the next question,\nplease?\n\nOperator\n\nWe'll now go to Krish Sankar of TD Cowen.\n\nKrish Sankar\nTD Cowen, Research Division\n\nThe first one I have was for Tim. I think you touched upon this earlier on\nthe Gemini integration and Apple foundation model. How to think about kind\nof like the difference between Apple foundation model functionality and\nthird-party models? Like does the Apple foundation model evolve to a\ndifferent layer in the AI software stack? Or how to think about it as you\npartner with third-party frontier models? And I had a follow-up.\n\nTimothy D. Cook\nCEO & Director\n\nYes. Krish, you should think of it as a collaboration. And we'll obviously\nindependently continue to do some of our own stuff. But you should think of\nwhat is going to power the personalized version of Siri is the\ncollaboration with Google.\n\nKrish Sankar\nTD Cowen, Research Division\n\nGot it. And then, a quick follow-up for maybe Kevan or Tim. Just a lot of\ndiscussion on memory pricing. Given that the memory constraint or commodity\nscarcity is impacting both the smartphone and the PC markets, and Apple,\narguably having more purchasing power. Do you think this is a chance for\nyou to increase your market share, both in iPhone and Mac at the expense of\ncompetition who might have more constraints in getting access to memory?\n\nTimothy D. Cook\nCEO & Director\n\nYes. I don't want to talk about kind of what has happened. And we do\nbelieve, as I had shared that iPhone gained share in the December quarter.\nAnd if you look at Mac for the full year of full calendar year '25, we also\nbelieve we gained share. And so we feel very good about our position.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Krish. Operator, could we have the next question, please?\n\nOperator\n\nWe'll now go to Atif Malik calling from Citi.\n\nAtif Malik\nCitigroup Inc., Research Division\n\nThe first one for Tim. Tim, some of the industry pundits are comparing the\niPhone 17 upgrade cycle to the 2020, 2021 years as some of the iPhone 12,\n13 users upgrade. Curious if you agree with that view? And also, if you can\nlayer on the impact from Apple Intelligence to the refresh rate?\n\nTimothy D. Cook\nCEO & Director\n\nI think each iPhone cycle has its own unique characteristics. And so I\nwouldn't compare it to a specific one. I think iPhone 17, the family of 17\nis a unique product that brings several very compelling features in one\nproduct, and it has done extremely well. And so we feel quite good about\nit.\n\nKevan Parekh\nSenior VP & CFO\n\nAtif, I'll just add to Tim's comment that we talked about the fact we have\na large and diverse installed base of customers. And so this product has\nreally resonated with multiple cohorts, whether you're on older devices or\nnewer iPhones as well. So we've seen really strong reaction to the product\nlineup.\n\nAtif Malik\nCitigroup Inc., Research Division\n\nGreat. As my follow-up, there was a lot of discussion on supply\nconstraints. And I'm surprised that you guys are constrained on advanced\npackaging as you generally get your share at the big foundry. How long will\nthese supply impact your ability to ship to true demand?\n\nTimothy D. Cook\nCEO & Director\n\nIt's difficult to estimate demand when you haven't met the demand. And so\nwe've -- obviously, we have internal estimates on that, but I don't want to\nshare those. But it's very difficult. And just to be clear, it's the\nadvanced nodes that we -- like 3-nanometer to be specific, where our SoCs\nor the latest SoCs are produced on as to what is gating the Q2 supply. And\nit's a direct result of the 23% growth, and that far outstripping what we\nhad internally estimated and having more limited flexibility in the supply\nchain for some period of time. But I don't want to estimate when supply and\ndemand will balance at this point.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Atif. Operator, could we have the next question, please?\n\nOperator\n\nThe next question will be coming from Aaron Rakers coming from Wells Fargo.\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI have 2 as well, and I'll try and stay away from the memory question. I'm\ncurious -- and obviously, a lot of focus on the China demand, but I'm\ncurious, you also called out India. And so can you maybe unpack some of the\nthings that you're seeing in the Indian market as far as iPhone traction?\nAny kind of color on what is a very large installed base in India that\nseems to be a good growth opportunity for Apple still?\n\nTimothy D. Cook\nCEO & Director\n\nYes. Thanks for the question. We did set a quarterly revenue record during\nthe December quarter. And to go a little further down, we set quarterly\nrevenue records on iPhone and Mac and iPad and an all-time revenue record\non services. So it was a terrific quarter in India. We really like what we\nsee there. It's the second largest smartphone market in the world and the\nfourth largest PC market. So -- and we still have, despite a very nice\ngrowth history, we have modest share there. And so we think there's a huge\nopportunity for us there. And we could not be more excited about it.\n\nIf you look at the -- the other thing that I would point out is that the\nmajority of customers that are buying iPhone and Mac and iPad and watch are\nall new to that product. And so it speaks very well to opportunity there.\n\nKevan Parekh\nSenior VP & CFO\n\nYes. And Aaron, I'd add, you mentioned the installed base. We're seeing\nstrong double-digit growth in the installed base in India as well, which is\nreally encouraging.\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. And then as a quick follow-up, kind of tied to memory, maybe not so\nmuch. But part of this current generation iPhone cycle is you clearly\ndeepened some of your own internal silicon capabilities on the device. I'm\ncurious if that -- if we should think about that as a lever and maybe a\nsupportive factor to gross margin that might be underappreciated? Any\nthoughts on where we go from here as far as continued opportunities of\ninternalizing your own silicon?\n\nTimothy D. Cook\nCEO & Director\n\nYes. I'll let Kevan talk about the gross margin. But in terms of the\nproduct, which is at the heart of what we think about in the user. Apple\nSilicon has just been an incredible game changer for us, starting with\niPhone and then on iPad and of course, the Mac as of a few years ago. And\nso we believe it's a game changer and a major competitive advantage.\n\nKevan Parekh\nSenior VP & CFO\n\nYes. And as far as impact on gross margin, we have been, as you know,\ninvesting in core technologies like our own silicon, our own modem. And\ncertainly, while those do provide opportunities for cost savings and can be\nreflected in margins, they also importantly provide the differentiation\nthat's really important for our products as well and give us more control\nof our road map. So I think there's a lot of strategic value to it, but\nalso we are seeing investments in our core technologies impacting gross\nmargin in a positive way.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Aaron. Operator, could we have our last question,\nplease?\n\nOperator\n\nMost certainly. Our last question will be coming from Richard Kramer\ncalling from Arete Research.\n\nRichard Alan Kramer\nArete Research Services LLP\n\nI have 2 questions. Tim, when you think about how Apple might manage AI, do\nyou see that evolving towards more edge AI or on device services versus\ncloud-based AI? And are you confident you've reserved sufficient data\ncenter capacity to support the widespread Siri adoption, especially given\nthat you're not following the other hyperscalers and sharply increasing\nCapEx?\n\nTimothy D. Cook\nCEO & Director\n\nThe answer is that we see both being important, the on-device and the\nprivate cloud compute. And so we don't see it as an either/or we see it as\nboth. And we believe it's a differentiator because of our privacy approach.\nIn terms of do we have enough capacity, it's hard to estimate with\nprecision what the demand will be. But we've done the -- sort of the best\njob that we can do and either have or are putting capacity in for it.\n\nRichard Alan Kramer\nArete Research Services LLP\n\nOkay. And you also -- you mentioned the $2.5 billion active device number\nbut Apple Intelligence features have only been available since the 15 Pro.\nSo can you speak at all to roughly what portion of your iPhone or overall\nactive device installed base is now AI capable? And has this been a factor\nin maybe a more gradual pace of launching wider AI services?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Richard, this is Kevan. We don't provide that specific number, but it\nis a growing number, as you can imagine in our installed base. And so we're\nencouraged by the amount of devices now that are capable, but we're not\ngoing to provide a specific figure on that today.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAll right. Thank you, Richard. A replay of today's call will be available\nfor 2 weeks on Apple podcast as a webcast on apple.com/investor and via\ntelephone. The number for the telephone replay is (866) 583-1035. Please\nenter confirmation code 890-2968 followed by the pound sign. These replays\nwill be available by approximately 5:00 p.m. Pacific Time tonight. Members\nof the press with additional questions can contact Josh Rosenstock at (408)\n862-1142. And financial analysts can contact me, Suhasini Chandramouli with\nadditional questions at (408) 974-3123. Thanks again for joining us today.\n\nOperatorOnce again, this does conclude today's conference. We do appreciate\nyour participation.\nCopyright  2026 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2026 S&P Global Market Intelligence.",
  "presentation_text": "Suhasini Chandramouli\nDirector of Investor Relations\n\nGood afternoon, and welcome to the Apple Q1 Fiscal Year 2026 Earnings\nConference Call. My name is Suhasini Chandramouli, Director of Investor\nRelations. Today's call is being recorded. Speaking first today is Apple's\nCEO, Tim Cook, and he'll be followed by CFO, Kevan Parekh. After that,\nwe'll open the call to questions from analysts.\n\nPlease note that some of the information you'll hear during our discussion\ntoday will consist of forward-looking statements, including, without\nlimitation, those regarding revenue, gross margin, operating expenses,\nother income and expense, taxes, capital allocation and future business\noutlook. These statements involve risks and uncertainties that may cause\nactual results or trends to differ materially from our forecast including\nrisks related to the potential impact to the company's business and results\nof operations from macroeconomic conditions, tariffs and other measures and\nlegal and regulatory proceedings.\n\nFor more information, please refer to the risk factors discussed in Apple's\nmost recently filed reports on Form 10-Q and Form 10-K and the Form 8-K\nfiled with the SEC today, along with the associated press release.\nAdditional information will also be in our report on Form 10-Q for the\nquarter ended December 27, 2025, to be filed tomorrow and in other reports\nand filings we make with the SEC. Apple assumes no obligation to update any\nforward-looking statements, which speak only as of the date they are made.\n\nI'd now like to turn the call over to Tim for introductory remarks.\n\nTimothy D. Cook\nCEO & Director\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the\ncall. I am proud to say that we just had a quarter for the record books. We\nare reporting our best-ever quarter with $143.8 billion in revenue, up 16%\nfrom a year ago and exceeding our expectations. The demand for iPhone was\nsimply staggering with revenue growing 23% year-over-year and all-time\nrecords across every geographic segment.\n\nServices set an all-time revenue record as well, up 14% from a year ago,\nand EPS reached an all-time record of $2.84, growing a robust 19% year-over-\nyear. We set all-time revenue records in the Americas, Europe, Japan and\nrest of Asia Pacific and grew in the vast majority of markets we track. We\ncontinue to gain momentum in emerging markets which includes India, where\nwe saw strong double-digit revenue growth. Greater China also grew 38% year-\nover-year, driven by iPhone, which had record upgraders and double-digit\ngrowth on switchers.\n\nApple's December quarter results underscore our relentless commitment to\ninnovation to our customers and to our mission to build the best products\nand services in the world.\n\nNow I'd like to take a closer look at results from across our lineup,\nbeginning with iPhone. As I mentioned earlier, it was a fantastic quarter\nfor iPhone with an all-time revenue record of $85.3 billion, up 23% year-\nover-year. This is the strongest iPhone lineup we've ever had and by far,\nthe most popular. Throughout the quarter, customer enthusiasm for iPhone\nwas simply extraordinary. Users were incredibly excited about everything\nenables them to do. iPhone 17 Pro and 17 Pro Max delivered the ultimate\niPhone experience. They feature the best ever performance in battery life\non an iPhone, the most advanced camera system and a striking design. iPhone\nAir, our slimmest and lightest smartphone yet, packs powerful capabilities\ninto an ultra slim and sleek design. And iPhone 17 is a truly fantastic\nupgrade at an incredible value.\n\nTurning to Mac. Revenue was $8.4 billion for the December quarter. We were\npleased to see the Mac installed base reach another all-time high with\nnearly half of customers who purchased the Mac being new to the product.\nThe M5 powered 14-inch MacBook Pro takes a huge leap in AI performance,\nthanks to the next-generation GPU architecture and a faster neural engine.\n\nFrom the world's most popular laptop for consumers and businesses in\nMacBook Air to the small and spectacular Mac Mini, every Mac in our lineup\nhas something special to offer users. And with the recently released Apple\nCreator Studio available across Mac, iPad and iPhone, creators have more\ntools at their fingertips to make incredible music or turn their devices\ninto a video production studio.\n\nMeanwhile, iPad saw December quarter revenue of $8.6 billion, up 6% from a\nyear ago with an all-time record for upgraders. We are proud to have our\nstrongest lineup ever from iPad powered by A16, which is proving to be\nincredibly popular to iPad Air with its amazing versatility to the\nunbelievably powerful M5 iPad Pro with its remarkably thin and light\ndesign. It's no wonder that iPad continued to be the most popular tablet in\nthe world. Across Wearables, Home and Accessories, revenue was $11.5\nbillion. With Apple Watch Ultra 3 and Apple Watch Series 11, users are\ntapping into a comprehensive set of health and wellness features to help\nthem meet their health goals.\n\nIn a recent survey, we see an increasing number of users telling us they're\nwearing their watch to sleep, which allows them to check their sleep scores\neach morning and find ways to improve their sleep quality. And Apple Watch\nalerts are enabling important conversations between users and their doctors\nregarding potential signs of hypertension.\n\nThese are just some of the many ways that watch is helping people live\nhealthier lives. The response to AirPods Pro 3 has been amazing. Customers\nare raving about the rich immersive sound quality, the unmatched level of\nactive noise cancellation and the noticeably improved comfort that makes\nthem effortless to wear.\n\nFeatures like live translation are also changing the way people can\ncommunicate by helping users connect across languages in real time and\nmaking everyday conversations feel more natural and accessible. Together,\nthese innovations create an experience that feels both powerful and\npersonal and the enthusiasm we are seeing reflects just how strongly\nAirPods Pro 3 are resonating with customers.\n\nAcross our product categories, we are seeing very high levels of customer\nsatisfaction, and we are proud to report that we have a new record for our\ninstalled base with more than 2.5 billion active devices. During the\nquarter, we were excited to see that the majority of users on enabled\niPhones are actively leveraging the power of Apple Intelligence. Since the\nlaunch of Apple Intelligence, we've introduced dozens of features,\nincluding writing tools and cleanup and made it available in 15 languages.\n\nThese AI experiences are personal, private, integrated across our platforms\nand relevant to what our users do every day. We are bringing intelligence\nto more of what people already love about our products so we can make every\nexperience even more capable and effortless.\n\nOne of our most popular features is visual intelligence which helps users\nlearn and do more than ever with the content on their iPhone screen, making\nit faster to search, take action and answer questions across their apps.\nAnd as I touched on earlier, we are hearing powerful stories of people\nusing live translation to communicate seamlessly across languages.\n\nAnd these are just some of the many powerful AI features that are enabling\nour users to do remarkable things with our products, which are far and away\nthe best platforms in the world for AI. That's a no small part because of\nthe extraordinary power and performance of Apple Silicon. Building on our\nefforts in the AI space, we are also collaborating with Google to develop\nthe next generation of Apple foundation models. This will help power future\nApple Intelligence features, including a more personalized series coming\nthis year. We're incredibly excited for what's to come with so many new\nexperiences to unlock.\n\nTurning to services. We achieved an all-time revenue record of $30 billion,\n14% higher from a year ago. Services also set all-time revenue records in\nboth developed and emerging markets. Apple TV has seen fantastic momentum\nwith December seeing a 36% increase in viewership over the previous year.\nIt's no wonder with shows like Pluribus which are creating landmark\ncultural moments that audiences are loving. Anticipation is building for\nupcoming new productions like Cape Fear from Steven Spielberg and Martin\nScorsese. And we are thrilled to announce that Ted Lasso will be returning\nfor a fourth season this summer.\n\nSix years since launch, we're excited by the growing enthusiasm viewers\nhave for Apple TV, and we are grateful for the accolades that have\nfollowed, most recently at the Critics Choice and Golden Globe Awards. To\ndate, Apple TV productions have earned more than 650 wins and more than\n3,200 nominations, including a recently announced Oscar nomination for Best\nPicture for F1, the movie. And speaking of F1, we're also approaching the\nstart of a new Formula 1 season, and for F1 fans in the U.S., Apple TV will\nbe the place to watch every practice, qualifying, Sprint and Grand Prix.\nMLS fans will also be able to watch every regular and post-season game with\ntheir Apple TV subscription this year, and we're looking forward to kick\noff in the coming weeks.\n\nLooking back, 2025 was a fantastic year for services as we rolled out\namazing new features and broke records. Apple Music climbed to all-time\nhighs in both listenership and new subscriber growth. Apple Pay eliminated\nmore than $1 billion in fraud for our partners last year, and we've made it\navailable in more markets than ever before. And last year, we welcomed more\nthan 850 million users every week on average to the App Store, the world's\nsafest and most innovative app marketplace. Developers have now earned more\nthan $550 billion on our platform since 2008.\n\nIn retail, we continue to bring a magical experience to our customers all\naround the world, and we were thrilled to have our best ever results in\nretail during the quarter. We were excited to open our fifth store in India\nin December and have plans to open another store in Mumbai soon.\n\nWherever we are, we see ourselves as part of a larger whole. That's why we\nshow up with our values in everything we do. That means working with\npartners in places like Vietnam to bring more clean water to rural areas.\nIt means celebrating graduations of new classes of innovators from our\ndeveloper academies in places such as Brazil, Indonesia and South Korea. It\nmeans 3D printing titanium cases for Apple Watch using recycled materials\nso that they're better for the planet without compromising quality and so\nmuch more.\n\nWe're especially proud of the work we're doing to support American\ninnovation. Last year, we committed to invest $600 billion over 4 years in\nvital industries like advanced manufacturing, silicon engineering and\nartificial intelligence. As we're building on our long-standing investments\nin America, we're supporting nearly 0.5 million jobs with thousands of\nsuppliers across all 50 states.\n\nIn the year since we made our initial commitment, we're making great\nprogress. Today, we're shipping servers to power Apple intelligence from\nour new manufacturing facility in Houston. Through our advanced\nmanufacturing program, we're working with Corning in Kentucky to make 100%\nof cover glass for iPhone and Apple Watch. We're working with Micron, which\nbroke ground on a new advanced chip packaging and test facility, and we\ncontinue to advance the development of an end-to-end silicon supply chain\nacross the country sourcing 20 billion U.S. chips in 2025.\n\nThrough our Apple Manufacturing Academy in Detroit, we're already training\nAmerican businesses and innovators on the latest smart manufacturing and\nartificial intelligence techniques. Six months since opening, the Academy\nis already making an enormously positive impact for businesses working\nalongside Apple engineers to drive productivity, efficiency and quality in\ntheir supply chains. As I said at the beginning of my remarks, this was in\nso many ways, a remarkable quarter for Apple. And we're excited for all the\nopportunities we'll have in the year ahead to deliver innovations that have\nnever been seen before and enrich the lives of users every step of the way.\n\nWith so much to look forward to in the weeks and months ahead, I have every\nconfidence that our best work is yet to come.\n\nWith that, I'll turn it over to Kevan.\n\nKevan Parekh\nSenior VP & CFO\n\nThanks, Tim, and good afternoon, everyone. Our revenue of $143.8 billion\nwas up 16% year-over-year, our best quarter ever. Across the world, we set\nall-time revenue records in both developed and emerging markets. And we saw\ndouble-digit growth year-over-year across the majority of the markets we\ntrack, including the U.S., Latin America, Western Europe, Greater China,\nIndia and South Asia.\n\nProducts revenue was $113.7 billion, up 16% year-over-year, driven by\ndouble-digit growth in iPhone, setting a new all-time record. And as Tim\nmentioned, thanks to our strong levels of customer loyalty and\nsatisfaction, our installed base of active devices has now surpassed $2.5\nbillion, reaching another all-time high across all product categories and\ngeographic segments.\n\nServices revenue was $30 billion, up 14% year-over-year. This performance\ncontinues to be broad-based with double-digit growth in almost every market\nwe track. We also reached all-time revenue records for advertising, cloud\nservices, music and payment services with December quarter records on the\nApp Store and video. Company gross margin was at 48.2%, above the high end\nof our guidance range and up 100 basis points sequentially, driven by\nfavorable mix and leverage. Products gross margin was 40.7%, up 450 basis\npoints sequentially driven by favorable mix and leverage. Services gross\nmargin was 76.5%, up 120 basis points sequentially, driven by mix.\n\nOperating expenses landed at $18.4 billion, up 19% year-over-year. This was\nwithin the range we provided and driven by increased investment in R&D. Net\nincome was $42.1 billion and diluted earnings per share was $2.84, up 19%\nyear-over-year. Both net income and diluted EPS were all-time records and\nthese incredibly strong business results drove an all-time record for\noperating cash flow coming in at $53.9 billion.\n\nNow I'm going to provide some more details for each of our revenue\ncategories. iPhone revenue was $85.3 billion, up 23% year-over-year, driven\nby the iPhone 17 family. iPhone saw strength around the world reaching all-\ntime revenue records in many of the markets we track, including the U.S.,\nGreater China, Latin America, Western Europe, the Middle East, Australia\nand South Asia as well as a December quarter record in India. The iPhone\nactive installed base grew to an all-time high and set a new all-time\nrecord for upgraders in aggregate and across many countries, including the\nU.S., China Mainland, Japan and India.\n\nAccording to a recent survey from World Panel, iPhone was a top-selling\nmodel in the U.S., Urban China, the U.K., Australia and Japan. Customers\nare loving the latest iPhone lineup. The latest customer satisfaction for\nthe iPhone 17 family in the U.S. was measured at 99% by 451 Research. Mac\nrevenue was $8.4 billion, down 7% year-over-year. As we described in the\nlast call, we faced a very difficult compare against an M4 MacBook Pro, Mac\nMini and iMac launches in the year ago quarter. Despite this difficult\ncompare, we continue to see growth in several emerging markets, including\nBrazil, India, Malaysia, Vietnam and more.\n\nAnd as Tim mentioned earlier, the Mac installed base reached another all-\ntime high with nearly half of the customers who purchased the Mac being new\nto the product. And in the U.S., customer satisfaction for Mac was measured\nat 97%. iPad revenue was $8.6 billion, up 6% year-over-year, driven by the\nM5 powered iPad Pro and the A16 powered iPad. We continue to add new users\nto the iPad. In fact, over half the customers who purchased the iPad during\nthe quarter were new to the product. This helped the iPad installed base to\nreach an all-time high and we also reached an all-time high for upgraders.\nBased on the latest reports from 451 Research, customer satisfaction was\n98% in the U.S.\n\nWearables, Home and Accessories revenue was $11.5 billion, down 2% year-\nover-year. During the quarter, we experienced constraints on the AirPods\nPro 3, and we believe the overall category would have grown had it not been\nfor these constraints. The Wearables installed base reached a new all-time\nhigh, with over half of the customers purchasing an Apple Watch during the\nquarter being new to the product. And in the U.S., customer satisfaction\nwas recently reported at 96%.\n\nOur services revenue reached an all-time high of $30 billion, up 14% year-\nover-year. As we said earlier, we had all-time revenue records on\nadvertising, music, payment services and cloud services where we saw a\ndouble-digit growth on paid subscribers. We continue to be optimistic about\nthe future of our services business. With our installed base of over 2.5\nbillion active devices, we have an incredibly strong foundation for new\ngrowth opportunities. We saw increased customer engagement across our\nservice offerings with both transacting and paid accounts reaching all-time\nhighs in the quarter.\n\nAnd we continue to improve quality and expand the breadth of our services\nofferings. From new wallet features like Digital ID, which provides a way\nfor users to create an ID in wallet using information from their U.S.\nPassport to additional ads coming to search in the App Store, which\nprovides advertisers more ways to drive downloads from search.\n\nTurning now to enterprise. Organizations are continuing to expand their\nfleet of Apple devices to drive productivity while remaining secure.\nSnowflake has deployed over 9,000 Mac devices company-wide, establishing\nMac as a primary laptop across all business units, resulting in increased\nperformance and a reduction in support tickets. AstraZeneca is rolling out\nover 5,000 M5 powered iPad Pros to its pharmaceutical sales team to take\nadvantage of AI capabilities, including Apple Intelligence, while meeting\nwith clinicians daily. And in Mexico, Coppel, the country's largest\ndomestic retailer recently added MacBook Air in addition to a growing fleet\nof over 10,000 iPad devices.\n\nLet's turn to our cash position and capital return program. We ended the\nquarter with $145 billion in cash and marketable securities. We had $2.2\nbillion of debt maturities and decreased commercial paper by $6 billion,\nresulting in $91 billion in total debt. Therefore, at the end of the\nquarter, net cash was $54 billion. During the quarter, we returned nearly\n$32 billion to shareholders. This included $3.9 billion in dividends and\nequivalents and $25 billion through open market repurchases of 93 million\nApple shares. As we move ahead into the March quarter, I'd like to review\nour outlook which includes the types of forward-looking information that\nSuhasini referred to.\n\nImportantly, the color we're providing assumes that global tariff rates,\npolicies and their application remain in effect as of this call, and the\nglobal macroeconomic outlook does not worsen from today. We expect our\nMarch quarter total company revenue to grow by 13% to 16% year-over-year,\nwhich comprehends our best estimates of constrained iPhone supply during\nthe quarter.\n\nWe expect services revenue to grow at a year-over-year rate similar to what\nwe reported in the December quarter. We expect gross margin to be between\n48% and 49%. We expect operating expenses to be between $18.4 billion and\n$18.7 billion, which is at a similar level to what we reported in the\nDecember quarter and driven by higher R&D on a year-over-year basis. We\nexpect OI&E to be around $100 million, excluding any potential impact from\nthe mark-to-market of minority investments and our tax rate to be around\n17.5%.\n\nFinally, today, our Board of Directors has declared a cash dividend of\n$0.26 per share of common stock payable on February 12, 2026, to\nshareholders of record as of February 9, 2026.\nWith that, let's open the call to questions.",
  "qa_text": "Suhasini Chandramouli\nDirector of Investor Relations\n\n[Operator Instructions] Operator, may we have the first question, please?\n\nOperator\n\nCertainly. We'll go ahead and take our first question from Amit Daryanani\nof Evercore.\n\nAmit Jawaharlaz Daryanani\nEvercore ISI Institutional Equities, Research Division\n\nYes, I have 2. Maybe to start with -- there's a lot of focus on the impact\nof memory to a host of companies, and I'd love to kind of get your\nperspective when you folks are guiding gross margins up into the March\nquarter. Just talk about, a, your comfort in securing the bits that you\nneed for shipments? And b, how do we think about memory inflation flowing\nthrough Apple's model over time?\n\nTimothy D. Cook\nCEO & Director\n\nYes, Amit, it's Tim. Let me back up a bit and talk about the constraints\nthat Kevan referred to in his remarks and memory and try to get both of\nthese out at once. First of all, we were thrilled with the customer\nresponse on the latest iPhone lineup. It exceeded our expectations to say\nthe least. And iPhone grew 23%. What the result of that was, was that we\nexited the December quarter with very lean channel inventory due to that\nstaggering level of demand.\n\nAnd based on that, we're in a supply chase mode to meet the very high\nlevels of customer demand. We are currently constrained. And at this point,\nit's difficult to predict when supply and demand will balance. The\nconstraints that we have are driven by the availability of the advanced\nnodes that our SoCs are produced on. And at this time, we're seeing less\nflexibility in supply chain than normal, partly because of our increased\ndemand that I just spoke about.\n\nFrom a memory point of view, to answer your question, memory had a minimal\nimpact on the Q1, so the December quarter gross margin. We do expect it to\nbe a bit more of an impact to the Q2 gross margin and that was comprehended\nin the outlook of 48% to 49% that Kevan gave earlier.\n\nBeyond Q2, we don't obviously provide outlooks beyond the current quarter.\nBut we do continue to see market pricing for memory increasing\nsignificantly. As always, we'll look at a range of options to deal with\nthat. So hopefully, that gives you the full view.\n\nAmit Jawaharlaz Daryanani\nEvercore ISI Institutional Equities, Research Division\n\nI appreciate all the clarity on that, Tim. Maybe the other -- second\nquestion I have for you is maybe just touch on the China strength you folks\nhad. I think this is very close to all-time high revenues we've had in\nChina. What's driving the strength over here? And just sort of the\ndurability of the growth rate we saw in the December quarter would be\nhelpful to understand.\n\nTimothy D. Cook\nCEO & Director\n\nSure. Greater China was up 38% year-on-year. It was driven by iPhone where\nwe set an all-time revenue record. So it was the best iPhone quarter in\nhistory in Greater China. It's driven by the customer enthusiasm for the\niPhone 17 lineup. And I would tell you that during the quarter, traffic in\nour stores in China grew by strong double digits year-over-year. it was a\nterrific quarter. Our installed base reached an all-time high in both\nGreater China and Mainland China. And we set an all-time record for the\nupgraders and we saw strong double-digit growth on switchers.\n\nAnd according to a survey from World Panel, iPhones were the top 3\nsmartphones in urban China during the quarter. So it was -- and it's really\ndriven primarily by the product strength and the customer response to the\nproduct strength. We do see on non-iPhone products that the majority of\ncustomers that are buying a Mac, an iPad, a watch are still new to that\nproduct. So that's a very good sign for us. And if you look at iPad on that\nsame survey iPad was the top tablet model in urban China.\n\nAnd according to counterpoint the MacBook Air was the top-selling laptop\nmodel, and Mac Mini was the top selling desktop model in the December\nquarter. So Overall, a great quarter in China. We could not be more happy\nwith it.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Amit. Operator, could we get the next question, please?\n\nOperator\n\nOur next question is from Erik Woodring of Morgan Stanley.\n\nErik William Richard Woodring\nMorgan Stanley, Research Division\n\nTim, congrats on announcing the partnership with Google, and we're all\nexcited to see what you bring to market later this year. When I think about\nyour AI initiatives, it's clear there are added costs associated with that.\nWe're obviously seeing that flow through in OpEx. Can you help us\nunderstand maybe what the revenue upside potential that exists with AI?\nMany of your competitors have already integrated AI into their devices. And\nit's just not clear yet what incremental monetization they're seeing\nbecause of AI, but you're always disciplined with investing. You obviously\nhave a differentiated product. So how do you monetize AI? And what's the\ntime line to realizing that ROI? Then a quick follow-up.\n\nTimothy D. Cook\nCEO & Director\n\nWell, let me just say that we're bringing intelligence to more of what\npeople love, and we're integrating it across the operating system in\npersonal and private way. And I think that by doing so, it creates great\nvalue and that opens up a range of opportunities across our products and\nservices. And we're very happy with the collaboration with Google as well,\nI should add.\n\nErik William Richard Woodring\nMorgan Stanley, Research Division\n\nOkay. And then maybe just a follow-up. Now that you have kind of more time\nand data to evaluate this cycle, can you maybe help us understand what the\nprimary factors are driving strength in the iPhone? I'm sure there's a\nnumber of factors, but if you had to point to 1 or 2, just what would they\nbe? And how sustainable do you think those are?\n\nTimothy D. Cook\nCEO & Director\n\nI think it's different for different cohorts of where people are coming\nfrom in the device that they have. But it's a combination of things always\nthat make the product thing. It's the display. It's the camera. It's the\nperformance. It's the new selfie camera. It's the design. The design is\nbeloved. And so it's all of these things that come together at once and\nhave -- are producing a very strong product cycle as witnessed by our\nDecember quarter results.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Erik. Operator, could we get the next question, please?\n\nOperator\n\nWe'll now go to Michael Ng of Goldman Sachs.\n\nMichael Ng\nGoldman Sachs Group, Inc., Research Division\n\nWonderful. I have 2 as well, if I could. First, it was encouraging to hear\nabout the revenue growth outlook of 13% to 16% for the March quarter. I was\njust wondering if you could talk about any comps that we should be\nparticularly aware of as we kind of think about each of the product\ncategories? I know last year, you guys had MacBook Air with M4, the iPhone\n16E, the iPad A16 and the iPad Air with M3. So just wanted to ask if those\nthings would create tough comps? Or is it just less of an issue just given\nthe new product outlook?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Mike, it's Kevan. Thanks for the question. Yes, I wouldn't say there's\nany particular comp issue that we'd note. As you recall, last quarter, we\ntalked about the difficult comparison we had on Mac. But there's nothing\nthat rises to that kind of color that we'd outlined in the outlook. And so\nI think it's just a continuation of the strong cycle. We're seeing subject\nto the constraints that I had mentioned in the prepared remarks, and that\nTim alluded to a little earlier as well.\n\nMichael Ng\nGoldman Sachs Group, Inc., Research Division\n\nGreat. Wonderful. And then just on services, advertising, strong in the\nquarter. I wanted to ask about some of the new growth opportunities in\nadvertising. I know you guys are doing the new ad slots in the App Store.\nMaybe you could just talk a little bit about that? And then any plans to do\nmore in advertising across other products like Maps or TV?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, sure. Michael, what I would say, just if I step back in general, I\nthink as we outlined, we saw really good broad-based performance in our\nacross our services business, so ranging from all-time records in\nadvertising, music, payment services and cloud services. So I think we see\nreally good opportunities across a lot of our service categories. And we\ncontinue to add new service offerings. We talked about what we added to the\nwallet like Digital ID, and you referenced the additional kind of\nadditional ads coming in the search in the App Store, which we are excited\nabout. It provides advertisers more ways to be discovered.\n\nAnd so I think we'll continue to look for ways to expand opportunities to\nadd value to users and also create opportunities for Apple. I think as we\ntalked about, we created -- crossed really significant milestone at 2.5\nbillion active devices. So we really feel excited about the opportunity\nthat provides for our services business as well.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Mike. Operator, could we get the next question, please?\n\nOperator\n\nThe next question will be coming from Ben Reitzes of Melius.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nFirst question is on Google partnership again. I wanted to understand how\nyou came to that decision with regard to the AI and Siri in particular? And\nif there's an opportunity for you guys to share in revenue too with that\npartnership like you do in search?\n\nTimothy D. Cook\nCEO & Director\n\nYes. We basically determined that Google's AI technology would provide the\nmost capable foundation for AFM -- I'm sorry, Apple foundation models. And\nwe believe that we can unlock a lot of experiences and innovate in a key\nway due to the collaboration. We'll continue to run on the device and run\nin private cloud compute and maintain our industry-leading privacy\nstandards in doing so. In terms of the arrangement with Google, we're not\nreleasing the details of that.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nBummer. Okay. I tried. So yes, you knew it would be me. So the next\nquestion is on gross margin. I'm pretty shocked. I got to hand it to you,\nTim, that you're able to do 48% to 49%. What's really going on there? How\nare you doing that with this memory, the NAND prices? Is it due to mix that\nthere's a good -- less hardware and more services and services margins are\ngoing up? How are you doing it to go -- to keep it at 48% to 49%?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Ben, this is Kevan. Let me start maybe by just reflecting on the Q1\ngross margin. I think we talked about the fact that we landed at 48.2%. So\njust above the high end of the range that we provided on the last call. And\nI think if you look at that performance, we were up 100 basis points\nsequentially. We talked about the fact that we had favorable mix. I mean,\nas you know, when we have a good product cycle, a strong price cycle we're\nseeing for iPhone, that does lend itself to a bit more favorable\nopportunity on the mix and leverage side. So we're having a strong iPhone\ncycle, as Tim outlined. And so that also translated itself. We talked about\nproducts sequentially went up by 450 basis points.\n\nSo I think, in general, I think we're just seeing favorable mix dynamics as\nwell. Services continues to contribute as well. That business is growing\ndouble digits. So that also is a contributor. And I think that as we looked\nat our guidance, we're providing a similar range to where we reported in\nDecember. And there's going to be a few puts and takes. We do expect to see\nfavorable mix in the services. As you know, when we move from Q1 to Q2,\nthat tends to be the case, and that's partly offset by a seasonal loss of\nleverage. So there will be puts and takes. But again, we feel pretty good\nabout the guide of 48% to 49%, which is similar to the range we reported in\nDecember.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAll right. Thanks, Ben. Operator, could we get the next question, please?\n\nOperator\n\nThe next question will be coming from David Vogt of UBS.\n\nDavid Vogt\nUBS Investment Bank, Research Division\n\nMaybe Tim or Kevan, if we could pull out a little bit. Can you help us\nunderstand how you're thinking about the overall kind of smartphone market\ndemand, particularly given where memory prices are headed? And we've heard\nsome conversations with some other OEMs as well as component providers that\nare worried about either the availability of components, potential market\nweakness in terms of demand destruction and some of the actions to offset\nour higher prices? I know you don't give outlooks for the full year, but\nhow are you thinking about all of those different vectors and what that\nmight mean for the overall smartphone market? And then ultimately, what\nthat might mean for demand for iPhones as we move through the rest of this\ncalendar year?\n\nTimothy D. Cook\nCEO & Director\n\nYes. On the supply side, I had made comments earlier about the constraint\nthat we are seeing in Q2. We -- and that's reflected in the revenue\nguidance that Kevan gave earlier. The constraint, as I'd mentioned, is due\nto the advanced node capacity. And it's really a result of growing so well\nin Q1 with the 23% and having less flexibility partly due to that in the\nprocess to increase it as much as we would like to increase it. Beyond Q2,\nI don't really want to comment on supply. Its -- supply is a function of a\nlot of things in the industry that move around a lot. So I wouldn't want to\ncomment on that.\n\nAnd I commented before on the -- on memory pricing. And so hopefully, that\nanswers your question. In terms of smartphone demand, we believe that based\non the information that we've got is we gained share in the December\nquarter. Obviously, the market wasn't growing at 23%. So we feel good about\ndoing that. And -- but I don't -- I wouldn't want to predict how the market\nreacts in the future. It's very difficult to do that.\n\nDavid Vogt\nUBS Investment Bank, Research Division\n\nGot it. At the risk of not getting this answered, I'm going to follow up\nwith, can you maybe help us understand, you mentioned there's a range of\noptions that you're looking at. How do -- how should we think about kind of\nlike LTAs in the marketplace? I mean, is that an option as we move through\nthe year? Or is it more spot-based from -- on a perspective, particularly\naround memory? Just want to get a better sense for how we should think\nabout kind of the dynamics in the marketplace.\n\nTimothy D. Cook\nCEO & Director\n\nIt's a range. And so I don't want to get more specific than that. I mean\nthere are different levers that we can push and who knows how successful\nthey'll be, but there's just a range of options.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nGreat. Thank you, David. Operator, could we get the next question, please?\n\nOperator\n\nWe'll now be taking questions from Wamsi Mohan from Bank of America.\n\nWamsi Mohan\nBofA Securities, Research Division\n\nTim, on services, you grew a pretty impressive 14%. And I know you said\nthat the App Store was a record for the December quarter. But third-party\ndata is showing a notable deceleration in App Store growth, maybe 7% in the\nDecember quarter relative to your 14% growth. I was hoping if you could\nmaybe confirm that. And secondarily, if it's correct, what might be some of\nthe drivers of that? And what could be things that you could do to reverse\nthat in future quarters? And I have a follow-up.\n\nKevan Parekh\nSenior VP & CFO\n\nWamsi, it's Kevan here. Look, I think we want to reiterate the fact that\nduring the December quarter, we had a quarterly record on the App Store. As\nyou know, we don't provide specific color on how the individual services\ncategories have done. But again, if we step back, I think we saw, again,\nbroad-based growth across all the different categories, also across various\ngeographies. We had all-time records in both developed and emerging markets\nas well. So -- and double-digit growth in both of those too. And so I think\nin general, we don't provide the color at the detailed services level.\n\nWamsi Mohan\nBofA Securities, Research Division\n\nOkay. I guess back to the memory price. I appreciate you have a range of\noptions to address that. Historically, Apple has not used a pricing lever\nunless FX markets got maybe very dislocated to prevent arbitrage or issues\nlike that. But given some of these unprecedented moves in memory, would\npricing be a lever that you would be willing to pull or push outside of\nevery other thing that -- outside of everything else that you can do?\n\nTimothy D. Cook\nCEO & Director\n\nYes, I wouldn't want to speculate on that one.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThanks, Wamsi. Operator, could we have the next question, please?\n\nOperator\n\nWe'll now go to Samik Chatterjee of JPMorgan.\n\nSamik Chatterjee\nJPMorgan Chase & Co, Research Division\n\nMaybe for the first one, I'm just looking at your capital investment in the\nfirst quarter, which did moderate from the last one. And wondering if the\npartnership with Google on Gemini and sort of help collaboration to develop\nthe next generation of Apple foundation models, does that have any near-\nterm sort of impact on your intent to use Apple Private Cloud? I know you\nemphasized sort of the role Apple Private Cloud plays in the long term. But\nare there any changes on that front through this collaboration? Any\nthoughts around that? And I have a quick follow-up.\n\nKevan Parekh\nSenior VP & CFO\n\nYes, sure. I think -- this is Kevan here. I think in general, as Tim\noutlined, we weren't going to provide any details on our arrangement and\ncollaboration with Google. Just speaking of CapEx, in general, as you know,\nwe have a hybrid model for CapEx. And so I think that what happens is our\nCapEx can be volatile, independent of kind of the volume and the\nperformance of our business. And as you know, our CapEx is made of several\ndifferent line items that include tooling, our facilities, retail\ninvestments -- investments in our retail store, data centers. And on\ntooling and data centers, we leverage this hybrid model that I mentioned\nbefore, which we leverage a combination of first and third-party capacity.\n\nSo in general, it's hard to read into the CapEx and draw any conclusions.\nAnd so I think I would just say there's going to be some ebbs and flows in\nCapEx. Last year, remember, we did build out our private cloud compute\nenvironment. And so we did have CapEx spending related to that in our\nresults in December.\n\nSamik Chatterjee\nJPMorgan Chase & Co, Research Division\n\nGot it. Got it. And my follow-up probably is for you again. You did mention\nproduct gross margin and the sort of drivers there for the product gross\nmargin improvement. When you sort of highlighted mix as a driver, can you\njust sort of talk through what are the big differences in mix you're seeing\nfor iPhone 17 versus 16? And did tariffs and tariffs coming in more\nfavorable play a role at all and what you're expecting for tariffs for the\nnext quarter?\n\nKevan Parekh\nSenior VP & CFO\n\nYes. So there's a few things to unpack there. So on the overall margin on\nproduct side, I think I mentioned that we had favorable mix of products and\nleverage. I think given the strong iPhone cycle we're seeing, that was, I\nwould say, probably a higher favorability than you might have seen in maybe\nother cycles. And as well, as you know, in Q1, typically, we do see the\nimpact of the cost structure of our new products that we launch. And in\nthis case, we are seeing a more favorable offset from mix of products and\nleverage versus historical -- sequential changes from Q4 to Q1. On the\ntariff piece, we had outlined an amount of $1.4 billion for the December\nquarter, and we landed roughly in that range at that level.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Samik. Operator, could we have the next question,\nplease?\n\nOperator\n\nWe'll now go to Krish Sankar of TD Cowen.\n\nKrish Sankar\nTD Cowen, Research Division\n\nThe first one I have was for Tim. I think you touched upon this earlier on\nthe Gemini integration and Apple foundation model. How to think about kind\nof like the difference between Apple foundation model functionality and\nthird-party models? Like does the Apple foundation model evolve to a\ndifferent layer in the AI software stack? Or how to think about it as you\npartner with third-party frontier models? And I had a follow-up.\n\nTimothy D. Cook\nCEO & Director\n\nYes. Krish, you should think of it as a collaboration. And we'll obviously\nindependently continue to do some of our own stuff. But you should think of\nwhat is going to power the personalized version of Siri is the\ncollaboration with Google.\n\nKrish Sankar\nTD Cowen, Research Division\n\nGot it. And then, a quick follow-up for maybe Kevan or Tim. Just a lot of\ndiscussion on memory pricing. Given that the memory constraint or commodity\nscarcity is impacting both the smartphone and the PC markets, and Apple,\narguably having more purchasing power. Do you think this is a chance for\nyou to increase your market share, both in iPhone and Mac at the expense of\ncompetition who might have more constraints in getting access to memory?\n\nTimothy D. Cook\nCEO & Director\n\nYes. I don't want to talk about kind of what has happened. And we do\nbelieve, as I had shared that iPhone gained share in the December quarter.\nAnd if you look at Mac for the full year of full calendar year '25, we also\nbelieve we gained share. And so we feel very good about our position.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Krish. Operator, could we have the next question, please?\n\nOperator\n\nWe'll now go to Atif Malik calling from Citi.\n\nAtif Malik\nCitigroup Inc., Research Division\n\nThe first one for Tim. Tim, some of the industry pundits are comparing the\niPhone 17 upgrade cycle to the 2020, 2021 years as some of the iPhone 12,\n13 users upgrade. Curious if you agree with that view? And also, if you can\nlayer on the impact from Apple Intelligence to the refresh rate?\n\nTimothy D. Cook\nCEO & Director\n\nI think each iPhone cycle has its own unique characteristics. And so I\nwouldn't compare it to a specific one. I think iPhone 17, the family of 17\nis a unique product that brings several very compelling features in one\nproduct, and it has done extremely well. And so we feel quite good about\nit.\n\nKevan Parekh\nSenior VP & CFO\n\nAtif, I'll just add to Tim's comment that we talked about the fact we have\na large and diverse installed base of customers. And so this product has\nreally resonated with multiple cohorts, whether you're on older devices or\nnewer iPhones as well. So we've seen really strong reaction to the product\nlineup.\n\nAtif Malik\nCitigroup Inc., Research Division\n\nGreat. As my follow-up, there was a lot of discussion on supply\nconstraints. And I'm surprised that you guys are constrained on advanced\npackaging as you generally get your share at the big foundry. How long will\nthese supply impact your ability to ship to true demand?\n\nTimothy D. Cook\nCEO & Director\n\nIt's difficult to estimate demand when you haven't met the demand. And so\nwe've -- obviously, we have internal estimates on that, but I don't want to\nshare those. But it's very difficult. And just to be clear, it's the\nadvanced nodes that we -- like 3-nanometer to be specific, where our SoCs\nor the latest SoCs are produced on as to what is gating the Q2 supply. And\nit's a direct result of the 23% growth, and that far outstripping what we\nhad internally estimated and having more limited flexibility in the supply\nchain for some period of time. But I don't want to estimate when supply and\ndemand will balance at this point.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nThank you, Atif. Operator, could we have the next question, please?\n\nOperator\n\nThe next question will be coming from Aaron Rakers coming from Wells Fargo.\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI have 2 as well, and I'll try and stay away from the memory question. I'm\ncurious -- and obviously, a lot of focus on the China demand, but I'm\ncurious, you also called out India. And so can you maybe unpack some of the\nthings that you're seeing in the Indian market as far as iPhone traction?\nAny kind of color on what is a very large installed base in India that\nseems to be a good growth opportunity for Apple still?\n\nTimothy D. Cook\nCEO & Director\n\nYes. Thanks for the question. We did set a quarterly revenue record during\nthe December quarter. And to go a little further down, we set quarterly\nrevenue records on iPhone and Mac and iPad and an all-time revenue record\non services. So it was a terrific quarter in India. We really like what we\nsee there. It's the second largest smartphone market in the world and the\nfourth largest PC market. So -- and we still have, despite a very nice\ngrowth history, we have modest share there. And so we think there's a huge\nopportunity for us there. And we could not be more excited about it.\n\nIf you look at the -- the other thing that I would point out is that the\nmajority of customers that are buying iPhone and Mac and iPad and watch are\nall new to that product. And so it speaks very well to opportunity there.\n\nKevan Parekh\nSenior VP & CFO\n\nYes. And Aaron, I'd add, you mentioned the installed base. We're seeing\nstrong double-digit growth in the installed base in India as well, which is\nreally encouraging.\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. And then as a quick follow-up, kind of tied to memory, maybe not so\nmuch. But part of this current generation iPhone cycle is you clearly\ndeepened some of your own internal silicon capabilities on the device. I'm\ncurious if that -- if we should think about that as a lever and maybe a\nsupportive factor to gross margin that might be underappreciated? Any\nthoughts on where we go from here as far as continued opportunities of\ninternalizing your own silicon?\n\nTimothy D. Cook\nCEO & Director\n\nYes. I'll let Kevan talk about the gross margin. But in terms of the\nproduct, which is at the heart of what we think about in the user. Apple\nSilicon has just been an incredible game changer for us, starting with\niPhone and then on iPad and of course, the Mac as of a few years ago. And\nso we believe it's a game changer and a major competitive advantage.\n\nKevan Parekh\nSenior VP & CFO\n\nYes. And as far as impact on gross margin, we have been, as you know,\ninvesting in core technologies like our own silicon, our own modem. And\ncertainly, while those do provide opportunities for cost savings and can be\nreflected in margins, they also importantly provide the differentiation\nthat's really important for our products as well and give us more control\nof our road map. So I think there's a lot of strategic value to it, but\nalso we are seeing investments in our core technologies impacting gross\nmargin in a positive way.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAwesome. Thank you, Aaron. Operator, could we have our last question,\nplease?\n\nOperator\n\nMost certainly. Our last question will be coming from Richard Kramer\ncalling from Arete Research.\n\nRichard Alan Kramer\nArete Research Services LLP\n\nI have 2 questions. Tim, when you think about how Apple might manage AI, do\nyou see that evolving towards more edge AI or on device services versus\ncloud-based AI? And are you confident you've reserved sufficient data\ncenter capacity to support the widespread Siri adoption, especially given\nthat you're not following the other hyperscalers and sharply increasing\nCapEx?\n\nTimothy D. Cook\nCEO & Director\n\nThe answer is that we see both being important, the on-device and the\nprivate cloud compute. And so we don't see it as an either/or we see it as\nboth. And we believe it's a differentiator because of our privacy approach.\nIn terms of do we have enough capacity, it's hard to estimate with\nprecision what the demand will be. But we've done the -- sort of the best\njob that we can do and either have or are putting capacity in for it.\n\nRichard Alan Kramer\nArete Research Services LLP\n\nOkay. And you also -- you mentioned the $2.5 billion active device number\nbut Apple Intelligence features have only been available since the 15 Pro.\nSo can you speak at all to roughly what portion of your iPhone or overall\nactive device installed base is now AI capable? And has this been a factor\nin maybe a more gradual pace of launching wider AI services?\n\nKevan Parekh\nSenior VP & CFO\n\nYes, Richard, this is Kevan. We don't provide that specific number, but it\nis a growing number, as you can imagine in our installed base. And so we're\nencouraged by the amount of devices now that are capable, but we're not\ngoing to provide a specific figure on that today.\n\nSuhasini Chandramouli\nDirector of Investor Relations\n\nAll right. Thank you, Richard. A replay of today's call will be available\nfor 2 weeks on Apple podcast as a webcast on apple.com/investor and via\ntelephone. The number for the telephone replay is (866) 583-1035. Please\nenter confirmation code 890-2968 followed by the pound sign. These replays\nwill be available by approximately 5:00 p.m. Pacific Time tonight. Members\nof the press with additional questions can contact Josh Rosenstock at (408)\n862-1142. And financial analysts can contact me, Suhasini Chandramouli with\nadditional questions at (408) 974-3123. Thanks again for joining us today.\n\nOperatorOnce again, this does conclude today's conference. We do appreciate\nyour participation.\nCopyright  2026 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2026 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Apple Inc. NasdaqGS:AAPL FQ1 2026 Earnings Call Transcripts Thursday, January 29, 2026 10:00 PM GMT S&P Global Market Intelligence Estimates Presentation",
      "role_category": "Unknown"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Good afternoon, and welcome to the Apple Q1 Fiscal Year 2026 Earnings Conference Call. My name is Suhasini Chandramouli, Director of Investor Relations. Today's call is being recorded. Speaking first today is Apple's CEO, Tim Cook, and he'll be followed by CFO, Kevan Parekh. After that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation and future business outlook. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast including risks related to the potential impact to the company's business and results of operations from macroeconomic conditions, tariffs and other measures and legal and regulatory proceedings. For more information, please refer to the risk factors discussed in Apple's most recently filed reports on Form 10-Q and Form 10-K and the Form 8-K filed with the SEC today, along with the associated press release. Additional information will also be in our report on Form 10-Q for the quarter ended December 27, 2025, to be filed tomorrow and in other reports and filings we make with the SEC. Apple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. I'd now like to turn the call over to Tim for introductory remarks.",
      "role_category": "Executive"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Thank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. I am proud to say that we just had a quarter for the record books. We are reporting our best-ever quarter with $143.8 billion in revenue, up 16% from a year ago and exceeding our expectations. The demand for iPhone was simply staggering with revenue growing 23% year-over-year and all-time records across every geographic segment. Services set an all-time revenue record as well, up 14% from a year ago, and EPS reached an all-time record of $2.84, growing a robust 19% year-over- year. We set all-time revenue records in the Americas, Europe, Japan and rest of Asia Pacific and grew in the vast majority of markets we track. We continue to gain momentum in emerging markets which includes India, where we saw strong double-digit revenue growth. Greater China also grew 38% year- over-year, driven by iPhone, which had record upgraders and double-digit growth on switchers. Apple's December quarter results underscore our relentless commitment to innovation to our customers and to our mission to build the best products and services in the world. Now I'd like to take a closer look at results from across our lineup, beginning with iPhone. As I mentioned earlier, it was a fantastic quarter for iPhone with an all-time revenue record of $85.3 billion, up 23% year- over-year. This is the strongest iPhone lineup we've ever had and by far, the most popular. Throughout the quarter, customer enthusiasm for iPhone was simply extraordinary. Users were incredibly excited about everything enables them to do. iPhone 17 Pro and 17 Pro Max delivered the ultimate iPhone experience. They feature the best ever performance in battery life on an iPhone, the most advanced camera system and a striking design. iPhone Air, our slimmest and lightest smartphone yet, packs powerful capabilities into an ultra slim and sleek design. And iPhone 17 is a truly fantastic upgrade at an incredible value. Turning to Mac. Revenue was $8.4 billion for the December quarter. We were pleased to see the Mac installed base reach another all-time high with nearly half of customers who purchased the Mac being new to the product. The M5 powered 14-inch MacBook Pro takes a huge leap in AI performance, thanks to the next-generation GPU architecture and a faster neural engine. From the world's most popular laptop for consumers and businesses in MacBook Air to the small and spectacular Mac Mini, every Mac in our lineup has something special to offer users. And with the recently released Apple Creator Studio available across Mac, iPad and iPhone, creators have more tools at their fingertips to make incredible music or turn their devices into a video production studio. Meanwhile, iPad saw December quarter revenue of $8.6 billion, up 6% from a year ago with an all-time record for upgraders. We are proud to have our strongest lineup ever from iPad powered by A16, which is proving to be incredibly popular to iPad Air with its amazing versatility to the unbelievably powerful M5 iPad Pro with its remarkably thin and light design. It's no wonder that iPad continued to be the most popular tablet in the world. Across Wearables, Home and Accessories, revenue was $11.5 billion. With Apple Watch Ultra 3 and Apple Watch Series 11, users are tapping into a comprehensive set of health and wellness features to help them meet their health goals. In a recent survey, we see an increasing number of users telling us they're wearing their watch to sleep, which allows them to check their sleep scores each morning and find ways to improve their sleep quality. And Apple Watch alerts are enabling important conversations between users and their doctors regarding potential signs of hypertension. These are just some of the many ways that watch is helping people live healthier lives. The response to AirPods Pro 3 has been amazing. Customers are raving about the rich immersive sound quality, the unmatched level of active noise cancellation and the noticeably improved comfort that makes them effortless to wear. Features like live translation are also changing the way people can communicate by helping users connect across languages in real time and making everyday conversations feel more natural and accessible. Together, these innovations create an experience that feels both powerful and personal and the enthusiasm we are seeing reflects just how strongly AirPods Pro 3 are resonating with customers. Across our product categories, we are seeing very high levels of customer satisfaction, and we are proud to report that we have a new record for our installed base with more than 2.5 billion active devices. During the quarter, we were excited to see that the majority of users on enabled iPhones are actively leveraging the power of Apple Intelligence. Since the launch of Apple Intelligence, we've introduced dozens of features, including writing tools and cleanup and made it available in 15 languages. These AI experiences are personal, private, integrated across our platforms and relevant to what our users do every day. We are bringing intelligence to more of what people already love about our products so we can make every experience even more capable and effortless. One of our most popular features is visual intelligence which helps users learn and do more than ever with the content on their iPhone screen, making it faster to search, take action and answer questions across their apps. And as I touched on earlier, we are hearing powerful stories of people using live translation to communicate seamlessly across languages. And these are just some of the many powerful AI features that are enabling our users to do remarkable things with our products, which are far and away the best platforms in the world for AI. That's a no small part because of the extraordinary power and performance of Apple Silicon. Building on our efforts in the AI space, we are also collaborating with Google to develop the next generation of Apple foundation models. This will help power future Apple Intelligence features, including a more personalized series coming this year. We're incredibly excited for what's to come with so many new experiences to unlock. Turning to services. We achieved an all-time revenue record of $30 billion, 14% higher from a year ago. Services also set all-time revenue records in both developed and emerging markets. Apple TV has seen fantastic momentum with December seeing a 36% increase in viewership over the previous year. It's no wonder with shows like Pluribus which are creating landmark cultural moments that audiences are loving. Anticipation is building for upcoming new productions like Cape Fear from Steven Spielberg and Martin Scorsese. And we are thrilled to announce that Ted Lasso will be returning for a fourth season this summer. Six years since launch, we're excited by the growing enthusiasm viewers have for Apple TV, and we are grateful for the accolades that have followed, most recently at the Critics Choice and Golden Globe Awards. To date, Apple TV productions have earned more than 650 wins and more than 3,200 nominations, including a recently announced Oscar nomination for Best Picture for F1, the movie. And speaking of F1, we're also approaching the start of a new Formula 1 season, and for F1 fans in the U.S., Apple TV will be the place to watch every practice, qualifying, Sprint and Grand Prix. MLS fans will also be able to watch every regular and post-season game with their Apple TV subscription this year, and we're looking forward to kick off in the coming weeks. Looking back, 2025 was a fantastic year for services as we rolled out amazing new features and broke records. Apple Music climbed to all-time highs in both listenership and new subscriber growth. Apple Pay eliminated more than $1 billion in fraud for our partners last year, and we've made it available in more markets than ever before. And last year, we welcomed more than 850 million users every week on average to the App Store, the world's safest and most innovative app marketplace. Developers have now earned more than $550 billion on our platform since 2008. In retail, we continue to bring a magical experience to our customers all around the world, and we were thrilled to have our best ever results in retail during the quarter. We were excited to open our fifth store in India in December and have plans to open another store in Mumbai soon. Wherever we are, we see ourselves as part of a larger whole. That's why we show up with our values in everything we do. That means working with partners in places like Vietnam to bring more clean water to rural areas. It means celebrating graduations of new classes of innovators from our developer academies in places such as Brazil, Indonesia and South Korea. It means 3D printing titanium cases for Apple Watch using recycled materials so that they're better for the planet without compromising quality and so much more. We're especially proud of the work we're doing to support American innovation. Last year, we committed to invest $600 billion over 4 years in vital industries like advanced manufacturing, silicon engineering and artificial intelligence. As we're building on our long-standing investments in America, we're supporting nearly 0.5 million jobs with thousands of suppliers across all 50 states. In the year since we made our initial commitment, we're making great progress. Today, we're shipping servers to power Apple intelligence from our new manufacturing facility in Houston. Through our advanced manufacturing program, we're working with Corning in Kentucky to make 100% of cover glass for iPhone and Apple Watch. We're working with Micron, which broke ground on a new advanced chip packaging and test facility, and we continue to advance the development of an end-to-end silicon supply chain across the country sourcing 20 billion U.S. chips in 2025. Through our Apple Manufacturing Academy in Detroit, we're already training American businesses and innovators on the latest smart manufacturing and artificial intelligence techniques. Six months since opening, the Academy is already making an enormously positive impact for businesses working alongside Apple engineers to drive productivity, efficiency and quality in their supply chains. As I said at the beginning of my remarks, this was in so many ways, a remarkable quarter for Apple. And we're excited for all the opportunities we'll have in the year ahead to deliver innovations that have never been seen before and enrich the lives of users every step of the way. With so much to look forward to in the weeks and months ahead, I have every confidence that our best work is yet to come. With that, I'll turn it over to Kevan.",
      "role_category": "Executive"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Thanks, Tim, and good afternoon, everyone. Our revenue of $143.8 billion was up 16% year-over-year, our best quarter ever. Across the world, we set all-time revenue records in both developed and emerging markets. And we saw double-digit growth year-over-year across the majority of the markets we track, including the U.S., Latin America, Western Europe, Greater China, India and South Asia. Products revenue was $113.7 billion, up 16% year-over-year, driven by double-digit growth in iPhone, setting a new all-time record. And as Tim mentioned, thanks to our strong levels of customer loyalty and satisfaction, our installed base of active devices has now surpassed $2.5 billion, reaching another all-time high across all product categories and geographic segments. Services revenue was $30 billion, up 14% year-over-year. This performance continues to be broad-based with double-digit growth in almost every market we track. We also reached all-time revenue records for advertising, cloud services, music and payment services with December quarter records on the App Store and video. Company gross margin was at 48.2%, above the high end of our guidance range and up 100 basis points sequentially, driven by favorable mix and leverage. Products gross margin was 40.7%, up 450 basis points sequentially driven by favorable mix and leverage. Services gross margin was 76.5%, up 120 basis points sequentially, driven by mix. Operating expenses landed at $18.4 billion, up 19% year-over-year. This was within the range we provided and driven by increased investment in R&D. Net income was $42.1 billion and diluted earnings per share was $2.84, up 19% year-over-year. Both net income and diluted EPS were all-time records and these incredibly strong business results drove an all-time record for operating cash flow coming in at $53.9 billion. Now I'm going to provide some more details for each of our revenue categories. iPhone revenue was $85.3 billion, up 23% year-over-year, driven by the iPhone 17 family. iPhone saw strength around the world reaching all- time revenue records in many of the markets we track, including the U.S., Greater China, Latin America, Western Europe, the Middle East, Australia and South Asia as well as a December quarter record in India. The iPhone active installed base grew to an all-time high and set a new all-time record for upgraders in aggregate and across many countries, including the U.S., China Mainland, Japan and India. According to a recent survey from World Panel, iPhone was a top-selling model in the U.S., Urban China, the U.K., Australia and Japan. Customers are loving the latest iPhone lineup. The latest customer satisfaction for the iPhone 17 family in the U.S. was measured at 99% by 451 Research. Mac revenue was $8.4 billion, down 7% year-over-year. As we described in the last call, we faced a very difficult compare against an M4 MacBook Pro, Mac Mini and iMac launches in the year ago quarter. Despite this difficult compare, we continue to see growth in several emerging markets, including Brazil, India, Malaysia, Vietnam and more. And as Tim mentioned earlier, the Mac installed base reached another all- time high with nearly half of the customers who purchased the Mac being new to the product. And in the U.S., customer satisfaction for Mac was measured at 97%. iPad revenue was $8.6 billion, up 6% year-over-year, driven by the M5 powered iPad Pro and the A16 powered iPad. We continue to add new users to the iPad. In fact, over half the customers who purchased the iPad during the quarter were new to the product. This helped the iPad installed base to reach an all-time high and we also reached an all-time high for upgraders. Based on the latest reports from 451 Research, customer satisfaction was 98% in the U.S. Wearables, Home and Accessories revenue was $11.5 billion, down 2% year- over-year. During the quarter, we experienced constraints on the AirPods Pro 3, and we believe the overall category would have grown had it not been for these constraints. The Wearables installed base reached a new all-time high, with over half of the customers purchasing an Apple Watch during the quarter being new to the product. And in the U.S., customer satisfaction was recently reported at 96%. Our services revenue reached an all-time high of $30 billion, up 14% year- over-year. As we said earlier, we had all-time revenue records on advertising, music, payment services and cloud services where we saw a double-digit growth on paid subscribers. We continue to be optimistic about the future of our services business. With our installed base of over 2.5 billion active devices, we have an incredibly strong foundation for new growth opportunities. We saw increased customer engagement across our service offerings with both transacting and paid accounts reaching all-time highs in the quarter. And we continue to improve quality and expand the breadth of our services offerings. From new wallet features like Digital ID, which provides a way for users to create an ID in wallet using information from their U.S. Passport to additional ads coming to search in the App Store, which provides advertisers more ways to drive downloads from search. Turning now to enterprise. Organizations are continuing to expand their fleet of Apple devices to drive productivity while remaining secure. Snowflake has deployed over 9,000 Mac devices company-wide, establishing Mac as a primary laptop across all business units, resulting in increased performance and a reduction in support tickets. AstraZeneca is rolling out over 5,000 M5 powered iPad Pros to its pharmaceutical sales team to take advantage of AI capabilities, including Apple Intelligence, while meeting with clinicians daily. And in Mexico, Coppel, the country's largest domestic retailer recently added MacBook Air in addition to a growing fleet of over 10,000 iPad devices. Let's turn to our cash position and capital return program. We ended the quarter with $145 billion in cash and marketable securities. We had $2.2 billion of debt maturities and decreased commercial paper by $6 billion, resulting in $91 billion in total debt. Therefore, at the end of the quarter, net cash was $54 billion. During the quarter, we returned nearly $32 billion to shareholders. This included $3.9 billion in dividends and equivalents and $25 billion through open market repurchases of 93 million Apple shares. As we move ahead into the March quarter, I'd like to review our outlook which includes the types of forward-looking information that Suhasini referred to. Importantly, the color we're providing assumes that global tariff rates, policies and their application remain in effect as of this call, and the global macroeconomic outlook does not worsen from today. We expect our March quarter total company revenue to grow by 13% to 16% year-over-year, which comprehends our best estimates of constrained iPhone supply during the quarter. We expect services revenue to grow at a year-over-year rate similar to what we reported in the December quarter. We expect gross margin to be between 48% and 49%. We expect operating expenses to be between $18.4 billion and $18.7 billion, which is at a similar level to what we reported in the December quarter and driven by higher R&D on a year-over-year basis. We expect OI&E to be around $100 million, excluding any potential impact from the mark-to-market of minority investments and our tax rate to be around 17.5%. Finally, today, our Board of Directors has declared a cash dividend of $0.26 per share of common stock payable on February 12, 2026, to shareholders of record as of February 9, 2026. With that, let's open the call to questions. Question and Answer",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations [Operator Instructions] Operator, may we have the first question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Certainly. We'll go ahead and take our first question from Amit Daryanani of Evercore.",
      "role_category": "Operator"
    },
    {
      "speaker": "Amit Jawaharlaz Daryanani",
      "role": "Evercore ISI Institutional Equities, Research Division",
      "text": "Evercore ISI Institutional Equities, Research Division Yes, I have 2. Maybe to start with -- there's a lot of focus on the impact of memory to a host of companies, and I'd love to kind of get your perspective when you folks are guiding gross margins up into the March quarter. Just talk about, a, your comfort in securing the bits that you need for shipments? And b, how do we think about memory inflation flowing through Apple's model over time?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes, Amit, it's Tim. Let me back up a bit and talk about the constraints that Kevan referred to in his remarks and memory and try to get both of these out at once. First of all, we were thrilled with the customer response on the latest iPhone lineup. It exceeded our expectations to say the least. And iPhone grew 23%. What the result of that was, was that we exited the December quarter with very lean channel inventory due to that staggering level of demand. And based on that, we're in a supply chase mode to meet the very high levels of customer demand. We are currently constrained. And at this point, it's difficult to predict when supply and demand will balance. The constraints that we have are driven by the availability of the advanced nodes that our SoCs are produced on. And at this time, we're seeing less flexibility in supply chain than normal, partly because of our increased demand that I just spoke about. From a memory point of view, to answer your question, memory had a minimal impact on the Q1, so the December quarter gross margin. We do expect it to be a bit more of an impact to the Q2 gross margin and that was comprehended in the outlook of 48% to 49% that Kevan gave earlier. Beyond Q2, we don't obviously provide outlooks beyond the current quarter. But we do continue to see market pricing for memory increasing significantly. As always, we'll look at a range of options to deal with that. So hopefully, that gives you the full view.",
      "role_category": "Executive"
    },
    {
      "speaker": "Amit Jawaharlaz Daryanani",
      "role": "Evercore ISI Institutional Equities, Research Division",
      "text": "Evercore ISI Institutional Equities, Research Division I appreciate all the clarity on that, Tim. Maybe the other -- second question I have for you is maybe just touch on the China strength you folks had. I think this is very close to all-time high revenues we've had in China. What's driving the strength over here? And just sort of the durability of the growth rate we saw in the December quarter would be helpful to understand.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Sure. Greater China was up 38% year-on-year. It was driven by iPhone where we set an all-time revenue record. So it was the best iPhone quarter in history in Greater China. It's driven by the customer enthusiasm for the iPhone 17 lineup. And I would tell you that during the quarter, traffic in our stores in China grew by strong double digits year-over-year. it was a terrific quarter. Our installed base reached an all-time high in both Greater China and Mainland China. And we set an all-time record for the upgraders and we saw strong double-digit growth on switchers. And according to a survey from World Panel, iPhones were the top 3 smartphones in urban China during the quarter. So it was -- and it's really driven primarily by the product strength and the customer response to the product strength. We do see on non-iPhone products that the majority of customers that are buying a Mac, an iPad, a watch are still new to that product. So that's a very good sign for us. And if you look at iPad on that same survey iPad was the top tablet model in urban China. And according to counterpoint the MacBook Air was the top-selling laptop model, and Mac Mini was the top selling desktop model in the December quarter. So Overall, a great quarter in China. We could not be more happy with it.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Awesome. Thank you, Amit. Operator, could we get the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question is from Erik Woodring of Morgan Stanley.",
      "role_category": "Operator"
    },
    {
      "speaker": "Erik William Richard Woodring",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Tim, congrats on announcing the partnership with Google, and we're all excited to see what you bring to market later this year. When I think about your AI initiatives, it's clear there are added costs associated with that. We're obviously seeing that flow through in OpEx. Can you help us understand maybe what the revenue upside potential that exists with AI? Many of your competitors have already integrated AI into their devices. And it's just not clear yet what incremental monetization they're seeing because of AI, but you're always disciplined with investing. You obviously have a differentiated product. So how do you monetize AI? And what's the time line to realizing that ROI? Then a quick follow-up.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Well, let me just say that we're bringing intelligence to more of what people love, and we're integrating it across the operating system in personal and private way. And I think that by doing so, it creates great value and that opens up a range of opportunities across our products and services. And we're very happy with the collaboration with Google as well, I should add.",
      "role_category": "Executive"
    },
    {
      "speaker": "Erik William Richard Woodring",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Okay. And then maybe just a follow-up. Now that you have kind of more time and data to evaluate this cycle, can you maybe help us understand what the primary factors are driving strength in the iPhone? I'm sure there's a number of factors, but if you had to point to 1 or 2, just what would they be? And how sustainable do you think those are?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director I think it's different for different cohorts of where people are coming from in the device that they have. But it's a combination of things always that make the product thing. It's the display. It's the camera. It's the performance. It's the new selfie camera. It's the design. The design is beloved. And so it's all of these things that come together at once and have -- are producing a very strong product cycle as witnessed by our December quarter results.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Awesome. Thank you, Erik. Operator, could we get the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "We'll now go to Michael Ng of Goldman Sachs.",
      "role_category": "Operator"
    },
    {
      "speaker": "Michael  Ng",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division Wonderful. I have 2 as well, if I could. First, it was encouraging to hear about the revenue growth outlook of 13% to 16% for the March quarter. I was just wondering if you could talk about any comps that we should be particularly aware of as we kind of think about each of the product categories? I know last year, you guys had MacBook Air with M4, the iPhone 16E, the iPad A16 and the iPad Air with M3. So just wanted to ask if those things would create tough comps? Or is it just less of an issue just given the new product outlook?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes, Mike, it's Kevan. Thanks for the question. Yes, I wouldn't say there's any particular comp issue that we'd note. As you recall, last quarter, we talked about the difficult comparison we had on Mac. But there's nothing that rises to that kind of color that we'd outlined in the outlook. And so I think it's just a continuation of the strong cycle. We're seeing subject to the constraints that I had mentioned in the prepared remarks, and that Tim alluded to a little earlier as well.",
      "role_category": "Executive"
    },
    {
      "speaker": "Michael  Ng",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division Great. Wonderful. And then just on services, advertising, strong in the quarter. I wanted to ask about some of the new growth opportunities in advertising. I know you guys are doing the new ad slots in the App Store. Maybe you could just talk a little bit about that? And then any plans to do more in advertising across other products like Maps or TV?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes, sure. Michael, what I would say, just if I step back in general, I think as we outlined, we saw really good broad-based performance in our across our services business, so ranging from all-time records in advertising, music, payment services and cloud services. So I think we see really good opportunities across a lot of our service categories. And we continue to add new service offerings. We talked about what we added to the wallet like Digital ID, and you referenced the additional kind of additional ads coming in the search in the App Store, which we are excited about. It provides advertisers more ways to be discovered. And so I think we'll continue to look for ways to expand opportunities to add value to users and also create opportunities for Apple. I think as we talked about, we created -- crossed really significant milestone at 2.5 billion active devices. So we really feel excited about the opportunity that provides for our services business as well.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Thank you, Mike. Operator, could we get the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question will be coming from Ben Reitzes of Melius.",
      "role_category": "Operator"
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC First question is on Google partnership again. I wanted to understand how you came to that decision with regard to the AI and Siri in particular? And if there's an opportunity for you guys to share in revenue too with that partnership like you do in search?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. We basically determined that Google's AI technology would provide the most capable foundation for AFM -- I'm sorry, Apple foundation models. And we believe that we can unlock a lot of experiences and innovate in a key way due to the collaboration. We'll continue to run on the device and run in private cloud compute and maintain our industry-leading privacy standards in doing so. In terms of the arrangement with Google, we're not releasing the details of that.",
      "role_category": "Executive"
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC Bummer. Okay. I tried. So yes, you knew it would be me. So the next question is on gross margin. I'm pretty shocked. I got to hand it to you, Tim, that you're able to do 48% to 49%. What's really going on there? How are you doing that with this memory, the NAND prices? Is it due to mix that there's a good -- less hardware and more services and services margins are going up? How are you doing it to go -- to keep it at 48% to 49%?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes, Ben, this is Kevan. Let me start maybe by just reflecting on the Q1 gross margin. I think we talked about the fact that we landed at 48.2%. So just above the high end of the range that we provided on the last call. And I think if you look at that performance, we were up 100 basis points sequentially. We talked about the fact that we had favorable mix. I mean, as you know, when we have a good product cycle, a strong price cycle we're seeing for iPhone, that does lend itself to a bit more favorable opportunity on the mix and leverage side. So we're having a strong iPhone cycle, as Tim outlined. And so that also translated itself. We talked about products sequentially went up by 450 basis points. So I think, in general, I think we're just seeing favorable mix dynamics as well. Services continues to contribute as well. That business is growing double digits. So that also is a contributor. And I think that as we looked at our guidance, we're providing a similar range to where we reported in December. And there's going to be a few puts and takes. We do expect to see favorable mix in the services. As you know, when we move from Q1 to Q2, that tends to be the case, and that's partly offset by a seasonal loss of leverage. So there will be puts and takes. But again, we feel pretty good about the guide of 48% to 49%, which is similar to the range we reported in December.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations All right. Thanks, Ben. Operator, could we get the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question will be coming from David Vogt of UBS.",
      "role_category": "Operator"
    },
    {
      "speaker": "David  Vogt",
      "role": "UBS Investment Bank, Research Division",
      "text": "UBS Investment Bank, Research Division Maybe Tim or Kevan, if we could pull out a little bit. Can you help us understand how you're thinking about the overall kind of smartphone market demand, particularly given where memory prices are headed? And we've heard some conversations with some other OEMs as well as component providers that are worried about either the availability of components, potential market weakness in terms of demand destruction and some of the actions to offset our higher prices? I know you don't give outlooks for the full year, but how are you thinking about all of those different vectors and what that might mean for the overall smartphone market? And then ultimately, what that might mean for demand for iPhones as we move through the rest of this calendar year?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. On the supply side, I had made comments earlier about the constraint that we are seeing in Q2. We -- and that's reflected in the revenue guidance that Kevan gave earlier. The constraint, as I'd mentioned, is due to the advanced node capacity. And it's really a result of growing so well in Q1 with the 23% and having less flexibility partly due to that in the process to increase it as much as we would like to increase it. Beyond Q2, I don't really want to comment on supply. Its -- supply is a function of a lot of things in the industry that move around a lot. So I wouldn't want to comment on that. And I commented before on the -- on memory pricing. And so hopefully, that answers your question. In terms of smartphone demand, we believe that based on the information that we've got is we gained share in the December quarter. Obviously, the market wasn't growing at 23%. So we feel good about doing that. And -- but I don't -- I wouldn't want to predict how the market reacts in the future. It's very difficult to do that.",
      "role_category": "Executive"
    },
    {
      "speaker": "David  Vogt",
      "role": "UBS Investment Bank, Research Division",
      "text": "UBS Investment Bank, Research Division Got it. At the risk of not getting this answered, I'm going to follow up with, can you maybe help us understand, you mentioned there's a range of options that you're looking at. How do -- how should we think about kind of like LTAs in the marketplace? I mean, is that an option as we move through the year? Or is it more spot-based from -- on a perspective, particularly around memory? Just want to get a better sense for how we should think about kind of the dynamics in the marketplace.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director It's a range. And so I don't want to get more specific than that. I mean there are different levers that we can push and who knows how successful they'll be, but there's just a range of options.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Great. Thank you, David. Operator, could we get the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "We'll now be taking questions from Wamsi Mohan from Bank of America.",
      "role_category": "Operator"
    },
    {
      "speaker": "Wamsi  Mohan",
      "role": "BofA Securities, Research Division",
      "text": "BofA Securities, Research Division Tim, on services, you grew a pretty impressive 14%. And I know you said that the App Store was a record for the December quarter. But third-party data is showing a notable deceleration in App Store growth, maybe 7% in the December quarter relative to your 14% growth. I was hoping if you could maybe confirm that. And secondarily, if it's correct, what might be some of the drivers of that? And what could be things that you could do to reverse that in future quarters? And I have a follow-up.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Wamsi, it's Kevan here. Look, I think we want to reiterate the fact that during the December quarter, we had a quarterly record on the App Store. As you know, we don't provide specific color on how the individual services categories have done. But again, if we step back, I think we saw, again, broad-based growth across all the different categories, also across various geographies. We had all-time records in both developed and emerging markets as well. So -- and double-digit growth in both of those too. And so I think in general, we don't provide the color at the detailed services level.",
      "role_category": "Executive"
    },
    {
      "speaker": "Wamsi  Mohan",
      "role": "BofA Securities, Research Division",
      "text": "BofA Securities, Research Division Okay. I guess back to the memory price. I appreciate you have a range of options to address that. Historically, Apple has not used a pricing lever unless FX markets got maybe very dislocated to prevent arbitrage or issues like that. But given some of these unprecedented moves in memory, would pricing be a lever that you would be willing to pull or push outside of every other thing that -- outside of everything else that you can do?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes, I wouldn't want to speculate on that one.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Thanks, Wamsi. Operator, could we have the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "We'll now go to Samik Chatterjee of JPMorgan.",
      "role_category": "Operator"
    },
    {
      "speaker": "Samik  Chatterjee",
      "role": "JPMorgan Chase & Co, Research Division",
      "text": "JPMorgan Chase & Co, Research Division Maybe for the first one, I'm just looking at your capital investment in the first quarter, which did moderate from the last one. And wondering if the partnership with Google on Gemini and sort of help collaboration to develop the next generation of Apple foundation models, does that have any near- term sort of impact on your intent to use Apple Private Cloud? I know you emphasized sort of the role Apple Private Cloud plays in the long term. But are there any changes on that front through this collaboration? Any thoughts around that? And I have a quick follow-up.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes, sure. I think -- this is Kevan here. I think in general, as Tim outlined, we weren't going to provide any details on our arrangement and collaboration with Google. Just speaking of CapEx, in general, as you know, we have a hybrid model for CapEx. And so I think that what happens is our CapEx can be volatile, independent of kind of the volume and the performance of our business. And as you know, our CapEx is made of several different line items that include tooling, our facilities, retail investments -- investments in our retail store, data centers. And on tooling and data centers, we leverage this hybrid model that I mentioned before, which we leverage a combination of first and third-party capacity. So in general, it's hard to read into the CapEx and draw any conclusions. And so I think I would just say there's going to be some ebbs and flows in CapEx. Last year, remember, we did build out our private cloud compute environment. And so we did have CapEx spending related to that in our results in December.",
      "role_category": "Executive"
    },
    {
      "speaker": "Samik  Chatterjee",
      "role": "JPMorgan Chase & Co, Research Division",
      "text": "JPMorgan Chase & Co, Research Division Got it. Got it. And my follow-up probably is for you again. You did mention product gross margin and the sort of drivers there for the product gross margin improvement. When you sort of highlighted mix as a driver, can you just sort of talk through what are the big differences in mix you're seeing for iPhone 17 versus 16? And did tariffs and tariffs coming in more favorable play a role at all and what you're expecting for tariffs for the next quarter?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes. So there's a few things to unpack there. So on the overall margin on product side, I think I mentioned that we had favorable mix of products and leverage. I think given the strong iPhone cycle we're seeing, that was, I would say, probably a higher favorability than you might have seen in maybe other cycles. And as well, as you know, in Q1, typically, we do see the impact of the cost structure of our new products that we launch. And in this case, we are seeing a more favorable offset from mix of products and leverage versus historical -- sequential changes from Q4 to Q1. On the tariff piece, we had outlined an amount of $1.4 billion for the December quarter, and we landed roughly in that range at that level.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Awesome. Thank you, Samik. Operator, could we have the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "We'll now go to Krish Sankar of TD Cowen.",
      "role_category": "Operator"
    },
    {
      "speaker": "Krish  Sankar",
      "role": "TD Cowen, Research Division",
      "text": "TD Cowen, Research Division The first one I have was for Tim. I think you touched upon this earlier on the Gemini integration and Apple foundation model. How to think about kind of like the difference between Apple foundation model functionality and third-party models? Like does the Apple foundation model evolve to a different layer in the AI software stack? Or how to think about it as you partner with third-party frontier models? And I had a follow-up.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. Krish, you should think of it as a collaboration. And we'll obviously independently continue to do some of our own stuff. But you should think of what is going to power the personalized version of Siri is the collaboration with Google.",
      "role_category": "Executive"
    },
    {
      "speaker": "Krish  Sankar",
      "role": "TD Cowen, Research Division",
      "text": "TD Cowen, Research Division Got it. And then, a quick follow-up for maybe Kevan or Tim. Just a lot of discussion on memory pricing. Given that the memory constraint or commodity scarcity is impacting both the smartphone and the PC markets, and Apple, arguably having more purchasing power. Do you think this is a chance for you to increase your market share, both in iPhone and Mac at the expense of competition who might have more constraints in getting access to memory?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. I don't want to talk about kind of what has happened. And we do believe, as I had shared that iPhone gained share in the December quarter. And if you look at Mac for the full year of full calendar year '25, we also believe we gained share. And so we feel very good about our position.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Thank you, Krish. Operator, could we have the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "We'll now go to Atif Malik calling from Citi.",
      "role_category": "Operator"
    },
    {
      "speaker": "Atif  Malik",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division The first one for Tim. Tim, some of the industry pundits are comparing the iPhone 17 upgrade cycle to the 2020, 2021 years as some of the iPhone 12, 13 users upgrade. Curious if you agree with that view? And also, if you can layer on the impact from Apple Intelligence to the refresh rate?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director I think each iPhone cycle has its own unique characteristics. And so I wouldn't compare it to a specific one. I think iPhone 17, the family of 17 is a unique product that brings several very compelling features in one product, and it has done extremely well. And so we feel quite good about it.",
      "role_category": "Executive"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Atif, I'll just add to Tim's comment that we talked about the fact we have a large and diverse installed base of customers. And so this product has really resonated with multiple cohorts, whether you're on older devices or newer iPhones as well. So we've seen really strong reaction to the product lineup.",
      "role_category": "Executive"
    },
    {
      "speaker": "Atif  Malik",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division Great. As my follow-up, there was a lot of discussion on supply constraints. And I'm surprised that you guys are constrained on advanced packaging as you generally get your share at the big foundry. How long will these supply impact your ability to ship to true demand?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director It's difficult to estimate demand when you haven't met the demand. And so we've -- obviously, we have internal estimates on that, but I don't want to share those. But it's very difficult. And just to be clear, it's the advanced nodes that we -- like 3-nanometer to be specific, where our SoCs or the latest SoCs are produced on as to what is gating the Q2 supply. And it's a direct result of the 23% growth, and that far outstripping what we had internally estimated and having more limited flexibility in the supply chain for some period of time. But I don't want to estimate when supply and demand will balance at this point.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Thank you, Atif. Operator, could we have the next question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question will be coming from Aaron Rakers coming from Wells Fargo.",
      "role_category": "Operator"
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division I have 2 as well, and I'll try and stay away from the memory question. I'm curious -- and obviously, a lot of focus on the China demand, but I'm curious, you also called out India. And so can you maybe unpack some of the things that you're seeing in the Indian market as far as iPhone traction? Any kind of color on what is a very large installed base in India that seems to be a good growth opportunity for Apple still?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. Thanks for the question. We did set a quarterly revenue record during the December quarter. And to go a little further down, we set quarterly revenue records on iPhone and Mac and iPad and an all-time revenue record on services. So it was a terrific quarter in India. We really like what we see there. It's the second largest smartphone market in the world and the fourth largest PC market. So -- and we still have, despite a very nice growth history, we have modest share there. And so we think there's a huge opportunity for us there. And we could not be more excited about it. If you look at the -- the other thing that I would point out is that the majority of customers that are buying iPhone and Mac and iPad and watch are all new to that product. And so it speaks very well to opportunity there.",
      "role_category": "Executive"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes. And Aaron, I'd add, you mentioned the installed base. We're seeing strong double-digit growth in the installed base in India as well, which is really encouraging.",
      "role_category": "Executive"
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division Yes. And then as a quick follow-up, kind of tied to memory, maybe not so much. But part of this current generation iPhone cycle is you clearly deepened some of your own internal silicon capabilities on the device. I'm curious if that -- if we should think about that as a lever and maybe a supportive factor to gross margin that might be underappreciated? Any thoughts on where we go from here as far as continued opportunities of internalizing your own silicon?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director Yes. I'll let Kevan talk about the gross margin. But in terms of the product, which is at the heart of what we think about in the user. Apple Silicon has just been an incredible game changer for us, starting with iPhone and then on iPad and of course, the Mac as of a few years ago. And so we believe it's a game changer and a major competitive advantage.",
      "role_category": "Executive"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes. And as far as impact on gross margin, we have been, as you know, investing in core technologies like our own silicon, our own modem. And certainly, while those do provide opportunities for cost savings and can be reflected in margins, they also importantly provide the differentiation that's really important for our products as well and give us more control of our road map. So I think there's a lot of strategic value to it, but also we are seeing investments in our core technologies impacting gross margin in a positive way.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations Awesome. Thank you, Aaron. Operator, could we have our last question, please?",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Most certainly. Our last question will be coming from Richard Kramer calling from Arete Research.",
      "role_category": "Operator"
    },
    {
      "speaker": "Richard Alan Kramer",
      "role": "Arete Research Services LLP",
      "text": "Arete Research Services LLP I have 2 questions. Tim, when you think about how Apple might manage AI, do you see that evolving towards more edge AI or on device services versus cloud-based AI? And are you confident you've reserved sufficient data center capacity to support the widespread Siri adoption, especially given that you're not following the other hyperscalers and sharply increasing CapEx?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Timothy D. Cook",
      "role": "CEO & Director",
      "text": "CEO & Director The answer is that we see both being important, the on-device and the private cloud compute. And so we don't see it as an either/or we see it as both. And we believe it's a differentiator because of our privacy approach. In terms of do we have enough capacity, it's hard to estimate with precision what the demand will be. But we've done the -- sort of the best job that we can do and either have or are putting capacity in for it.",
      "role_category": "Executive"
    },
    {
      "speaker": "Richard Alan Kramer",
      "role": "Arete Research Services LLP",
      "text": "Arete Research Services LLP Okay. And you also -- you mentioned the $2.5 billion active device number but Apple Intelligence features have only been available since the 15 Pro. So can you speak at all to roughly what portion of your iPhone or overall active device installed base is now AI capable? And has this been a factor in maybe a more gradual pace of launching wider AI services?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Kevan  Parekh",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes, Richard, this is Kevan. We don't provide that specific number, but it is a growing number, as you can imagine in our installed base. And so we're encouraged by the amount of devices now that are capable, but we're not going to provide a specific figure on that today.",
      "role_category": "Executive"
    },
    {
      "speaker": "Suhasini  Chandramouli",
      "role": "Director of Investor Relations",
      "text": "Director of Investor Relations All right. Thank you, Richard. A replay of today's call will be available for 2 weeks on Apple podcast as a webcast on apple.com/investor and via telephone. The number for the telephone replay is (866) 583-1035. Please enter confirmation code 890-2968 followed by the pound sign. These replays will be available by approximately 5:00 p.m. Pacific Time tonight. Members of the press with additional questions can contact Josh Rosenstock at (408) 862-1142. And financial analysts can contact me, Suhasini Chandramouli with additional questions at (408) 974-3123. Thanks again for joining us today. OperatorOnce again, this does conclude today's conference. We do appreciate your participation. Copyright  2026 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.  2026 S&P Global Market Intelligence.",
      "role_category": "Executive"
    }
  ],
  "source_file": "Apple Inc., Q1 2026 Earnings Call, Jan 29, 2026.rtf"
}