{
  "event_id": "MSFT_2025-04-30",
  "ticker": "MSFT",
  "company": "Microsoft Corporation",
  "quarter": 3,
  "fiscal_year": 2025,
  "call_date": "2025-04-30",
  "call_start_ts": "2025-04-30 21:30:00+00:00",
  "raw_text": "Microsoft Corporation NasdaqGS:MSFT\nFQ3 2025 Earnings Call Transcripts\nWednesday, April 30, 2025 9:30 PM GMT\nS&P Global Market Intelligence Estimates\n\nPresentation\n\nOperator\n\nGreetings, and welcome to the Microsoft Fiscal Year 2025 Third Quarter\nEarnings Conference Call. [Operator Instructions] As a reminder, this\nconference is being recorded.\n\nIt is now my pleasure to introduce Jonathan Neilson, Vice President of\nInvestor Relations. Please go ahead.\n\nJonathan Neilson\n\nGood afternoon, and thank you for joining us today. On the call with me are\nSatya Nadella, Chairman and Chief Executive Officer; Amy Hood, Chief\nFinancial Officer; Alice Jolla, Chief Accounting Officer; and Keith\nDolliver, Corporate Secretary and Deputy General Counsel.\n\nOn the Microsoft Investor Relations website, you can find our earnings\npress release and financial summary slide deck, which is intended to\nsupplement our prepared remarks during today's call and provides a\nreconciliation of differences between GAAP and non-GAAP financial measures.\nMore detailed outlook slides will be available on the Microsoft Investor\nRelations website when we provide outlook commentary on today's call.\n\nOn this call, we will discuss certain non-GAAP items, the non-GAAP\nfinancial measures provided should not be considered as a substitute for or\nsuperior to the measures of financial performance prepared in accordance\nwith GAAP. They are included as additional clarifying items to aid\ninvestors in further understanding the company's third quarter performance\nin addition to the impact these items and events have on the financial\nresults.\n\nAll growth comparisons we make on the call today relate to the\ncorresponding period of last year, unless otherwise noted. We will also\nprovide growth rates in constant currency when available as a framework for\nassessing how our underlying business performed, excluding the effect of\nforeign currency rate fluctuations. Where growth rates are the same in\nconstant currency, we will refer to the growth rate only.\n\nWe will post our prepared remarks to our website immediately following the\ncall until the complete transcript is available.\n\nToday's call is being webcast live and recorded. If you ask a question, it\nwill be included in our live transmission, in the transcript and in any\nfuture use of the recording. You can replay the call and view the\ntranscript on the Microsoft Investor Relations website.\n\nDuring this call, we will be making forward-looking statements, which are\npredictions, projections or other statements about future events. These\nstatements are based on current expectations and assumptions that are\nsubject to risks and uncertainties. Actual results could materially differ\nbecause of factors discussed in today's earnings press release, in the\ncomments made during this conference call and in the Risk Factors section\nof our Form 10-K, Form 10-Q and other reports and filings with the\nSecurities and Exchange Commission. We do not undertake any duty to update\nany forward-looking statement.\n\nAnd with that, I'll turn the call over to Satya.\n\nSatya Nadella\nChairman & CEO\n\nThank you, Jonathan. It was a record quarter, driven by continued strength\nof Microsoft Cloud, which surpassed $42 billion in revenue, up 22% in\nconstant currency. Cloud and AI are the essential inputs for every business\nto expand output, reduce costs and accelerate growth.\n\nNow I'll highlight examples starting with infrastructure. We continue to\nexpand our data center capacity. This quarter alone, we opened DCs in 10\ncountries across 4 continents. Model capabilities are doubling in\nperformance every 6 months, thanks to multiple compounding scaling laws. We\ncontinue to optimize and drive efficiencies across every layer, from DC\ndesign to hardware and silicon to system software to model optimization,\nall towards lowering costs and increasing performance. You see this in our\nsupply chain where we have reduced dock to lead times for new GPUs by\nnearly 20% across our blended fleet where we have increased AI performance\nby nearly 30% ISO power and our cost per token, which has more than halved.\n\nWhen it comes to cloud migrations, we saw accelerating demand with\ncustomers in every industry, from Abercrombie in French, to Coca-Cola and\nServiceNow expanding their footprints on Azure. And we remain the cloud of\nchoice for customers' mission-critical VMware, SAP and Oracle workloads\nwith more regional availability than any other hyperscaler.\n\nWe're also excited about the next frontier in cloud systems with Quantum.\nIn addition to putting our quantum stack on machines from our partners,\nwe're also making real progress on a path to a utility-scale quantum\ncomputer with the introduction of Majorana 1.\n\nWhen it comes to data and analytics, we have deeply integrated our AI\nplatform with our data stack. PostgreSQL usage accelerated for the third\nconsecutive quarter, and it is now used by nearly 60% of the Fortune 500,\nincluding companies like BMW and BNY Mellon. Cosmos DB revenue growth also\naccelerated again this quarter and remains the go-to database for globally\ndistributed NoSQL workloads at any scale. It is used by customers in every\nindustry like CarMax, DocuSign, NTT DATA and OpenAI.\n\nThis quarter, we also saw analytics consumption accelerate. Microsoft\nFabric has more than 21,000 paid customers, up 80% year-over-year. Fabric\nbrings together data workloads like data warehousing, data science, real-\ntime intelligence, along with Power BI into one end-to-end solution. Real-\ntime intelligence is now the fastest-growing workload in Fabric with 40% of\ncustomers already using it in just 5 months since becoming generally\navailable, all up more than 50% of Fabric customers like Amorepacific,\nLouisiana State Government and Petrobras use 3 or more workloads. And the\namount of data in our multi-cloud data lake, OneLake, has grown more than\n6x over the past year.\n\nNow on to AI platform and tools. Foundry is the agent in AI app factory.\nIt's now used by developers at over 70,000 enterprises and digital natives\nfrom Atomicwork to Epic, Fujitsu and Gainsight to H&R Block and LG\nElectronics to design, customize and manage their AI apps and agents. We\nprocessed over 100 trillion tokens this quarter, up 5x year-over-year,\nincluding a record 50 trillion tokens last month alone. And 4 months in,\nover 10,000 organizations have used our new agent service to build, deploy\nand scale their agents.\n\nThis quarter, we also made a new suite of fine-tuning tools available to\ncustomers with industry-leading reliability, and we brought the latest\nmodels from OpenAI along with new models from Cohere, DeepSeek, Meta,\nMistral, Stability to Foundry. And we've expanded our 5 family of SLMs with\nnew multimodal and mini models. All-up, Phi has been downloaded 38 million\ntimes. And our research teams are taking it one step further with BitNet\nb1.58, a billion parameter, large language model that can run on just CPUs\ncoming to the Foundry.\n\nNow on to developer tools. We're evolving GitHub Copilot from paired to\npeer programmer with agent mode in VS Code, Copilot can now iterate on\ncode, recognize errors and fix them automatically. This adds to other\nCopilot agents like Autofix, which helps developers remediate\nvulnerabilities as well as code review agent, which has already reviewed\nover 8 million pull requests. And we are previewing a first-of-its-kind SWE-\nagent capable of asynchronously executing developer tasks. All-up, we now\nhave over 15 million GitHub Copilot users, up over 4x year-over-year. And\nboth digital natives like Twilio and enterprises like Cisco, HPE,\nSkyscanner and Target continue to choose GitHub Copilot to their developers\nwith AI throughout the entire dev life cycle.\n\nWith Visual Studio and VS Code, we have the world's most popular editor\nwith over 50 million monthly active users. And with Power Platform, we have\nthe leading low-code platform for AI makers, too. We now have 56 million\nmonthly active Power Platform users, up 27% year-over-year, who\nincreasingly use our AI features to build apps and automate processes.\n\nNow on to future of work. Microsoft 365 Copilot is built to facilitate\nhuman agent collaboration, hundreds of thousands of customers across\ngeographies and industries now use Copilot, up 3x year-over-year. Our\noverall deal size continues to grow. In this quarter, we saw a record\nnumber of customers returning to buy more seats. And we're going further.\nJust last week, we announced a major update, bringing together agents,\nnotebooks, search and create into a new scaffolding for work. Our new\nresearcher and analyst deep reasoning agents analyze vast amounts of web\nand enterprise data to deliver highly skilled expertise on demand directly\nwithin Copilot.\n\nBeyond horizontal knowledge work, we are introducing agents for every role\nand business process. Our sales agent turns contacts into qualified leads\nand with sales chat reps can quickly get up to speed on new accounts. And\nour customer service agent is deflecting customer inquiries and helping\nservice reps resolve issues faster.\n\nWith Copilot Studio, customers can extend Copilot and build their own\nagents with no code, low code. More than 230,000 organizations, including\n90% of the Fortune 500 have already used Copilot Studio. With deep\nreasoning and agent flows in Copilot Studio, customers can build agents\nthat perform more complex tasks and also handle deterministic scenarios\nlike document processing and financial approvals. And they can now build\nComputer Use Agents that take action on the UI across desktop and web apps.\nAnd with just a click, they can turn any SharePoint site into an agent,\ntoo. This quarter alone, customers created over 1 million custom agents\nacross SharePoint and Copilot Studio, up 130% quarter-over-quarter.\n\nWhen it comes to business applications, Dynamics 365 again took share as\ncompanies like Avaya, Brunswick, Softcat switched to Dynamics from legacy\nproviders. Verizon, for example, chose Dynamics 365 Sales to improve the\nefficiency of its sellers.\n\nIn healthcare, Dragon Copilot is off to a fast start. Last quarter alone,\nwe helped document nearly 9.5 million physician-patient encounters at\nproviders like City of Hope, Ottawa Hospital, Tufts Medicine and Wellstar,\nup over 50% quarter-over-quarter.\n\nIn manufacturing, we introduced factory operations and safety agents at\nHannover Messe. And leading partners like Autodesk, PTC and Siemens have\nall built their own industrial AI solutions on our stack.\n\nAnd in retail, we have introduced agents to help customers like Bath & Body\nWorks, build more personalized shopping experience and improve store\noperations.\n\nWhen it comes to Windows, Copilot+ PCs are faster and have better battery\nlife than any other device in their category. We also continue to win new\ncustomers with best-in-class AI capabilities. We offer a growing number of\nAI apps from partners like Adobe, Canva and Zoom. Just last week, we rolled\nout exclusive AI experiences like Recall, Click to Do and Windows Search to\nall Copilot+ PCs. And we continue to see increased commercial traction as\nwe approach end of support for Windows 10. Windows 11 commercial\ndeployments increased nearly 75% year-over-year.\n\nNow on to security. Security is our top priority, and we have made\nsignificant progress against the engineering objectives we outlined 1.5\nyears ago as part of our Secure Future Initiative. We are now applying\nthese learnings to deliver new innovation across our platform. Last month,\nalong with our partners, we introduced Security Copilot agents to help\nDefenders autonomously handle high-volume security and IT tasks informed by\n84 trillion daily threat signals. We also added new capabilities to\nDefender, Entra and Purview to help organizations secure and govern their\nAI deployments. All-up, we now have 1.4 million security customers, over\n900,000, including EY Global, ManpowerGroup, TriNet, Regions Bank have 4 or\nmore workloads, up 21% year-over-year. And in identity, Entra now has more\nthan 900 million monthly active users.\n\nNow on to our consumer businesses, starting with LinkedIn. Over 1 billion\nprofessionals use LinkedIn to connect, learn, hire and sell, and our\nmembership continues to grow at double digits year-over-year. Time spent\nwatching videos on the platform was up 36% and comments were up 32% year-\nover-year. We're also seeing more members use AI to gain new skills and\nfind jobs. The number of learners who have used AI-powered coaching\nincreased over 2x quarter-over-quarter, and we remain the market leader in\nhiring as customers like Equinix and Verizon use LinkedIn Hiring Assistant\nto find qualified candidates faster. When it comes to LinkedIn Premium, we\nsaw 75% quarter-over-quarter subscriber growth to our premium pages\noffering for SMBs. And LinkedIn Marketing Solution continues to be the best\nway to reach B2B decision-makers with 2 consecutive quarters of accelerated\nrevenue growth.\n\nMore broadly, when it comes to advertising, we are transforming our\npeople's search, browse, discover content and use AI as a personal\nassistant. With Copilot Search in Bing, we are reimagining search results\nwith overview pages curated by AI and embedded conversational capabilities.\nWith Copilot Vision and Edge, Copilot sees what you see and gives you real-\ntime responses while you browse. With Copilot Discover, we are\npersonalizing MSN experience based on user interactions and preferences.\nAnd with our updated Copilot app, we are focused on building daily\nengagement and successful sessions across a range of modalities, whether it\nis conversing, searching, shopping or travel planning. All-up, we again\ntook share across Bing and Edge, and our total advertising revenue across\nour businesses has surpassed $20 billion over the past 12 months.\n\nNow on to gaming. We continue to transform the business and focus on margin\nexpansion as we bring our games to over 500 million monthly active users\nacross devices. We ended the quarter as the top publisher by preorders and\npre-installs on both Xbox and PlayStation store. PC Game Pass revenue\nincreased over 45% year-over-year. With Xbox Play Anywhere, players now can\naccess more than 1,000 games they can play across console and PC. And just\nlast week, we brought cloud gaming to LG TVs. Cloud gaming set a new\nrecord, surpassing 150 million hours played for the first time this\nquarter. We are also integrating AI across the Xbox. New Copilot for Gaming\nis a personalized gaming companion that provides in-game assistance and\nexpert coaching. And our first-of-its-kind Muse model can generate gameplay\nin real time.\n\nFinally, it's fantastic to see the success of the Minecraft movie, which is\nthe top-grossing film of the year. In addition to monetizing our IP in new\nways, we have seen a 75% plus increase in weekly active users of the game\nyear-over-year since the release.\n\nIn closing, we are rapidly innovating to expand our opportunity across both\nconsumer and commercial businesses. In just a few weeks at our Build\nconference, we'll share how we are creating the most powerful platform for\ndevelopers and I encourage you to tune in.\n\nWith that, let me turn it over to Amy.\n\nAmy E. Hood\nExecutive VP & CFO\n\nThank you, Satya, and good afternoon, everyone. This quarter, revenue was\n$70.1 billion, up 13% and 15% in constant currency. Gross margin dollars\nincreased 11% and 13% in constant currency, while operating income\nincreased 16% and 19% in constant currency. And earnings per share was\n$3.46, an increase of 18% and 19% in constant currency. Results exceeded\nexpectations driven by focused execution from our sales and partner teams.\n\nWe continue to see strong demand for our cloud and AI offerings as they\nhelp customers drive productivity, increase efficiencies and grow their\nbusinesses. And again, this quarter, revenue from our AI business was above\nexpectations. Commercial bookings increased 18% and 17% in constant\ncurrency, significantly ahead of expectations again this quarter, driven by\nan Azure commitment from OpenAI.\n\nWe also saw consistent execution across our core annuity sales motions and\ncontinued long-term commitments to our platform. Commercial remaining\nperformance obligation increased to $315 billion, up 34% and 33% in\nconstant currency. Roughly 40% will be recognized in revenue in the next 12\nmonths, up 17% year-over-year. The remaining portion recognized beyond the\nnext 12 months increased 47%. And this quarter, our annuity mix was 98%.\n\nFX was roughly in line with expectations on total company revenue, segment\nlevel revenue and operating expense growth. FX decreased COGS growth by\nonly 1 point, 1 point unfavorable to expectations.\n\nMicrosoft Cloud revenue was $42.4 billion, ahead of expectations and grew\n20% and 22% in constant currency. Microsoft Cloud gross margin percentage\nwas 69%, in line with expectations and decreased 3 points year-over-year,\ndriven by the impact of scaling our AI infrastructure.\n\nCompany gross margin percentage was also 69%, down 1 point year-over-year,\ndriven by scaling our AI infrastructure.\n\nOperating expenses increased 2% and 3% in constant currency, lower than\nexpected due to our focus on cost efficiencies as well as investments that\nshifted to Q4. Operating margins increased 1 point year-over-year to 46%,\nbetter than expected as we continue to focus on building high-performing\nteams and increasing our agility by reducing layers with fewer managers. At\na total company level, head count at the end of March was 2% higher than a\nyear ago and was down slightly compared to last quarter.\n\nNow to our segment results. Revenue from Productivity and Business\nProcesses was $29.9 billion and grew 10% and 13% in constant currency,\nahead of expectations, driven by LinkedIn, Microsoft 365 Commercial\nproducts, and Microsoft 365 Consumer. M365 commercial cloud revenue\nincreased 12% and 15% in constant currency, in line with expectations.\n\nARPU growth was again driven by E5 and M365 Copilot. With M365 Copilot, we\ncontinue to see growth across customer segments and geos. Paid M365\nCommercial seats grew 7% year-over-year to over $430 million. While we\ncontinue to see installed base expansion across all segments, growth was\nprimarily driven by our small and medium business and frontline worker\nofferings.\n\nM365 Commercial products revenue increased 5% and 8% in constant currency,\nahead of expectations due to higher-than-expected office transactional\npurchasing. M365 consumer cloud revenue increased 10% and 12% in constant\ncurrency, ahead of expectations, driven by higher-than-expected\nsubscription growth following the January price increase. M365 Consumer\nsubscriptions grew 9% to $87.7 million.\n\nLinkedIn revenue increased 7% and 8% in constant currency. Results were\nahead of expectations due to better-than-expected performance across all\nbusinesses.\n\nThe Talent Solutions business continues to be impacted by weakness in the\nhiring market. Dynamics 365 revenue increased 16% and 18% in constant\ncurrency, in line with expectations with continued growth across all\nworkloads. Segment gross margin dollars increased 10% and 13% in constant\ncurrency, and gross margin percentage was relatively unchanged year-over-\nyear even with the impact of scaling our AI infrastructure. Operating\nexpenses increased 1% and 2% in constant currency. And operating income\nincreased 15% and 18% in constant currency.\n\nNext, the Intelligent Cloud segment. Revenue was $26.8 billion and grew 21%\nand 22% in constant currency, ahead of expectations, driven by Azure. In\nAzure and other cloud services, revenue grew 33% and 35% in constant\ncurrency, including 16 points from AI services. Focused execution drove non-\nAI services results, where we saw accelerated growth in our Enterprise\ncustomer segment as well as some improvement in our scale motions. And in\nAzure AI services, we brought capacity online faster than expected.\n\nIn our on-premises server business, revenue decreased 6% and 4% in constant\ncurrency, slightly below expectations, driven by renewals with lower in-\nperiod revenue recognition from the mix of contracts. The year-over-year\ndecline is reflective of the continued customer shift to cloud offerings.\n\nEnterprise and Partner Services revenue increased 5% and 6% in constant\ncurrency, slightly ahead of expectations due to better-than-expected\nperformance in Enterprise Support Services. Segment gross margin dollars\nincreased 13% and 14% in constant currency, and gross margin percentage\ndecreased 4 points year-over-year, driven by scaling our AI infrastructure.\nOperating expenses increased 6% and 7% in constant currency, and operating\nincome grew 17% and 18% in constant currency.\n\nNow to More Personal Computing. Revenue was $13.4 billion and grew 6% and\n7% in constant currency, ahead of expectations due to better-than-expected\nresults across all businesses. Windows OEM and Devices revenue increased 3%\nyear-over-year, ahead of expectations as tariffs uncertainty through the\nquarter resulted in inventory levels that remained elevated. Search and\nnews advertising revenue ex TAC increased 21% and 23% in constant currency.\nResults were significantly ahead of expectations, driven by usage from a\nthird-party partnership, better-than-expected rate expansion and volume\ngrowth across Edge and Bing.\n\nAnd in gaming, revenue increased 5% and 6% in constant currency. Xbox\ncontent and services revenue increased 8% and 9% in constant currency,\nahead of expectations, driven by stronger-than-expected performance in\nthird-party and first-party content. Segment gross margin dollars increased\n9% and 11% in constant currency. Gross margin percentage increased 2 points\nyear-over-year, driven by strong execution on margin improvement in search\nand gaming. Operating expenses increased 1%. Operating income increased 21%\nand 23% in constant currency, driven by continued prioritization of higher\nmargin opportunities.\n\nNow back to total company results. Capital expenditures, including finance\nleases were $21.4 billion, slightly lower than expected due to normal\nvariability from the timing of delivery of data center leases. Cash paid\nfor PP&E was $16.7 billion, Roughly half of our cloud and AI-related spend\nwas on long-lived assets that will support monetization over the next 15\nyears and beyond. The remaining cloud and AI spend was primarily for\nservers, both CPUs and GPUs, to serve customers based on demand signals,\nincluding our customer contracted backlog of $315 billion.\n\nCash flow from operations was $37 billion, up 16%, driven by strong cloud\nbillings and collections, partially offset by higher tax payments. And this\nquarter, free cash flow was $20.3 billion.\n\nOther income and expense was negative $623 million, more favorable than\nanticipated, primarily due to net gains on derivatives and investments. Our\nlosses on investments accounted for under the equity method were slightly\nhigher than expected. Our effective tax rate was approximately 18%. And\nfinally, we returned $9.7 billion to shareholders through dividends and\nshare repurchases, an increase of 15% year-over-year.\n\nNow moving to our Q4 outlook, which unless specifically noted otherwise, is\non a U.S. dollar basis. First, through April, demand signals across our\ncommercial businesses as well as in LinkedIn, gaming and search have\nremained consistent. Our outlook assumes those trends continue in Q4. If\nthe environment changes, our results may be impacted.\n\nIn our Windows OEM business, our outlook assumes the elevated inventory\nlevels from Q3 will come down in Q4. We have widened our guidance range in\nour More Personal Computing segment to account for some of this\nvariability.\n\nNext, FX. With the weakening of the U.S. dollar in April, we now expect FX\nto increase total revenue growth by 1 point. Within the segments, we expect\nFX to increase revenue growth by 1 point in Productivity and Business\nProcesses and less than 1 point in Intelligent Cloud and More Personal\nComputing. We expect FX to increase COGS operating expense growth by less\nthan 1 point.\n\nIn commercial bookings, we expect solid growth on a significant prior year\ncomparable and a growing expiry base. Bookings growth will be driven by\nstrong execution across our core annuity sales motions and continued long-\nterm commitments to our platform. As a reminder, larger, longer-term Azure\ncontracts, which are more unpredictable in their timing, can drive\nincreased quarterly volatility in our bookings growth rate.\n\nMicrosoft Cloud gross margin percentage should be roughly 67%, down year-\nover-year, primarily driven by the impact of scaling our AI infrastructure.\n\nAnd now capital expenditures. We expect Q4 capital expenditures to increase\non a sequential basis. H2 CapEx in total remains unchanged from our January\nH2 guidance. As a reminder, there can be quarterly spend variability from\ncloud infrastructure build-outs and the timing of delivery of finance\nleases.\n\nNext, to segment guidance. In Productivity and Business Processes, we\nexpect revenue of USD 32.05 billion to USD 32.35 billion or growth of 11%\nto 12% in constant currency. M365 commercial cloud revenue growth should be\napproximately 14% in constant currency, relatively stable compared to the\nprior quarter. We expect continued ARPU growth through E5 and M365 Copilot\nand some steep growth moderation given the size of the installed base.\n\nM365 Commercial products revenue growth should be in the mid-single digits.\nAs a reminder, M365 commercial products includes both the Windows\ncommercial on-premises components of M365 suite and office transactional\npurchasing, both of which can be variable due to in-period revenue\nrecognition dynamics. M365 Consumer cloud revenue growth should be in the\nmid-teens, driven by the January price increase.\n\nFor LinkedIn, we expect revenue growth in the high single digits. And in\nDynamics 365, we expect revenue growth to be in the mid- to high teens with\ncontinued growth across all workloads.\n\nFor Intelligent Cloud, we expect revenue of USD 28.75 billion to USD 29.05\nbillion or growth of 20% to 22% in constant currency. Revenue will continue\nto be driven by Azure, which, as a reminder, can have quarterly variability\nprimarily from in-period revenue recognition depending on the mix of\ncontracts.\n\nIn Azure, we expect Q4 revenue growth to be between 34% and 35% in constant\ncurrency, driven by strong demand for our portfolio of services. In our non-\nAI services, we expect focused execution to continue, driving healthy\ngrowth. And in our AI services, while we continue to bring data center\ncapacity online as planned, demand is growing a bit faster. Therefore, we\nnow expect to have some AI capacity constraints beyond June.\n\nIn our on-premises server business, we again expect revenue to decline in\nthe mid-single digits with the ongoing customer shift to cloud offerings.\n\nAnd in Enterprise and Partner Services, we expect revenue growth to be in\nthe mid- to high single digits, driven by Enterprise Support Services.\n\nIn More Personal Computing, we expect revenue to be USD 12.35 billion to\nUSD 12.85 billion. Windows OEM and devices revenue should decline in the\nmid- to high single digits. We expect Windows OEM revenue to decline in the\nlow to mid-single digits assuming OEM inventory levels come down through\nthe quarter as noted earlier, although the range of potential outcomes is\nwider than normal. Devices revenue should decline in the high teens.\n\nSearch and news advertising ex TAC revenue growth should be in the high\nteens, even on a strong prior year comparable. We expect to see continued\ngrowth in both volume and revenue per search with share gains across Edge\nand Bing. Overall, search and news advertising revenue growth should be in\nthe mid-teens.\n\nAnd in gaming, we expect revenue growth to be in the mid-single digits. We\nexpect Xbox content and services revenue growth to be in the high single\ndigits, driven by first-party content.\n\nNow back to company guidance. We expect COGS of USD 23.6 billion to USD\n23.8 billion or growth of 19% to 20% in constant currency. And operating\nexpense of USD 18 billion to USD 18.1 billion or growth of approximately 5%\nin constant currency. Therefore, even with ongoing AI investments as we\nscale, we continue to expect full year FY '25 operating margins to be up\nslightly year-over-year. Other income and expense is expected to be roughly\nnegative $1.2 billion, primarily driven by investments accounted for under\nthe equity method. As a reminder, we do not recognize mark-to-market gains\nor losses on equity method investments. And lastly, we expect our Q4\neffective tax rate to be approximately 19%.\n\nNow I'd like to share some closing thoughts as we look to the next fiscal\nyear. We remain committed to investing against the strong demand signals we\nsee for our services. So as a reminder, our earlier comments on FY '26\ncapital expenditures remain unchanged. We expect CapEx to grow. It will\ngrow at a lower rate than FY '25 and will include a greater mix of short-\nlived assets, which are more directly correlated to revenue than long-lived\nassets. These investments along with focused execution that delivers near-\nterm value to our customers will ensure we continue to lead through the\ncloud and AI opportunity ahead.\n\nWith that, let's go to Q&A, Jonathan.\n\nJonathan NeilsonThanks, Amy. We'll now move over to Q&A. Out of respect to\nothers on the call, we request that participants please only ask one\nquestion.\n\nQuestion and Answer\n\nOperator\n\n[Operator Instructions] And our first question comes from the line of Keith\nWeiss with Morgan Stanley.\n\nKeith Weiss\nMorgan Stanley, Research Division\n\nCongratulations on a fantastic quarter. And what all of us are looking at\nas a difficult environment, a lot of uncertainty out there, so really\nimpressive to put up the results that you guys did. One of the things that\nwe heard a lot about this quarter in the media and press reports was\nchanging data center commitments, maybe Microsoft walking away from some of\nthose data center commitments. But it sounds like the AI demand is very\nstrong. You're talking about not being able to hit all of that demand with\nthe supply. So can you talk to us about what's going on with your data\ncenter strategy? Are there any shifts taking place?\n\nAnd maybe in particular, Satya, you could talk about some of the comments\nthat you had made about the potential risk for oversupplies and GPUs out in\nthe future. What exactly was that risk you were talking about? And are you\nincorporating that risk into your data center strategy?\n\nSatya Nadella\nChairman & CEO\n\nYes. First of all, thanks, Keith, for the question. The reality is we've\nalways been making adjustments to build, lease, what pace we build all\nthrough the last 10, 15 years, it's just that you all pay a lot more\nattention to what we do quarter-over-quarter nowadays.\n\nHaving said that, the key thing for us is to have our builds and lease be\npositioned for what is the workload growth of the future, right? So that's\nwhat you have to [ goal ] seek to. So there's a demand part to it, there is\nthe shape of the workload part to it, and there is a location part to it.\nSo you don't want to be upside down on having one big data center in one\nregion when you have a global demand footprint. You don't want to be upside\ndown when the shape of demand changes because, after all, with essentially\npretraining plus test-time compute, that's a big change in terms of how you\nthink about even what is training, right, forget inferencing.\n\nSo fundamentally, given all of that, and then every time there's great\nMoore's Law, but remember, this is a compounding sort of S-curve, right,\nwhich is there's Moore's Law, there's system software, there's model\narchitecture changes, there's the app server efficiency. Given all of that,\nwe just want to make sure we're building accounting for the latest and\ngreatest sort of information we have on all of that. And that's what you\nsee reflected, and I feel very, very good about the pace. In fact, Amy just\nmentioned, we will be short power. And so therefore -- but it's not a\nblanket statement. I need power in specific places so that we can either\nlease or build at the pace at which we want. And so that's the sort of plan\nthat we're executing to.\n\nMaybe, Amy, you can add to that.\n\nAmy E. Hood\nExecutive VP & CFO\n\nYes, maybe just add a little bit to Satya's comments. Just a reminder,\nthese are very long lead time decisions. From land to build to build-outs\ncan be lead times of 5 to 7 years, 2 to 3 years. So we're constantly in a\nbalancing position as we watch demand curves and many of the things Satya\nwatch.\n\nAnd the second part is just to maybe remind you, when Satya talks about\nbeing short power, he's really talking about data center space. And so\nwe've continued through the second half to put things in place. In fact, we\ntalked a little bit about pulling even some of that space to be ready\nearlier and being able to deliver that earlier to customers this quarter,\nwhich is really good work by the teams as we continue to get more and more\nefficient at that process. And I look forward to being able to continue to\ndo that in the future.\n\nI did talk about in my comments, we had hoped to be in balance by the end\nof Q4. We did see some increased demand as you saw through the quarter. So\nwe are going to be a little short still, say, a little tight as we exit the\nyear but are encouraged by that.\n\nOperator\n\nThe next question comes from the line of Brent Thill with Jefferies.\n\nBrent John Thill\nJefferies LLC, Research Division\n\nSatya, on your comment about accelerating demand for cloud migrations. I'm\ncurious if you could dig in and extrapolate a little more what you're\nseeing there.\n\nSatya Nadella\nChairman & CEO\n\nThanks, Brent. So yes -- so I sort of think about 3 big things that are\nhappening in the cloud all in parallel, and there's also a relationship\nbetween them. One is, I'll just say, the classic migration of whether it's\nSQL, Windows Server. And so that sort of again got good steady-state\nprogress because the reality is, I think everyone is now, perhaps there's\nanother sort of kick in the data center migrations just because of the\nefficiency the cloud provides. So that's sort of one part.\n\nThe second piece is good data growth. You saw some -- like Postgres on\nAzure -- I mean, forgetting even SQL server, Postgres on Azure is growing.\nCosmos is growing. The analytics stuff I talked about with Fabric. It's\neven the others, whether it is Databricks or even Snowflake on Azure are\ngrowing. So we feel very good about Fabric growth and our data growth. Then\nthe cloud-native growth. So this is again before we even get to AI, some of\nthe core compute consumption of cloud-native players is also pretty very\nhealthy. It was healthy throughout the quarter. We projected to go moving\nforward as well.\n\nThen the thing to notice is the ratio, and I think we mentioned this\nmultiple times before, if you look underneath even ChatGPT, in fact, that\nteam does a fantastic job of thinking about not only their growth in terms\nof AI accelerators they need, they use Cosmos DB, they use Postgres. They\nuse core compute and storage. And so there's even a ratio between any AI\nworkload in terms of AI accelerator to others.\n\nSo those are the 4 pockets, I'd say, or 4 different trend lines, which all\nhave a relationship with each other. And if I step back, and Amy and I talk\na lot about this, this time around, there's nothing certain for sure in the\nfuture, except for one thing, which is our largest business is our\ninfrastructure business. And the good news here is the next big platform\nshift builds on that. So it's not a complete rebuild, having gone through\nall these platform shifts where you have to come out on the other side with\na full rebuild. If there is good news here is that we have a good business\nin Azure that continues to grow and the new platform depends on that. So we\nwant to stay disciplined and execute super well on that.\n\nOperator\n\nThe next question comes from the line of Mark Moerdler with Bernstein\nResearch.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nI will reiterate what my peers have said. Congratulations on the great\nquarter. Satya and Amy, Microsoft is a very different business than it was\nduring the last recession. Incredible job you've done. If we get into a\nrecession, I hope we don't, how do you think about the stability, the\nsustainability, revenue volatility of Microsoft today if we were to get\ninto a recession? Would the business react early to a recession or late?\nWould a recession have a more shallow impact on revenue? Any thoughts would\nbe appreciated.\n\nSatya Nadella\nChairman & CEO\n\nMaybe I'll start, and then Amy should add, Mark. The way at least I think\nwe will approach it is, quite frankly, be very focused on how we help our\ncustomers if there is any turbulence in the macro because one of the things\nthat we feel we can do just because of the efficiencies of the cloud and\nthe footprint we have and the differentiated sort of layers of the stack\nfrom the SaaS application side to the infrastructure side. I think if you\nsort of buy into the argument that software is the most valuable resource\nwe have to fight any type of inflationary pressure or any type of growth\npressure where you need to do more with less, I think we can be super\nhelpful in that. And so if anything, we would probably have more of that\nmindset is how do we make sure we are helping our customers. And then, of\ncourse, we'll look to share gains.\n\nOperator\n\nThe next question comes from the line of Karl Keirstead with UBS.\n\nKarl Emil Keirstead\nUBS Investment Bank, Research Division\n\nA number of metrics to applaud, but I think the one that stands out to me\nis the 16-point growth rate lift to Azure from AI. Satya and Amy, I just\nwanted to ask if you could unpack that a little bit. Of course, you\nmentioned that you got a bit of a kicker from capacity coming online. But\nI'm a little bit more interested in where the demand came in above\nexpectations, like what workload type? It's hard for us to see that on the\noutside. Was it a surge in ChatGPT inference that landed in Azure? Was it\nan uptick in enterprise AI adoption? And Amy, do you think that 16 points\ncould be higher in June?\n\nAmy E. Hood\nExecutive VP & CFO\n\nThanks, Karl, for the question. Just to provide some clarity because I\nthink your question implies something that we didn't mean to imply on the\ncall. First, the real outperformance in Azure this quarter was in our non-\nAI business. So then to talk about the AI business, really, what was better\nwas precisely what we said. We talked about this. We knew Q3 that we had\nand hadn't really match supply and demand pretty carefully and so didn't\nexpect to do much better than we had guided to on the AI side. We've been\nquite consistent on that.\n\nSo the only real upside we saw on the AI side of the business was that we\nwere able to deliver supply early to a number of customers. And being able\nto do that throughout the quarter creates quite a good benefit to us. But\nthe majority of our outperformance versus where we had expected to be was\non the non-AI piece of the business.\n\nOperator\n\nThe next question comes from the line of Kash Rangan with Goldman Sachs.\n\nKasthuri Gopalan Rangan\nGoldman Sachs Group, Inc., Research Division\n\nOne question for Amy. You've said in the past that you can attain better\nand better capital efficiency with the cloud business and probably cloud\nand AI business. Where do you stand today, Amy, and maybe Satya you can\nopine as well, that you've said before that you can slow down your CapEx\ngrowth rate while still accelerate Azure, which includes AI? Can we get a\nmark-to-market on that?\n\nAmy E. Hood\nExecutive VP & CFO\n\nMaybe I'll start, Kash, and let talk Satya add on, because I really think\nwhen you go back and read some of Satya's comments on how the S-curves\nbuild on themselves, that's actually the levers that go into the answer of\nthe question that you're asking. And so the way, of course, you've seen\nthat historically is right when we went through the prior cloud\ntransitions, you see CapEx accelerate, you build out data center\nfootprint.,, You slowly filled GPU capacity. And over time, you see\nsoftware efficiencies and hardware efficiencies build on themselves. And\nyou saw that process for us for goodness now quite a long time.\n\nAnd what Satya's talking about is how quickly that's happening on the AI\nside of the business and you add to that model diversity. So think about\nthe same levers plus model efficiency, those compounds. Now the one thing\nthat's a little different this time is just the pace. And so when you're\nseeing that happen, pace in terms of efficiency side, but also pace in\nterms of the build-out. So it can mask some of the progress. But we are\nworking hard across all of the teams, hardware, software, even the build\nteams to get things in place as quickly as possible, dock to live times,\nall of that is improving and all of that actually is benefiting us. And\nI'll go ahead and say our margins on the AI side of the business are better\nthan they were at this point by far than when we went through the same\ntransition and the server to cloud transition.\n\nSatya Nadella\nChairman & CEO\n\nYes. I mean I think at a macro level, I think the way to think about this\nis you can ask the question, what's the difference between a hosting\nbusiness and a hyperscale business? It's software. That's, I think, the\ngist of it. Yes, for sure, it's a capital-intensive business, but capital\nefficiency comes from that system-wide software optimization. And that's\nwhat makes the hyperscale business attractive and that's what we want to\njust keep executing super well on.\n\nOperator\n\nThe next question comes from the line of Mark Murphy with JPMorgan.\n\nMark Ronald Murphy\nJPMorgan Chase & Co, Research Division\n\nSatya, you had commented recently that the DeepSeek moment is a real thing.\nAnd you had said that software efficiencies mean that the fleet will be\naged for a longer time. Can you comment on how those advances are affecting\nthe pace and volume of AI experimentation and activity in the marketplace?\nAnd Amy, could we start to consider the possibility that software\nenhancements might extend the useful life assumption that you're using for\nGPUs? Is it a little premature to be thinking that way?\n\nSatya Nadella\nChairman & CEO\n\nYes. First of all, I think some of the work that actually OpenAI first\npioneered indeed with all other reasoning models. And of course, DeepSeek\nhas sort of added to it and done good work as well and others as well. The\nidea that you can have test-time compute plus pre-training and then some of\nthe great optimization at inference time that has all happened has proven\nup. I mean if you look at -- I would say, for every Moore's Law change and\nmovement, there's probably a 10x improvement because of software, right?\nThat's sort of what's happening with these models.\n\nSome of it comes from model architecture, some of that comes from data\nefficiency, compute efficiency and what have you. So that's what we are\nwriting. And we feel that, all-up, when you have a commodity that is\ngetting that better, then the question is how do you build out a fleet\nthat's super balanced so that then the workloads can be built and can, in\nfact, take advantage of that efficiency and the underlying infrastructure.\nI mean it's kind of like virtualization. What is the difference between\nservers and sort of, again, client-server with virtualization? It was\nefficiency. What is the difference between virtualization and cloud? It was\nefficiency. What is the difference between this generation of cloud and AI?\nIt's efficiency. So the more you can kind of continue to think about\nsoftware driving that efficiency is what drives demand ultimately.\n\nAmy E. Hood\nExecutive VP & CFO\n\nAnd to your specific question, in terms of thinking about the depreciable\nlife of an asset, we like to have a long history before we make any of\nthose changes. So we're focused on getting every bit of useful life we can,\nof course, out of assets. But to Satya's point, that tends to be a software\nquestion more than a hardware one.\n\nOperator\n\nThe next question comes from the line of Kirk Materne with Evercore ISI.\n\nKirk Materne\nEvercore ISI Institutional Equities, Research Division\n\nCongrats on a great quarter. Amy, you mentioned that the upside on Azure\ncame from the non-AI services this time around. I was wondering if you\ncould just talk a little bit more about that. And I guess as you look\nforward, maybe what's different this go around versus what we saw a few\nyears ago when obviously, things like optimization weighed on the growth a\nlittle bit. It sounds like the product portfolio is much broader right now.\nBut just wondering if you could add some color on that front.\n\nAmy E. Hood\nExecutive VP & CFO\n\nSure. And thanks for the question, Kirk. If we go to non-AI, I talked a\nlittle bit about this. In general, we saw better-than-expected performance\nacross our segments, but we saw acceleration in our largest customers. We\ncall that the Enterprise segment in general. And then in what we talked\nabout of our scale motions, where we had some challenges in Q2, things were\na little better. And we still have some work to do in our scale motions,\nand we're encouraged by our progress. We're excited to stay focused on that\nas, of course, we work through the final quarter of our fiscal year.\n\nBy geo, the performance was pretty consistent. Satya actually highlighted\nsome of the workloads that came in a little better than we thought.\nObviously, just some good consistent work on migrations, good execution by\nthe sales and partner teams, the data workloads he went through. And so in\ngeneral, Kirk, I wouldn't say it's anything beyond that. I do think it was\nimproved execution. And I was happy to see it, but there's still some work\nto do on our scale motions, in particular.\n\nJonathan Neilson\n\nOperator, we have time for one last question.\n\nOperator\n\nThe last question will come from the line of Alex Zukin with Wolfe\nResearch.\n\nAleksandr J. Zukin\nWolfe Research, LLC\n\nAnd again, just amazing congratulations on those Azure numbers, which I\nthink are quite honestly, just inspiring. So maybe, Amy, to the point that\nyou're making that the surprise factor was on the non-Azure -- non-AI side\nof the house. And it sounds like there's confidence in that continuing\nbeyond. How much of that are you starting to see the pull in of the non-AI\ndriven by the AI portion of Azure? And on the AI portion specifically, as\ntest-time compute really just blows out kind of prior conceptions of\nscaling law challenges, how much does that change potentially the curve of\nthe AI Azure growth as you go forward here over the next few quarters?\n\nAmy E. Hood\nExecutive VP & CFO\n\nThanks, Alex. Let me first of all say, I think we've talked about this\nquite a bit, it's always a good chance to get to iterate this. It's getting\nharder and harder to separate what an AI workload is from a non-AI\nworkload. And we've talked about it this way. I think in most instances, to\nmake sure people understood that when we were accelerating all of our CapEx\nspend over the past 2.5 or 3 years now, that people had confidence that we\nwere turning that into revenue and product in a way that was transparent\nand that everyone could understand really the goals that we have set for\nourselves and for our partners and customers in terms of building product\nthat turned to revenue.\n\nBut if you take a step back from that, it's that these workloads are being\nbuilt, GPU, CPU, storage, network, all the same things. And so I think\nreally what we're talking about is really how Satya talked about in one of\nthe earlier questions, we're seeing digital natives. Digital natives build\nworkloads. They do AI work. They do non-AI work. Do they tend to do that\nwork in the same cloud? Lots of times. Sometimes it all in the same place,\nnot all the time, but that relationship gets stronger and stronger as\npeople pivot to more of AI-heavy workloads. And so I think you're starting\nto see some of that relationship. I think we'll continue to see that as AI\nworkloads continue to get built and experimented with and proof of concepts\nget expanded.\n\nAnd so I think I mostly focus on the fact that together, we saw good\nperformance in Q3 on Azure. As you're inclusive of both components, in\nterms of our execution, in terms of the skilled and partner teams and\nbacklog and conversion and interesting workloads and adding customer value\nand solving real problems and adding real value. And I think that's\nprobably, Alex, how I would approach that number more than trying to\nseparate it in the way that even we have talked about it, but for very\ndifferent reasons.\n\nJonathan Neilson\n\nThat wraps up the Q&A portion of today's earnings call. Thank you for\njoining us today, and we look forward to speaking with you all soon.\n\nSatya Nadella\nChairman & CEO\n\nThank you.\n\nAmy E. Hood\nExecutive VP & CFO\n\nThank you.\n\nOperatorThis concludes today's conference. You may disconnect your lines at\nthis time, and enjoy the rest of your day.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.",
  "presentation_text": "Operator\n\nGreetings, and welcome to the Microsoft Fiscal Year 2025 Third Quarter\nEarnings Conference Call. [Operator Instructions] As a reminder, this\nconference is being recorded.\n\nIt is now my pleasure to introduce Jonathan Neilson, Vice President of\nInvestor Relations. Please go ahead.\n\nJonathan Neilson\n\nGood afternoon, and thank you for joining us today. On the call with me are\nSatya Nadella, Chairman and Chief Executive Officer; Amy Hood, Chief\nFinancial Officer; Alice Jolla, Chief Accounting Officer; and Keith\nDolliver, Corporate Secretary and Deputy General Counsel.\n\nOn the Microsoft Investor Relations website, you can find our earnings\npress release and financial summary slide deck, which is intended to\nsupplement our prepared remarks during today's call and provides a\nreconciliation of differences between GAAP and non-GAAP financial measures.\nMore detailed outlook slides will be available on the Microsoft Investor\nRelations website when we provide outlook commentary on today's call.\n\nOn this call, we will discuss certain non-GAAP items, the non-GAAP\nfinancial measures provided should not be considered as a substitute for or\nsuperior to the measures of financial performance prepared in accordance\nwith GAAP. They are included as additional clarifying items to aid\ninvestors in further understanding the company's third quarter performance\nin addition to the impact these items and events have on the financial\nresults.\n\nAll growth comparisons we make on the call today relate to the\ncorresponding period of last year, unless otherwise noted. We will also\nprovide growth rates in constant currency when available as a framework for\nassessing how our underlying business performed, excluding the effect of\nforeign currency rate fluctuations. Where growth rates are the same in\nconstant currency, we will refer to the growth rate only.\n\nWe will post our prepared remarks to our website immediately following the\ncall until the complete transcript is available.\n\nToday's call is being webcast live and recorded. If you ask a question, it\nwill be included in our live transmission, in the transcript and in any\nfuture use of the recording. You can replay the call and view the\ntranscript on the Microsoft Investor Relations website.\n\nDuring this call, we will be making forward-looking statements, which are\npredictions, projections or other statements about future events. These\nstatements are based on current expectations and assumptions that are\nsubject to risks and uncertainties. Actual results could materially differ\nbecause of factors discussed in today's earnings press release, in the\ncomments made during this conference call and in the Risk Factors section\nof our Form 10-K, Form 10-Q and other reports and filings with the\nSecurities and Exchange Commission. We do not undertake any duty to update\nany forward-looking statement.\n\nAnd with that, I'll turn the call over to Satya.\n\nSatya Nadella\nChairman & CEO\n\nThank you, Jonathan. It was a record quarter, driven by continued strength\nof Microsoft Cloud, which surpassed $42 billion in revenue, up 22% in\nconstant currency. Cloud and AI are the essential inputs for every business\nto expand output, reduce costs and accelerate growth.\n\nNow I'll highlight examples starting with infrastructure. We continue to\nexpand our data center capacity. This quarter alone, we opened DCs in 10\ncountries across 4 continents. Model capabilities are doubling in\nperformance every 6 months, thanks to multiple compounding scaling laws. We\ncontinue to optimize and drive efficiencies across every layer, from DC\ndesign to hardware and silicon to system software to model optimization,\nall towards lowering costs and increasing performance. You see this in our\nsupply chain where we have reduced dock to lead times for new GPUs by\nnearly 20% across our blended fleet where we have increased AI performance\nby nearly 30% ISO power and our cost per token, which has more than halved.\n\nWhen it comes to cloud migrations, we saw accelerating demand with\ncustomers in every industry, from Abercrombie in French, to Coca-Cola and\nServiceNow expanding their footprints on Azure. And we remain the cloud of\nchoice for customers' mission-critical VMware, SAP and Oracle workloads\nwith more regional availability than any other hyperscaler.\n\nWe're also excited about the next frontier in cloud systems with Quantum.\nIn addition to putting our quantum stack on machines from our partners,\nwe're also making real progress on a path to a utility-scale quantum\ncomputer with the introduction of Majorana 1.\n\nWhen it comes to data and analytics, we have deeply integrated our AI\nplatform with our data stack. PostgreSQL usage accelerated for the third\nconsecutive quarter, and it is now used by nearly 60% of the Fortune 500,\nincluding companies like BMW and BNY Mellon. Cosmos DB revenue growth also\naccelerated again this quarter and remains the go-to database for globally\ndistributed NoSQL workloads at any scale. It is used by customers in every\nindustry like CarMax, DocuSign, NTT DATA and OpenAI.\n\nThis quarter, we also saw analytics consumption accelerate. Microsoft\nFabric has more than 21,000 paid customers, up 80% year-over-year. Fabric\nbrings together data workloads like data warehousing, data science, real-\ntime intelligence, along with Power BI into one end-to-end solution. Real-\ntime intelligence is now the fastest-growing workload in Fabric with 40% of\ncustomers already using it in just 5 months since becoming generally\navailable, all up more than 50% of Fabric customers like Amorepacific,\nLouisiana State Government and Petrobras use 3 or more workloads. And the\namount of data in our multi-cloud data lake, OneLake, has grown more than\n6x over the past year.\n\nNow on to AI platform and tools. Foundry is the agent in AI app factory.\nIt's now used by developers at over 70,000 enterprises and digital natives\nfrom Atomicwork to Epic, Fujitsu and Gainsight to H&R Block and LG\nElectronics to design, customize and manage their AI apps and agents. We\nprocessed over 100 trillion tokens this quarter, up 5x year-over-year,\nincluding a record 50 trillion tokens last month alone. And 4 months in,\nover 10,000 organizations have used our new agent service to build, deploy\nand scale their agents.\n\nThis quarter, we also made a new suite of fine-tuning tools available to\ncustomers with industry-leading reliability, and we brought the latest\nmodels from OpenAI along with new models from Cohere, DeepSeek, Meta,\nMistral, Stability to Foundry. And we've expanded our 5 family of SLMs with\nnew multimodal and mini models. All-up, Phi has been downloaded 38 million\ntimes. And our research teams are taking it one step further with BitNet\nb1.58, a billion parameter, large language model that can run on just CPUs\ncoming to the Foundry.\n\nNow on to developer tools. We're evolving GitHub Copilot from paired to\npeer programmer with agent mode in VS Code, Copilot can now iterate on\ncode, recognize errors and fix them automatically. This adds to other\nCopilot agents like Autofix, which helps developers remediate\nvulnerabilities as well as code review agent, which has already reviewed\nover 8 million pull requests. And we are previewing a first-of-its-kind SWE-\nagent capable of asynchronously executing developer tasks. All-up, we now\nhave over 15 million GitHub Copilot users, up over 4x year-over-year. And\nboth digital natives like Twilio and enterprises like Cisco, HPE,\nSkyscanner and Target continue to choose GitHub Copilot to their developers\nwith AI throughout the entire dev life cycle.\n\nWith Visual Studio and VS Code, we have the world's most popular editor\nwith over 50 million monthly active users. And with Power Platform, we have\nthe leading low-code platform for AI makers, too. We now have 56 million\nmonthly active Power Platform users, up 27% year-over-year, who\nincreasingly use our AI features to build apps and automate processes.\n\nNow on to future of work. Microsoft 365 Copilot is built to facilitate\nhuman agent collaboration, hundreds of thousands of customers across\ngeographies and industries now use Copilot, up 3x year-over-year. Our\noverall deal size continues to grow. In this quarter, we saw a record\nnumber of customers returning to buy more seats. And we're going further.\nJust last week, we announced a major update, bringing together agents,\nnotebooks, search and create into a new scaffolding for work. Our new\nresearcher and analyst deep reasoning agents analyze vast amounts of web\nand enterprise data to deliver highly skilled expertise on demand directly\nwithin Copilot.\n\nBeyond horizontal knowledge work, we are introducing agents for every role\nand business process. Our sales agent turns contacts into qualified leads\nand with sales chat reps can quickly get up to speed on new accounts. And\nour customer service agent is deflecting customer inquiries and helping\nservice reps resolve issues faster.\n\nWith Copilot Studio, customers can extend Copilot and build their own\nagents with no code, low code. More than 230,000 organizations, including\n90% of the Fortune 500 have already used Copilot Studio. With deep\nreasoning and agent flows in Copilot Studio, customers can build agents\nthat perform more complex tasks and also handle deterministic scenarios\nlike document processing and financial approvals. And they can now build\nComputer Use Agents that take action on the UI across desktop and web apps.\nAnd with just a click, they can turn any SharePoint site into an agent,\ntoo. This quarter alone, customers created over 1 million custom agents\nacross SharePoint and Copilot Studio, up 130% quarter-over-quarter.\n\nWhen it comes to business applications, Dynamics 365 again took share as\ncompanies like Avaya, Brunswick, Softcat switched to Dynamics from legacy\nproviders. Verizon, for example, chose Dynamics 365 Sales to improve the\nefficiency of its sellers.\n\nIn healthcare, Dragon Copilot is off to a fast start. Last quarter alone,\nwe helped document nearly 9.5 million physician-patient encounters at\nproviders like City of Hope, Ottawa Hospital, Tufts Medicine and Wellstar,\nup over 50% quarter-over-quarter.\n\nIn manufacturing, we introduced factory operations and safety agents at\nHannover Messe. And leading partners like Autodesk, PTC and Siemens have\nall built their own industrial AI solutions on our stack.\n\nAnd in retail, we have introduced agents to help customers like Bath & Body\nWorks, build more personalized shopping experience and improve store\noperations.\n\nWhen it comes to Windows, Copilot+ PCs are faster and have better battery\nlife than any other device in their category. We also continue to win new\ncustomers with best-in-class AI capabilities. We offer a growing number of\nAI apps from partners like Adobe, Canva and Zoom. Just last week, we rolled\nout exclusive AI experiences like Recall, Click to Do and Windows Search to\nall Copilot+ PCs. And we continue to see increased commercial traction as\nwe approach end of support for Windows 10. Windows 11 commercial\ndeployments increased nearly 75% year-over-year.\n\nNow on to security. Security is our top priority, and we have made\nsignificant progress against the engineering objectives we outlined 1.5\nyears ago as part of our Secure Future Initiative. We are now applying\nthese learnings to deliver new innovation across our platform. Last month,\nalong with our partners, we introduced Security Copilot agents to help\nDefenders autonomously handle high-volume security and IT tasks informed by\n84 trillion daily threat signals. We also added new capabilities to\nDefender, Entra and Purview to help organizations secure and govern their\nAI deployments. All-up, we now have 1.4 million security customers, over\n900,000, including EY Global, ManpowerGroup, TriNet, Regions Bank have 4 or\nmore workloads, up 21% year-over-year. And in identity, Entra now has more\nthan 900 million monthly active users.\n\nNow on to our consumer businesses, starting with LinkedIn. Over 1 billion\nprofessionals use LinkedIn to connect, learn, hire and sell, and our\nmembership continues to grow at double digits year-over-year. Time spent\nwatching videos on the platform was up 36% and comments were up 32% year-\nover-year. We're also seeing more members use AI to gain new skills and\nfind jobs. The number of learners who have used AI-powered coaching\nincreased over 2x quarter-over-quarter, and we remain the market leader in\nhiring as customers like Equinix and Verizon use LinkedIn Hiring Assistant\nto find qualified candidates faster. When it comes to LinkedIn Premium, we\nsaw 75% quarter-over-quarter subscriber growth to our premium pages\noffering for SMBs. And LinkedIn Marketing Solution continues to be the best\nway to reach B2B decision-makers with 2 consecutive quarters of accelerated\nrevenue growth.\n\nMore broadly, when it comes to advertising, we are transforming our\npeople's search, browse, discover content and use AI as a personal\nassistant. With Copilot Search in Bing, we are reimagining search results\nwith overview pages curated by AI and embedded conversational capabilities.\nWith Copilot Vision and Edge, Copilot sees what you see and gives you real-\ntime responses while you browse. With Copilot Discover, we are\npersonalizing MSN experience based on user interactions and preferences.\nAnd with our updated Copilot app, we are focused on building daily\nengagement and successful sessions across a range of modalities, whether it\nis conversing, searching, shopping or travel planning. All-up, we again\ntook share across Bing and Edge, and our total advertising revenue across\nour businesses has surpassed $20 billion over the past 12 months.\n\nNow on to gaming. We continue to transform the business and focus on margin\nexpansion as we bring our games to over 500 million monthly active users\nacross devices. We ended the quarter as the top publisher by preorders and\npre-installs on both Xbox and PlayStation store. PC Game Pass revenue\nincreased over 45% year-over-year. With Xbox Play Anywhere, players now can\naccess more than 1,000 games they can play across console and PC. And just\nlast week, we brought cloud gaming to LG TVs. Cloud gaming set a new\nrecord, surpassing 150 million hours played for the first time this\nquarter. We are also integrating AI across the Xbox. New Copilot for Gaming\nis a personalized gaming companion that provides in-game assistance and\nexpert coaching. And our first-of-its-kind Muse model can generate gameplay\nin real time.\n\nFinally, it's fantastic to see the success of the Minecraft movie, which is\nthe top-grossing film of the year. In addition to monetizing our IP in new\nways, we have seen a 75% plus increase in weekly active users of the game\nyear-over-year since the release.\n\nIn closing, we are rapidly innovating to expand our opportunity across both\nconsumer and commercial businesses. In just a few weeks at our Build\nconference, we'll share how we are creating the most powerful platform for\ndevelopers and I encourage you to tune in.\n\nWith that, let me turn it over to Amy.\n\nAmy E. Hood\nExecutive VP & CFO\n\nThank you, Satya, and good afternoon, everyone. This quarter, revenue was\n$70.1 billion, up 13% and 15% in constant currency. Gross margin dollars\nincreased 11% and 13% in constant currency, while operating income\nincreased 16% and 19% in constant currency. And earnings per share was\n$3.46, an increase of 18% and 19% in constant currency. Results exceeded\nexpectations driven by focused execution from our sales and partner teams.\n\nWe continue to see strong demand for our cloud and AI offerings as they\nhelp customers drive productivity, increase efficiencies and grow their\nbusinesses. And again, this quarter, revenue from our AI business was above\nexpectations. Commercial bookings increased 18% and 17% in constant\ncurrency, significantly ahead of expectations again this quarter, driven by\nan Azure commitment from OpenAI.\n\nWe also saw consistent execution across our core annuity sales motions and\ncontinued long-term commitments to our platform. Commercial remaining\nperformance obligation increased to $315 billion, up 34% and 33% in\nconstant currency. Roughly 40% will be recognized in revenue in the next 12\nmonths, up 17% year-over-year. The remaining portion recognized beyond the\nnext 12 months increased 47%. And this quarter, our annuity mix was 98%.\n\nFX was roughly in line with expectations on total company revenue, segment\nlevel revenue and operating expense growth. FX decreased COGS growth by\nonly 1 point, 1 point unfavorable to expectations.\n\nMicrosoft Cloud revenue was $42.4 billion, ahead of expectations and grew\n20% and 22% in constant currency. Microsoft Cloud gross margin percentage\nwas 69%, in line with expectations and decreased 3 points year-over-year,\ndriven by the impact of scaling our AI infrastructure.\n\nCompany gross margin percentage was also 69%, down 1 point year-over-year,\ndriven by scaling our AI infrastructure.\n\nOperating expenses increased 2% and 3% in constant currency, lower than\nexpected due to our focus on cost efficiencies as well as investments that\nshifted to Q4. Operating margins increased 1 point year-over-year to 46%,\nbetter than expected as we continue to focus on building high-performing\nteams and increasing our agility by reducing layers with fewer managers. At\na total company level, head count at the end of March was 2% higher than a\nyear ago and was down slightly compared to last quarter.\n\nNow to our segment results. Revenue from Productivity and Business\nProcesses was $29.9 billion and grew 10% and 13% in constant currency,\nahead of expectations, driven by LinkedIn, Microsoft 365 Commercial\nproducts, and Microsoft 365 Consumer. M365 commercial cloud revenue\nincreased 12% and 15% in constant currency, in line with expectations.\n\nARPU growth was again driven by E5 and M365 Copilot. With M365 Copilot, we\ncontinue to see growth across customer segments and geos. Paid M365\nCommercial seats grew 7% year-over-year to over $430 million. While we\ncontinue to see installed base expansion across all segments, growth was\nprimarily driven by our small and medium business and frontline worker\nofferings.\n\nM365 Commercial products revenue increased 5% and 8% in constant currency,\nahead of expectations due to higher-than-expected office transactional\npurchasing. M365 consumer cloud revenue increased 10% and 12% in constant\ncurrency, ahead of expectations, driven by higher-than-expected\nsubscription growth following the January price increase. M365 Consumer\nsubscriptions grew 9% to $87.7 million.\n\nLinkedIn revenue increased 7% and 8% in constant currency. Results were\nahead of expectations due to better-than-expected performance across all\nbusinesses.\n\nThe Talent Solutions business continues to be impacted by weakness in the\nhiring market. Dynamics 365 revenue increased 16% and 18% in constant\ncurrency, in line with expectations with continued growth across all\nworkloads. Segment gross margin dollars increased 10% and 13% in constant\ncurrency, and gross margin percentage was relatively unchanged year-over-\nyear even with the impact of scaling our AI infrastructure. Operating\nexpenses increased 1% and 2% in constant currency. And operating income\nincreased 15% and 18% in constant currency.\n\nNext, the Intelligent Cloud segment. Revenue was $26.8 billion and grew 21%\nand 22% in constant currency, ahead of expectations, driven by Azure. In\nAzure and other cloud services, revenue grew 33% and 35% in constant\ncurrency, including 16 points from AI services. Focused execution drove non-\nAI services results, where we saw accelerated growth in our Enterprise\ncustomer segment as well as some improvement in our scale motions. And in\nAzure AI services, we brought capacity online faster than expected.\n\nIn our on-premises server business, revenue decreased 6% and 4% in constant\ncurrency, slightly below expectations, driven by renewals with lower in-\nperiod revenue recognition from the mix of contracts. The year-over-year\ndecline is reflective of the continued customer shift to cloud offerings.\n\nEnterprise and Partner Services revenue increased 5% and 6% in constant\ncurrency, slightly ahead of expectations due to better-than-expected\nperformance in Enterprise Support Services. Segment gross margin dollars\nincreased 13% and 14% in constant currency, and gross margin percentage\ndecreased 4 points year-over-year, driven by scaling our AI infrastructure.\nOperating expenses increased 6% and 7% in constant currency, and operating\nincome grew 17% and 18% in constant currency.\n\nNow to More Personal Computing. Revenue was $13.4 billion and grew 6% and\n7% in constant currency, ahead of expectations due to better-than-expected\nresults across all businesses. Windows OEM and Devices revenue increased 3%\nyear-over-year, ahead of expectations as tariffs uncertainty through the\nquarter resulted in inventory levels that remained elevated. Search and\nnews advertising revenue ex TAC increased 21% and 23% in constant currency.\nResults were significantly ahead of expectations, driven by usage from a\nthird-party partnership, better-than-expected rate expansion and volume\ngrowth across Edge and Bing.\n\nAnd in gaming, revenue increased 5% and 6% in constant currency. Xbox\ncontent and services revenue increased 8% and 9% in constant currency,\nahead of expectations, driven by stronger-than-expected performance in\nthird-party and first-party content. Segment gross margin dollars increased\n9% and 11% in constant currency. Gross margin percentage increased 2 points\nyear-over-year, driven by strong execution on margin improvement in search\nand gaming. Operating expenses increased 1%. Operating income increased 21%\nand 23% in constant currency, driven by continued prioritization of higher\nmargin opportunities.\n\nNow back to total company results. Capital expenditures, including finance\nleases were $21.4 billion, slightly lower than expected due to normal\nvariability from the timing of delivery of data center leases. Cash paid\nfor PP&E was $16.7 billion, Roughly half of our cloud and AI-related spend\nwas on long-lived assets that will support monetization over the next 15\nyears and beyond. The remaining cloud and AI spend was primarily for\nservers, both CPUs and GPUs, to serve customers based on demand signals,\nincluding our customer contracted backlog of $315 billion.\n\nCash flow from operations was $37 billion, up 16%, driven by strong cloud\nbillings and collections, partially offset by higher tax payments. And this\nquarter, free cash flow was $20.3 billion.\n\nOther income and expense was negative $623 million, more favorable than\nanticipated, primarily due to net gains on derivatives and investments. Our\nlosses on investments accounted for under the equity method were slightly\nhigher than expected. Our effective tax rate was approximately 18%. And\nfinally, we returned $9.7 billion to shareholders through dividends and\nshare repurchases, an increase of 15% year-over-year.\n\nNow moving to our Q4 outlook, which unless specifically noted otherwise, is\non a U.S. dollar basis. First, through April, demand signals across our\ncommercial businesses as well as in LinkedIn, gaming and search have\nremained consistent. Our outlook assumes those trends continue in Q4. If\nthe environment changes, our results may be impacted.\n\nIn our Windows OEM business, our outlook assumes the elevated inventory\nlevels from Q3 will come down in Q4. We have widened our guidance range in\nour More Personal Computing segment to account for some of this\nvariability.\n\nNext, FX. With the weakening of the U.S. dollar in April, we now expect FX\nto increase total revenue growth by 1 point. Within the segments, we expect\nFX to increase revenue growth by 1 point in Productivity and Business\nProcesses and less than 1 point in Intelligent Cloud and More Personal\nComputing. We expect FX to increase COGS operating expense growth by less\nthan 1 point.\n\nIn commercial bookings, we expect solid growth on a significant prior year\ncomparable and a growing expiry base. Bookings growth will be driven by\nstrong execution across our core annuity sales motions and continued long-\nterm commitments to our platform. As a reminder, larger, longer-term Azure\ncontracts, which are more unpredictable in their timing, can drive\nincreased quarterly volatility in our bookings growth rate.\n\nMicrosoft Cloud gross margin percentage should be roughly 67%, down year-\nover-year, primarily driven by the impact of scaling our AI infrastructure.\n\nAnd now capital expenditures. We expect Q4 capital expenditures to increase\non a sequential basis. H2 CapEx in total remains unchanged from our January\nH2 guidance. As a reminder, there can be quarterly spend variability from\ncloud infrastructure build-outs and the timing of delivery of finance\nleases.\n\nNext, to segment guidance. In Productivity and Business Processes, we\nexpect revenue of USD 32.05 billion to USD 32.35 billion or growth of 11%\nto 12% in constant currency. M365 commercial cloud revenue growth should be\napproximately 14% in constant currency, relatively stable compared to the\nprior quarter. We expect continued ARPU growth through E5 and M365 Copilot\nand some steep growth moderation given the size of the installed base.\n\nM365 Commercial products revenue growth should be in the mid-single digits.\nAs a reminder, M365 commercial products includes both the Windows\ncommercial on-premises components of M365 suite and office transactional\npurchasing, both of which can be variable due to in-period revenue\nrecognition dynamics. M365 Consumer cloud revenue growth should be in the\nmid-teens, driven by the January price increase.\n\nFor LinkedIn, we expect revenue growth in the high single digits. And in\nDynamics 365, we expect revenue growth to be in the mid- to high teens with\ncontinued growth across all workloads.\n\nFor Intelligent Cloud, we expect revenue of USD 28.75 billion to USD 29.05\nbillion or growth of 20% to 22% in constant currency. Revenue will continue\nto be driven by Azure, which, as a reminder, can have quarterly variability\nprimarily from in-period revenue recognition depending on the mix of\ncontracts.\n\nIn Azure, we expect Q4 revenue growth to be between 34% and 35% in constant\ncurrency, driven by strong demand for our portfolio of services. In our non-\nAI services, we expect focused execution to continue, driving healthy\ngrowth. And in our AI services, while we continue to bring data center\ncapacity online as planned, demand is growing a bit faster. Therefore, we\nnow expect to have some AI capacity constraints beyond June.\n\nIn our on-premises server business, we again expect revenue to decline in\nthe mid-single digits with the ongoing customer shift to cloud offerings.\n\nAnd in Enterprise and Partner Services, we expect revenue growth to be in\nthe mid- to high single digits, driven by Enterprise Support Services.\n\nIn More Personal Computing, we expect revenue to be USD 12.35 billion to\nUSD 12.85 billion. Windows OEM and devices revenue should decline in the\nmid- to high single digits. We expect Windows OEM revenue to decline in the\nlow to mid-single digits assuming OEM inventory levels come down through\nthe quarter as noted earlier, although the range of potential outcomes is\nwider than normal. Devices revenue should decline in the high teens.\n\nSearch and news advertising ex TAC revenue growth should be in the high\nteens, even on a strong prior year comparable. We expect to see continued\ngrowth in both volume and revenue per search with share gains across Edge\nand Bing. Overall, search and news advertising revenue growth should be in\nthe mid-teens.\n\nAnd in gaming, we expect revenue growth to be in the mid-single digits. We\nexpect Xbox content and services revenue growth to be in the high single\ndigits, driven by first-party content.\n\nNow back to company guidance. We expect COGS of USD 23.6 billion to USD\n23.8 billion or growth of 19% to 20% in constant currency. And operating\nexpense of USD 18 billion to USD 18.1 billion or growth of approximately 5%\nin constant currency. Therefore, even with ongoing AI investments as we\nscale, we continue to expect full year FY '25 operating margins to be up\nslightly year-over-year. Other income and expense is expected to be roughly\nnegative $1.2 billion, primarily driven by investments accounted for under\nthe equity method. As a reminder, we do not recognize mark-to-market gains\nor losses on equity method investments. And lastly, we expect our Q4\neffective tax rate to be approximately 19%.\n\nNow I'd like to share some closing thoughts as we look to the next fiscal\nyear. We remain committed to investing against the strong demand signals we\nsee for our services. So as a reminder, our earlier comments on FY '26\ncapital expenditures remain unchanged. We expect CapEx to grow. It will\ngrow at a lower rate than FY '25 and will include a greater mix of short-\nlived assets, which are more directly correlated to revenue than long-lived\nassets. These investments along with focused execution that delivers near-\nterm value to our customers will ensure we continue to lead through the\ncloud and AI opportunity ahead.\n\nWith that, let's go to Q&A, Jonathan.\n\nJonathan NeilsonThanks, Amy. We'll now move over to Q&A. Out of respect to\nothers on the call, we request that participants please only ask one\nquestion.",
  "qa_text": "Operator\n\n[Operator Instructions] And our first question comes from the line of Keith\nWeiss with Morgan Stanley.\n\nKeith Weiss\nMorgan Stanley, Research Division\n\nCongratulations on a fantastic quarter. And what all of us are looking at\nas a difficult environment, a lot of uncertainty out there, so really\nimpressive to put up the results that you guys did. One of the things that\nwe heard a lot about this quarter in the media and press reports was\nchanging data center commitments, maybe Microsoft walking away from some of\nthose data center commitments. But it sounds like the AI demand is very\nstrong. You're talking about not being able to hit all of that demand with\nthe supply. So can you talk to us about what's going on with your data\ncenter strategy? Are there any shifts taking place?\n\nAnd maybe in particular, Satya, you could talk about some of the comments\nthat you had made about the potential risk for oversupplies and GPUs out in\nthe future. What exactly was that risk you were talking about? And are you\nincorporating that risk into your data center strategy?\n\nSatya Nadella\nChairman & CEO\n\nYes. First of all, thanks, Keith, for the question. The reality is we've\nalways been making adjustments to build, lease, what pace we build all\nthrough the last 10, 15 years, it's just that you all pay a lot more\nattention to what we do quarter-over-quarter nowadays.\n\nHaving said that, the key thing for us is to have our builds and lease be\npositioned for what is the workload growth of the future, right? So that's\nwhat you have to [ goal ] seek to. So there's a demand part to it, there is\nthe shape of the workload part to it, and there is a location part to it.\nSo you don't want to be upside down on having one big data center in one\nregion when you have a global demand footprint. You don't want to be upside\ndown when the shape of demand changes because, after all, with essentially\npretraining plus test-time compute, that's a big change in terms of how you\nthink about even what is training, right, forget inferencing.\n\nSo fundamentally, given all of that, and then every time there's great\nMoore's Law, but remember, this is a compounding sort of S-curve, right,\nwhich is there's Moore's Law, there's system software, there's model\narchitecture changes, there's the app server efficiency. Given all of that,\nwe just want to make sure we're building accounting for the latest and\ngreatest sort of information we have on all of that. And that's what you\nsee reflected, and I feel very, very good about the pace. In fact, Amy just\nmentioned, we will be short power. And so therefore -- but it's not a\nblanket statement. I need power in specific places so that we can either\nlease or build at the pace at which we want. And so that's the sort of plan\nthat we're executing to.\n\nMaybe, Amy, you can add to that.\n\nAmy E. Hood\nExecutive VP & CFO\n\nYes, maybe just add a little bit to Satya's comments. Just a reminder,\nthese are very long lead time decisions. From land to build to build-outs\ncan be lead times of 5 to 7 years, 2 to 3 years. So we're constantly in a\nbalancing position as we watch demand curves and many of the things Satya\nwatch.\n\nAnd the second part is just to maybe remind you, when Satya talks about\nbeing short power, he's really talking about data center space. And so\nwe've continued through the second half to put things in place. In fact, we\ntalked a little bit about pulling even some of that space to be ready\nearlier and being able to deliver that earlier to customers this quarter,\nwhich is really good work by the teams as we continue to get more and more\nefficient at that process. And I look forward to being able to continue to\ndo that in the future.\n\nI did talk about in my comments, we had hoped to be in balance by the end\nof Q4. We did see some increased demand as you saw through the quarter. So\nwe are going to be a little short still, say, a little tight as we exit the\nyear but are encouraged by that.\n\nOperator\n\nThe next question comes from the line of Brent Thill with Jefferies.\n\nBrent John Thill\nJefferies LLC, Research Division\n\nSatya, on your comment about accelerating demand for cloud migrations. I'm\ncurious if you could dig in and extrapolate a little more what you're\nseeing there.\n\nSatya Nadella\nChairman & CEO\n\nThanks, Brent. So yes -- so I sort of think about 3 big things that are\nhappening in the cloud all in parallel, and there's also a relationship\nbetween them. One is, I'll just say, the classic migration of whether it's\nSQL, Windows Server. And so that sort of again got good steady-state\nprogress because the reality is, I think everyone is now, perhaps there's\nanother sort of kick in the data center migrations just because of the\nefficiency the cloud provides. So that's sort of one part.\n\nThe second piece is good data growth. You saw some -- like Postgres on\nAzure -- I mean, forgetting even SQL server, Postgres on Azure is growing.\nCosmos is growing. The analytics stuff I talked about with Fabric. It's\neven the others, whether it is Databricks or even Snowflake on Azure are\ngrowing. So we feel very good about Fabric growth and our data growth. Then\nthe cloud-native growth. So this is again before we even get to AI, some of\nthe core compute consumption of cloud-native players is also pretty very\nhealthy. It was healthy throughout the quarter. We projected to go moving\nforward as well.\n\nThen the thing to notice is the ratio, and I think we mentioned this\nmultiple times before, if you look underneath even ChatGPT, in fact, that\nteam does a fantastic job of thinking about not only their growth in terms\nof AI accelerators they need, they use Cosmos DB, they use Postgres. They\nuse core compute and storage. And so there's even a ratio between any AI\nworkload in terms of AI accelerator to others.\n\nSo those are the 4 pockets, I'd say, or 4 different trend lines, which all\nhave a relationship with each other. And if I step back, and Amy and I talk\na lot about this, this time around, there's nothing certain for sure in the\nfuture, except for one thing, which is our largest business is our\ninfrastructure business. And the good news here is the next big platform\nshift builds on that. So it's not a complete rebuild, having gone through\nall these platform shifts where you have to come out on the other side with\na full rebuild. If there is good news here is that we have a good business\nin Azure that continues to grow and the new platform depends on that. So we\nwant to stay disciplined and execute super well on that.\n\nOperator\n\nThe next question comes from the line of Mark Moerdler with Bernstein\nResearch.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nI will reiterate what my peers have said. Congratulations on the great\nquarter. Satya and Amy, Microsoft is a very different business than it was\nduring the last recession. Incredible job you've done. If we get into a\nrecession, I hope we don't, how do you think about the stability, the\nsustainability, revenue volatility of Microsoft today if we were to get\ninto a recession? Would the business react early to a recession or late?\nWould a recession have a more shallow impact on revenue? Any thoughts would\nbe appreciated.\n\nSatya Nadella\nChairman & CEO\n\nMaybe I'll start, and then Amy should add, Mark. The way at least I think\nwe will approach it is, quite frankly, be very focused on how we help our\ncustomers if there is any turbulence in the macro because one of the things\nthat we feel we can do just because of the efficiencies of the cloud and\nthe footprint we have and the differentiated sort of layers of the stack\nfrom the SaaS application side to the infrastructure side. I think if you\nsort of buy into the argument that software is the most valuable resource\nwe have to fight any type of inflationary pressure or any type of growth\npressure where you need to do more with less, I think we can be super\nhelpful in that. And so if anything, we would probably have more of that\nmindset is how do we make sure we are helping our customers. And then, of\ncourse, we'll look to share gains.\n\nOperator\n\nThe next question comes from the line of Karl Keirstead with UBS.\n\nKarl Emil Keirstead\nUBS Investment Bank, Research Division\n\nA number of metrics to applaud, but I think the one that stands out to me\nis the 16-point growth rate lift to Azure from AI. Satya and Amy, I just\nwanted to ask if you could unpack that a little bit. Of course, you\nmentioned that you got a bit of a kicker from capacity coming online. But\nI'm a little bit more interested in where the demand came in above\nexpectations, like what workload type? It's hard for us to see that on the\noutside. Was it a surge in ChatGPT inference that landed in Azure? Was it\nan uptick in enterprise AI adoption? And Amy, do you think that 16 points\ncould be higher in June?\n\nAmy E. Hood\nExecutive VP & CFO\n\nThanks, Karl, for the question. Just to provide some clarity because I\nthink your question implies something that we didn't mean to imply on the\ncall. First, the real outperformance in Azure this quarter was in our non-\nAI business. So then to talk about the AI business, really, what was better\nwas precisely what we said. We talked about this. We knew Q3 that we had\nand hadn't really match supply and demand pretty carefully and so didn't\nexpect to do much better than we had guided to on the AI side. We've been\nquite consistent on that.\n\nSo the only real upside we saw on the AI side of the business was that we\nwere able to deliver supply early to a number of customers. And being able\nto do that throughout the quarter creates quite a good benefit to us. But\nthe majority of our outperformance versus where we had expected to be was\non the non-AI piece of the business.\n\nOperator\n\nThe next question comes from the line of Kash Rangan with Goldman Sachs.\n\nKasthuri Gopalan Rangan\nGoldman Sachs Group, Inc., Research Division\n\nOne question for Amy. You've said in the past that you can attain better\nand better capital efficiency with the cloud business and probably cloud\nand AI business. Where do you stand today, Amy, and maybe Satya you can\nopine as well, that you've said before that you can slow down your CapEx\ngrowth rate while still accelerate Azure, which includes AI? Can we get a\nmark-to-market on that?\n\nAmy E. Hood\nExecutive VP & CFO\n\nMaybe I'll start, Kash, and let talk Satya add on, because I really think\nwhen you go back and read some of Satya's comments on how the S-curves\nbuild on themselves, that's actually the levers that go into the answer of\nthe question that you're asking. And so the way, of course, you've seen\nthat historically is right when we went through the prior cloud\ntransitions, you see CapEx accelerate, you build out data center\nfootprint.,, You slowly filled GPU capacity. And over time, you see\nsoftware efficiencies and hardware efficiencies build on themselves. And\nyou saw that process for us for goodness now quite a long time.\n\nAnd what Satya's talking about is how quickly that's happening on the AI\nside of the business and you add to that model diversity. So think about\nthe same levers plus model efficiency, those compounds. Now the one thing\nthat's a little different this time is just the pace. And so when you're\nseeing that happen, pace in terms of efficiency side, but also pace in\nterms of the build-out. So it can mask some of the progress. But we are\nworking hard across all of the teams, hardware, software, even the build\nteams to get things in place as quickly as possible, dock to live times,\nall of that is improving and all of that actually is benefiting us. And\nI'll go ahead and say our margins on the AI side of the business are better\nthan they were at this point by far than when we went through the same\ntransition and the server to cloud transition.\n\nSatya Nadella\nChairman & CEO\n\nYes. I mean I think at a macro level, I think the way to think about this\nis you can ask the question, what's the difference between a hosting\nbusiness and a hyperscale business? It's software. That's, I think, the\ngist of it. Yes, for sure, it's a capital-intensive business, but capital\nefficiency comes from that system-wide software optimization. And that's\nwhat makes the hyperscale business attractive and that's what we want to\njust keep executing super well on.\n\nOperator\n\nThe next question comes from the line of Mark Murphy with JPMorgan.\n\nMark Ronald Murphy\nJPMorgan Chase & Co, Research Division\n\nSatya, you had commented recently that the DeepSeek moment is a real thing.\nAnd you had said that software efficiencies mean that the fleet will be\naged for a longer time. Can you comment on how those advances are affecting\nthe pace and volume of AI experimentation and activity in the marketplace?\nAnd Amy, could we start to consider the possibility that software\nenhancements might extend the useful life assumption that you're using for\nGPUs? Is it a little premature to be thinking that way?\n\nSatya Nadella\nChairman & CEO\n\nYes. First of all, I think some of the work that actually OpenAI first\npioneered indeed with all other reasoning models. And of course, DeepSeek\nhas sort of added to it and done good work as well and others as well. The\nidea that you can have test-time compute plus pre-training and then some of\nthe great optimization at inference time that has all happened has proven\nup. I mean if you look at -- I would say, for every Moore's Law change and\nmovement, there's probably a 10x improvement because of software, right?\nThat's sort of what's happening with these models.\n\nSome of it comes from model architecture, some of that comes from data\nefficiency, compute efficiency and what have you. So that's what we are\nwriting. And we feel that, all-up, when you have a commodity that is\ngetting that better, then the question is how do you build out a fleet\nthat's super balanced so that then the workloads can be built and can, in\nfact, take advantage of that efficiency and the underlying infrastructure.\nI mean it's kind of like virtualization. What is the difference between\nservers and sort of, again, client-server with virtualization? It was\nefficiency. What is the difference between virtualization and cloud? It was\nefficiency. What is the difference between this generation of cloud and AI?\nIt's efficiency. So the more you can kind of continue to think about\nsoftware driving that efficiency is what drives demand ultimately.\n\nAmy E. Hood\nExecutive VP & CFO\n\nAnd to your specific question, in terms of thinking about the depreciable\nlife of an asset, we like to have a long history before we make any of\nthose changes. So we're focused on getting every bit of useful life we can,\nof course, out of assets. But to Satya's point, that tends to be a software\nquestion more than a hardware one.\n\nOperator\n\nThe next question comes from the line of Kirk Materne with Evercore ISI.\n\nKirk Materne\nEvercore ISI Institutional Equities, Research Division\n\nCongrats on a great quarter. Amy, you mentioned that the upside on Azure\ncame from the non-AI services this time around. I was wondering if you\ncould just talk a little bit more about that. And I guess as you look\nforward, maybe what's different this go around versus what we saw a few\nyears ago when obviously, things like optimization weighed on the growth a\nlittle bit. It sounds like the product portfolio is much broader right now.\nBut just wondering if you could add some color on that front.\n\nAmy E. Hood\nExecutive VP & CFO\n\nSure. And thanks for the question, Kirk. If we go to non-AI, I talked a\nlittle bit about this. In general, we saw better-than-expected performance\nacross our segments, but we saw acceleration in our largest customers. We\ncall that the Enterprise segment in general. And then in what we talked\nabout of our scale motions, where we had some challenges in Q2, things were\na little better. And we still have some work to do in our scale motions,\nand we're encouraged by our progress. We're excited to stay focused on that\nas, of course, we work through the final quarter of our fiscal year.\n\nBy geo, the performance was pretty consistent. Satya actually highlighted\nsome of the workloads that came in a little better than we thought.\nObviously, just some good consistent work on migrations, good execution by\nthe sales and partner teams, the data workloads he went through. And so in\ngeneral, Kirk, I wouldn't say it's anything beyond that. I do think it was\nimproved execution. And I was happy to see it, but there's still some work\nto do on our scale motions, in particular.\n\nJonathan Neilson\n\nOperator, we have time for one last question.\n\nOperator\n\nThe last question will come from the line of Alex Zukin with Wolfe\nResearch.\n\nAleksandr J. Zukin\nWolfe Research, LLC\n\nAnd again, just amazing congratulations on those Azure numbers, which I\nthink are quite honestly, just inspiring. So maybe, Amy, to the point that\nyou're making that the surprise factor was on the non-Azure -- non-AI side\nof the house. And it sounds like there's confidence in that continuing\nbeyond. How much of that are you starting to see the pull in of the non-AI\ndriven by the AI portion of Azure? And on the AI portion specifically, as\ntest-time compute really just blows out kind of prior conceptions of\nscaling law challenges, how much does that change potentially the curve of\nthe AI Azure growth as you go forward here over the next few quarters?\n\nAmy E. Hood\nExecutive VP & CFO\n\nThanks, Alex. Let me first of all say, I think we've talked about this\nquite a bit, it's always a good chance to get to iterate this. It's getting\nharder and harder to separate what an AI workload is from a non-AI\nworkload. And we've talked about it this way. I think in most instances, to\nmake sure people understood that when we were accelerating all of our CapEx\nspend over the past 2.5 or 3 years now, that people had confidence that we\nwere turning that into revenue and product in a way that was transparent\nand that everyone could understand really the goals that we have set for\nourselves and for our partners and customers in terms of building product\nthat turned to revenue.\n\nBut if you take a step back from that, it's that these workloads are being\nbuilt, GPU, CPU, storage, network, all the same things. And so I think\nreally what we're talking about is really how Satya talked about in one of\nthe earlier questions, we're seeing digital natives. Digital natives build\nworkloads. They do AI work. They do non-AI work. Do they tend to do that\nwork in the same cloud? Lots of times. Sometimes it all in the same place,\nnot all the time, but that relationship gets stronger and stronger as\npeople pivot to more of AI-heavy workloads. And so I think you're starting\nto see some of that relationship. I think we'll continue to see that as AI\nworkloads continue to get built and experimented with and proof of concepts\nget expanded.\n\nAnd so I think I mostly focus on the fact that together, we saw good\nperformance in Q3 on Azure. As you're inclusive of both components, in\nterms of our execution, in terms of the skilled and partner teams and\nbacklog and conversion and interesting workloads and adding customer value\nand solving real problems and adding real value. And I think that's\nprobably, Alex, how I would approach that number more than trying to\nseparate it in the way that even we have talked about it, but for very\ndifferent reasons.\n\nJonathan Neilson\n\nThat wraps up the Q&A portion of today's earnings call. Thank you for\njoining us today, and we look forward to speaking with you all soon.\n\nSatya Nadella\nChairman & CEO\n\nThank you.\n\nAmy E. Hood\nExecutive VP & CFO\n\nThank you.\n\nOperatorThis concludes today's conference. You may disconnect your lines at\nthis time, and enjoy the rest of your day.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Microsoft Corporation NasdaqGS:MSFT FQ3 2025 Earnings Call Transcripts Wednesday, April 30, 2025 9:30 PM GMT S&P Global Market Intelligence Estimates Presentation",
      "role_category": "Unknown"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Greetings, and welcome to the Microsoft Fiscal Year 2025 Third Quarter Earnings Conference Call. [Operator Instructions] As a reminder, this conference is being recorded. It is now my pleasure to introduce Jonathan Neilson, Vice President of Investor Relations. Please go ahead. Jonathan Neilson Good afternoon, and thank you for joining us today. On the call with me are Satya Nadella, Chairman and Chief Executive Officer; Amy Hood, Chief Financial Officer; Alice Jolla, Chief Accounting Officer; and Keith Dolliver, Corporate Secretary and Deputy General Counsel. On the Microsoft Investor Relations website, you can find our earnings press release and financial summary slide deck, which is intended to supplement our prepared remarks during today's call and provides a reconciliation of differences between GAAP and non-GAAP financial measures. More detailed outlook slides will be available on the Microsoft Investor Relations website when we provide outlook commentary on today's call. On this call, we will discuss certain non-GAAP items, the non-GAAP financial measures provided should not be considered as a substitute for or superior to the measures of financial performance prepared in accordance with GAAP. They are included as additional clarifying items to aid investors in further understanding the company's third quarter performance in addition to the impact these items and events have on the financial results. All growth comparisons we make on the call today relate to the corresponding period of last year, unless otherwise noted. We will also provide growth rates in constant currency when available as a framework for assessing how our underlying business performed, excluding the effect of foreign currency rate fluctuations. Where growth rates are the same in constant currency, we will refer to the growth rate only. We will post our prepared remarks to our website immediately following the call until the complete transcript is available. Today's call is being webcast live and recorded. If you ask a question, it will be included in our live transmission, in the transcript and in any future use of the recording. You can replay the call and view the transcript on the Microsoft Investor Relations website. During this call, we will be making forward-looking statements, which are predictions, projections or other statements about future events. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could materially differ because of factors discussed in today's earnings press release, in the comments made during this conference call and in the Risk Factors section of our Form 10-K, Form 10-Q and other reports and filings with the Securities and Exchange Commission. We do not undertake any duty to update any forward-looking statement. And with that, I'll turn the call over to Satya.",
      "role_category": "Operator"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Thank you, Jonathan. It was a record quarter, driven by continued strength of Microsoft Cloud, which surpassed $42 billion in revenue, up 22% in constant currency. Cloud and AI are the essential inputs for every business to expand output, reduce costs and accelerate growth. Now I'll highlight examples starting with infrastructure. We continue to expand our data center capacity. This quarter alone, we opened DCs in 10 countries across 4 continents. Model capabilities are doubling in performance every 6 months, thanks to multiple compounding scaling laws. We continue to optimize and drive efficiencies across every layer, from DC design to hardware and silicon to system software to model optimization, all towards lowering costs and increasing performance. You see this in our supply chain where we have reduced dock to lead times for new GPUs by nearly 20% across our blended fleet where we have increased AI performance by nearly 30% ISO power and our cost per token, which has more than halved. When it comes to cloud migrations, we saw accelerating demand with customers in every industry, from Abercrombie in French, to Coca-Cola and ServiceNow expanding their footprints on Azure. And we remain the cloud of choice for customers' mission-critical VMware, SAP and Oracle workloads with more regional availability than any other hyperscaler. We're also excited about the next frontier in cloud systems with Quantum. In addition to putting our quantum stack on machines from our partners, we're also making real progress on a path to a utility-scale quantum computer with the introduction of Majorana 1. When it comes to data and analytics, we have deeply integrated our AI platform with our data stack. PostgreSQL usage accelerated for the third consecutive quarter, and it is now used by nearly 60% of the Fortune 500, including companies like BMW and BNY Mellon. Cosmos DB revenue growth also accelerated again this quarter and remains the go-to database for globally distributed NoSQL workloads at any scale. It is used by customers in every industry like CarMax, DocuSign, NTT DATA and OpenAI. This quarter, we also saw analytics consumption accelerate. Microsoft Fabric has more than 21,000 paid customers, up 80% year-over-year. Fabric brings together data workloads like data warehousing, data science, real- time intelligence, along with Power BI into one end-to-end solution. Real- time intelligence is now the fastest-growing workload in Fabric with 40% of customers already using it in just 5 months since becoming generally available, all up more than 50% of Fabric customers like Amorepacific, Louisiana State Government and Petrobras use 3 or more workloads. And the amount of data in our multi-cloud data lake, OneLake, has grown more than 6x over the past year. Now on to AI platform and tools. Foundry is the agent in AI app factory. It's now used by developers at over 70,000 enterprises and digital natives from Atomicwork to Epic, Fujitsu and Gainsight to H&R Block and LG Electronics to design, customize and manage their AI apps and agents. We processed over 100 trillion tokens this quarter, up 5x year-over-year, including a record 50 trillion tokens last month alone. And 4 months in, over 10,000 organizations have used our new agent service to build, deploy and scale their agents. This quarter, we also made a new suite of fine-tuning tools available to customers with industry-leading reliability, and we brought the latest models from OpenAI along with new models from Cohere, DeepSeek, Meta, Mistral, Stability to Foundry. And we've expanded our 5 family of SLMs with new multimodal and mini models. All-up, Phi has been downloaded 38 million times. And our research teams are taking it one step further with BitNet b1.58, a billion parameter, large language model that can run on just CPUs coming to the Foundry. Now on to developer tools. We're evolving GitHub Copilot from paired to peer programmer with agent mode in VS Code, Copilot can now iterate on code, recognize errors and fix them automatically. This adds to other Copilot agents like Autofix, which helps developers remediate vulnerabilities as well as code review agent, which has already reviewed over 8 million pull requests. And we are previewing a first-of-its-kind SWE- agent capable of asynchronously executing developer tasks. All-up, we now have over 15 million GitHub Copilot users, up over 4x year-over-year. And both digital natives like Twilio and enterprises like Cisco, HPE, Skyscanner and Target continue to choose GitHub Copilot to their developers with AI throughout the entire dev life cycle. With Visual Studio and VS Code, we have the world's most popular editor with over 50 million monthly active users. And with Power Platform, we have the leading low-code platform for AI makers, too. We now have 56 million monthly active Power Platform users, up 27% year-over-year, who increasingly use our AI features to build apps and automate processes. Now on to future of work. Microsoft 365 Copilot is built to facilitate human agent collaboration, hundreds of thousands of customers across geographies and industries now use Copilot, up 3x year-over-year. Our overall deal size continues to grow. In this quarter, we saw a record number of customers returning to buy more seats. And we're going further. Just last week, we announced a major update, bringing together agents, notebooks, search and create into a new scaffolding for work. Our new researcher and analyst deep reasoning agents analyze vast amounts of web and enterprise data to deliver highly skilled expertise on demand directly within Copilot. Beyond horizontal knowledge work, we are introducing agents for every role and business process. Our sales agent turns contacts into qualified leads and with sales chat reps can quickly get up to speed on new accounts. And our customer service agent is deflecting customer inquiries and helping service reps resolve issues faster. With Copilot Studio, customers can extend Copilot and build their own agents with no code, low code. More than 230,000 organizations, including 90% of the Fortune 500 have already used Copilot Studio. With deep reasoning and agent flows in Copilot Studio, customers can build agents that perform more complex tasks and also handle deterministic scenarios like document processing and financial approvals. And they can now build Computer Use Agents that take action on the UI across desktop and web apps. And with just a click, they can turn any SharePoint site into an agent, too. This quarter alone, customers created over 1 million custom agents across SharePoint and Copilot Studio, up 130% quarter-over-quarter. When it comes to business applications, Dynamics 365 again took share as companies like Avaya, Brunswick, Softcat switched to Dynamics from legacy providers. Verizon, for example, chose Dynamics 365 Sales to improve the efficiency of its sellers. In healthcare, Dragon Copilot is off to a fast start. Last quarter alone, we helped document nearly 9.5 million physician-patient encounters at providers like City of Hope, Ottawa Hospital, Tufts Medicine and Wellstar, up over 50% quarter-over-quarter. In manufacturing, we introduced factory operations and safety agents at Hannover Messe. And leading partners like Autodesk, PTC and Siemens have all built their own industrial AI solutions on our stack. And in retail, we have introduced agents to help customers like Bath & Body Works, build more personalized shopping experience and improve store operations. When it comes to Windows, Copilot+ PCs are faster and have better battery life than any other device in their category. We also continue to win new customers with best-in-class AI capabilities. We offer a growing number of AI apps from partners like Adobe, Canva and Zoom. Just last week, we rolled out exclusive AI experiences like Recall, Click to Do and Windows Search to all Copilot+ PCs. And we continue to see increased commercial traction as we approach end of support for Windows 10. Windows 11 commercial deployments increased nearly 75% year-over-year. Now on to security. Security is our top priority, and we have made significant progress against the engineering objectives we outlined 1.5 years ago as part of our Secure Future Initiative. We are now applying these learnings to deliver new innovation across our platform. Last month, along with our partners, we introduced Security Copilot agents to help Defenders autonomously handle high-volume security and IT tasks informed by 84 trillion daily threat signals. We also added new capabilities to Defender, Entra and Purview to help organizations secure and govern their AI deployments. All-up, we now have 1.4 million security customers, over 900,000, including EY Global, ManpowerGroup, TriNet, Regions Bank have 4 or more workloads, up 21% year-over-year. And in identity, Entra now has more than 900 million monthly active users. Now on to our consumer businesses, starting with LinkedIn. Over 1 billion professionals use LinkedIn to connect, learn, hire and sell, and our membership continues to grow at double digits year-over-year. Time spent watching videos on the platform was up 36% and comments were up 32% year- over-year. We're also seeing more members use AI to gain new skills and find jobs. The number of learners who have used AI-powered coaching increased over 2x quarter-over-quarter, and we remain the market leader in hiring as customers like Equinix and Verizon use LinkedIn Hiring Assistant to find qualified candidates faster. When it comes to LinkedIn Premium, we saw 75% quarter-over-quarter subscriber growth to our premium pages offering for SMBs. And LinkedIn Marketing Solution continues to be the best way to reach B2B decision-makers with 2 consecutive quarters of accelerated revenue growth. More broadly, when it comes to advertising, we are transforming our people's search, browse, discover content and use AI as a personal assistant. With Copilot Search in Bing, we are reimagining search results with overview pages curated by AI and embedded conversational capabilities. With Copilot Vision and Edge, Copilot sees what you see and gives you real- time responses while you browse. With Copilot Discover, we are personalizing MSN experience based on user interactions and preferences. And with our updated Copilot app, we are focused on building daily engagement and successful sessions across a range of modalities, whether it is conversing, searching, shopping or travel planning. All-up, we again took share across Bing and Edge, and our total advertising revenue across our businesses has surpassed $20 billion over the past 12 months. Now on to gaming. We continue to transform the business and focus on margin expansion as we bring our games to over 500 million monthly active users across devices. We ended the quarter as the top publisher by preorders and pre-installs on both Xbox and PlayStation store. PC Game Pass revenue increased over 45% year-over-year. With Xbox Play Anywhere, players now can access more than 1,000 games they can play across console and PC. And just last week, we brought cloud gaming to LG TVs. Cloud gaming set a new record, surpassing 150 million hours played for the first time this quarter. We are also integrating AI across the Xbox. New Copilot for Gaming is a personalized gaming companion that provides in-game assistance and expert coaching. And our first-of-its-kind Muse model can generate gameplay in real time. Finally, it's fantastic to see the success of the Minecraft movie, which is the top-grossing film of the year. In addition to monetizing our IP in new ways, we have seen a 75% plus increase in weekly active users of the game year-over-year since the release. In closing, we are rapidly innovating to expand our opportunity across both consumer and commercial businesses. In just a few weeks at our Build conference, we'll share how we are creating the most powerful platform for developers and I encourage you to tune in. With that, let me turn it over to Amy.",
      "role_category": "Executive"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Thank you, Satya, and good afternoon, everyone. This quarter, revenue was $70.1 billion, up 13% and 15% in constant currency. Gross margin dollars increased 11% and 13% in constant currency, while operating income increased 16% and 19% in constant currency. And earnings per share was $3.46, an increase of 18% and 19% in constant currency. Results exceeded expectations driven by focused execution from our sales and partner teams. We continue to see strong demand for our cloud and AI offerings as they help customers drive productivity, increase efficiencies and grow their businesses. And again, this quarter, revenue from our AI business was above expectations. Commercial bookings increased 18% and 17% in constant currency, significantly ahead of expectations again this quarter, driven by an Azure commitment from OpenAI. We also saw consistent execution across our core annuity sales motions and continued long-term commitments to our platform. Commercial remaining performance obligation increased to $315 billion, up 34% and 33% in constant currency. Roughly 40% will be recognized in revenue in the next 12 months, up 17% year-over-year. The remaining portion recognized beyond the next 12 months increased 47%. And this quarter, our annuity mix was 98%. FX was roughly in line with expectations on total company revenue, segment level revenue and operating expense growth. FX decreased COGS growth by only 1 point, 1 point unfavorable to expectations. Microsoft Cloud revenue was $42.4 billion, ahead of expectations and grew 20% and 22% in constant currency. Microsoft Cloud gross margin percentage was 69%, in line with expectations and decreased 3 points year-over-year, driven by the impact of scaling our AI infrastructure. Company gross margin percentage was also 69%, down 1 point year-over-year, driven by scaling our AI infrastructure. Operating expenses increased 2% and 3% in constant currency, lower than expected due to our focus on cost efficiencies as well as investments that shifted to Q4. Operating margins increased 1 point year-over-year to 46%, better than expected as we continue to focus on building high-performing teams and increasing our agility by reducing layers with fewer managers. At a total company level, head count at the end of March was 2% higher than a year ago and was down slightly compared to last quarter. Now to our segment results. Revenue from Productivity and Business Processes was $29.9 billion and grew 10% and 13% in constant currency, ahead of expectations, driven by LinkedIn, Microsoft 365 Commercial products, and Microsoft 365 Consumer. M365 commercial cloud revenue increased 12% and 15% in constant currency, in line with expectations. ARPU growth was again driven by E5 and M365 Copilot. With M365 Copilot, we continue to see growth across customer segments and geos. Paid M365 Commercial seats grew 7% year-over-year to over $430 million. While we continue to see installed base expansion across all segments, growth was primarily driven by our small and medium business and frontline worker offerings. M365 Commercial products revenue increased 5% and 8% in constant currency, ahead of expectations due to higher-than-expected office transactional purchasing. M365 consumer cloud revenue increased 10% and 12% in constant currency, ahead of expectations, driven by higher-than-expected subscription growth following the January price increase. M365 Consumer subscriptions grew 9% to $87.7 million. LinkedIn revenue increased 7% and 8% in constant currency. Results were ahead of expectations due to better-than-expected performance across all businesses. The Talent Solutions business continues to be impacted by weakness in the hiring market. Dynamics 365 revenue increased 16% and 18% in constant currency, in line with expectations with continued growth across all workloads. Segment gross margin dollars increased 10% and 13% in constant currency, and gross margin percentage was relatively unchanged year-over- year even with the impact of scaling our AI infrastructure. Operating expenses increased 1% and 2% in constant currency. And operating income increased 15% and 18% in constant currency. Next, the Intelligent Cloud segment. Revenue was $26.8 billion and grew 21% and 22% in constant currency, ahead of expectations, driven by Azure. In Azure and other cloud services, revenue grew 33% and 35% in constant currency, including 16 points from AI services. Focused execution drove non- AI services results, where we saw accelerated growth in our Enterprise customer segment as well as some improvement in our scale motions. And in Azure AI services, we brought capacity online faster than expected. In our on-premises server business, revenue decreased 6% and 4% in constant currency, slightly below expectations, driven by renewals with lower in- period revenue recognition from the mix of contracts. The year-over-year decline is reflective of the continued customer shift to cloud offerings. Enterprise and Partner Services revenue increased 5% and 6% in constant currency, slightly ahead of expectations due to better-than-expected performance in Enterprise Support Services. Segment gross margin dollars increased 13% and 14% in constant currency, and gross margin percentage decreased 4 points year-over-year, driven by scaling our AI infrastructure. Operating expenses increased 6% and 7% in constant currency, and operating income grew 17% and 18% in constant currency. Now to More Personal Computing. Revenue was $13.4 billion and grew 6% and 7% in constant currency, ahead of expectations due to better-than-expected results across all businesses. Windows OEM and Devices revenue increased 3% year-over-year, ahead of expectations as tariffs uncertainty through the quarter resulted in inventory levels that remained elevated. Search and news advertising revenue ex TAC increased 21% and 23% in constant currency. Results were significantly ahead of expectations, driven by usage from a third-party partnership, better-than-expected rate expansion and volume growth across Edge and Bing. And in gaming, revenue increased 5% and 6% in constant currency. Xbox content and services revenue increased 8% and 9% in constant currency, ahead of expectations, driven by stronger-than-expected performance in third-party and first-party content. Segment gross margin dollars increased 9% and 11% in constant currency. Gross margin percentage increased 2 points year-over-year, driven by strong execution on margin improvement in search and gaming. Operating expenses increased 1%. Operating income increased 21% and 23% in constant currency, driven by continued prioritization of higher margin opportunities. Now back to total company results. Capital expenditures, including finance leases were $21.4 billion, slightly lower than expected due to normal variability from the timing of delivery of data center leases. Cash paid for PP&E was $16.7 billion, Roughly half of our cloud and AI-related spend was on long-lived assets that will support monetization over the next 15 years and beyond. The remaining cloud and AI spend was primarily for servers, both CPUs and GPUs, to serve customers based on demand signals, including our customer contracted backlog of $315 billion. Cash flow from operations was $37 billion, up 16%, driven by strong cloud billings and collections, partially offset by higher tax payments. And this quarter, free cash flow was $20.3 billion. Other income and expense was negative $623 million, more favorable than anticipated, primarily due to net gains on derivatives and investments. Our losses on investments accounted for under the equity method were slightly higher than expected. Our effective tax rate was approximately 18%. And finally, we returned $9.7 billion to shareholders through dividends and share repurchases, an increase of 15% year-over-year. Now moving to our Q4 outlook, which unless specifically noted otherwise, is on a U.S. dollar basis. First, through April, demand signals across our commercial businesses as well as in LinkedIn, gaming and search have remained consistent. Our outlook assumes those trends continue in Q4. If the environment changes, our results may be impacted. In our Windows OEM business, our outlook assumes the elevated inventory levels from Q3 will come down in Q4. We have widened our guidance range in our More Personal Computing segment to account for some of this variability. Next, FX. With the weakening of the U.S. dollar in April, we now expect FX to increase total revenue growth by 1 point. Within the segments, we expect FX to increase revenue growth by 1 point in Productivity and Business Processes and less than 1 point in Intelligent Cloud and More Personal Computing. We expect FX to increase COGS operating expense growth by less than 1 point. In commercial bookings, we expect solid growth on a significant prior year comparable and a growing expiry base. Bookings growth will be driven by strong execution across our core annuity sales motions and continued long- term commitments to our platform. As a reminder, larger, longer-term Azure contracts, which are more unpredictable in their timing, can drive increased quarterly volatility in our bookings growth rate. Microsoft Cloud gross margin percentage should be roughly 67%, down year- over-year, primarily driven by the impact of scaling our AI infrastructure. And now capital expenditures. We expect Q4 capital expenditures to increase on a sequential basis. H2 CapEx in total remains unchanged from our January H2 guidance. As a reminder, there can be quarterly spend variability from cloud infrastructure build-outs and the timing of delivery of finance leases. Next, to segment guidance. In Productivity and Business Processes, we expect revenue of USD 32.05 billion to USD 32.35 billion or growth of 11% to 12% in constant currency. M365 commercial cloud revenue growth should be approximately 14% in constant currency, relatively stable compared to the prior quarter. We expect continued ARPU growth through E5 and M365 Copilot and some steep growth moderation given the size of the installed base. M365 Commercial products revenue growth should be in the mid-single digits. As a reminder, M365 commercial products includes both the Windows commercial on-premises components of M365 suite and office transactional purchasing, both of which can be variable due to in-period revenue recognition dynamics. M365 Consumer cloud revenue growth should be in the mid-teens, driven by the January price increase. For LinkedIn, we expect revenue growth in the high single digits. And in Dynamics 365, we expect revenue growth to be in the mid- to high teens with continued growth across all workloads. For Intelligent Cloud, we expect revenue of USD 28.75 billion to USD 29.05 billion or growth of 20% to 22% in constant currency. Revenue will continue to be driven by Azure, which, as a reminder, can have quarterly variability primarily from in-period revenue recognition depending on the mix of contracts. In Azure, we expect Q4 revenue growth to be between 34% and 35% in constant currency, driven by strong demand for our portfolio of services. In our non- AI services, we expect focused execution to continue, driving healthy growth. And in our AI services, while we continue to bring data center capacity online as planned, demand is growing a bit faster. Therefore, we now expect to have some AI capacity constraints beyond June. In our on-premises server business, we again expect revenue to decline in the mid-single digits with the ongoing customer shift to cloud offerings. And in Enterprise and Partner Services, we expect revenue growth to be in the mid- to high single digits, driven by Enterprise Support Services. In More Personal Computing, we expect revenue to be USD 12.35 billion to USD 12.85 billion. Windows OEM and devices revenue should decline in the mid- to high single digits. We expect Windows OEM revenue to decline in the low to mid-single digits assuming OEM inventory levels come down through the quarter as noted earlier, although the range of potential outcomes is wider than normal. Devices revenue should decline in the high teens. Search and news advertising ex TAC revenue growth should be in the high teens, even on a strong prior year comparable. We expect to see continued growth in both volume and revenue per search with share gains across Edge and Bing. Overall, search and news advertising revenue growth should be in the mid-teens. And in gaming, we expect revenue growth to be in the mid-single digits. We expect Xbox content and services revenue growth to be in the high single digits, driven by first-party content. Now back to company guidance. We expect COGS of USD 23.6 billion to USD 23.8 billion or growth of 19% to 20% in constant currency. And operating expense of USD 18 billion to USD 18.1 billion or growth of approximately 5% in constant currency. Therefore, even with ongoing AI investments as we scale, we continue to expect full year FY '25 operating margins to be up slightly year-over-year. Other income and expense is expected to be roughly negative $1.2 billion, primarily driven by investments accounted for under the equity method. As a reminder, we do not recognize mark-to-market gains or losses on equity method investments. And lastly, we expect our Q4 effective tax rate to be approximately 19%. Now I'd like to share some closing thoughts as we look to the next fiscal year. We remain committed to investing against the strong demand signals we see for our services. So as a reminder, our earlier comments on FY '26 capital expenditures remain unchanged. We expect CapEx to grow. It will grow at a lower rate than FY '25 and will include a greater mix of short- lived assets, which are more directly correlated to revenue than long-lived assets. These investments along with focused execution that delivers near- term value to our customers will ensure we continue to lead through the cloud and AI opportunity ahead. With that, let's go to Q&A, Jonathan. Jonathan NeilsonThanks, Amy. We'll now move over to Q&A. Out of respect to others on the call, we request that participants please only ask one question. Question and Answer",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] And our first question comes from the line of Keith Weiss with Morgan Stanley.",
      "role_category": "Operator"
    },
    {
      "speaker": "Keith  Weiss",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Congratulations on a fantastic quarter. And what all of us are looking at as a difficult environment, a lot of uncertainty out there, so really impressive to put up the results that you guys did. One of the things that we heard a lot about this quarter in the media and press reports was changing data center commitments, maybe Microsoft walking away from some of those data center commitments. But it sounds like the AI demand is very strong. You're talking about not being able to hit all of that demand with the supply. So can you talk to us about what's going on with your data center strategy? Are there any shifts taking place? And maybe in particular, Satya, you could talk about some of the comments that you had made about the potential risk for oversupplies and GPUs out in the future. What exactly was that risk you were talking about? And are you incorporating that risk into your data center strategy?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Yes. First of all, thanks, Keith, for the question. The reality is we've always been making adjustments to build, lease, what pace we build all through the last 10, 15 years, it's just that you all pay a lot more attention to what we do quarter-over-quarter nowadays. Having said that, the key thing for us is to have our builds and lease be positioned for what is the workload growth of the future, right? So that's what you have to [ goal ] seek to. So there's a demand part to it, there is the shape of the workload part to it, and there is a location part to it. So you don't want to be upside down on having one big data center in one region when you have a global demand footprint. You don't want to be upside down when the shape of demand changes because, after all, with essentially pretraining plus test-time compute, that's a big change in terms of how you think about even what is training, right, forget inferencing. So fundamentally, given all of that, and then every time there's great Moore's Law, but remember, this is a compounding sort of S-curve, right, which is there's Moore's Law, there's system software, there's model architecture changes, there's the app server efficiency. Given all of that, we just want to make sure we're building accounting for the latest and greatest sort of information we have on all of that. And that's what you see reflected, and I feel very, very good about the pace. In fact, Amy just mentioned, we will be short power. And so therefore -- but it's not a blanket statement. I need power in specific places so that we can either lease or build at the pace at which we want. And so that's the sort of plan that we're executing to. Maybe, Amy, you can add to that.",
      "role_category": "Executive"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Yes, maybe just add a little bit to Satya's comments. Just a reminder, these are very long lead time decisions. From land to build to build-outs can be lead times of 5 to 7 years, 2 to 3 years. So we're constantly in a balancing position as we watch demand curves and many of the things Satya watch. And the second part is just to maybe remind you, when Satya talks about being short power, he's really talking about data center space. And so we've continued through the second half to put things in place. In fact, we talked a little bit about pulling even some of that space to be ready earlier and being able to deliver that earlier to customers this quarter, which is really good work by the teams as we continue to get more and more efficient at that process. And I look forward to being able to continue to do that in the future. I did talk about in my comments, we had hoped to be in balance by the end of Q4. We did see some increased demand as you saw through the quarter. So we are going to be a little short still, say, a little tight as we exit the year but are encouraged by that.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Brent Thill with Jefferies.",
      "role_category": "Operator"
    },
    {
      "speaker": "Brent John Thill",
      "role": "Jefferies LLC, Research Division",
      "text": "Jefferies LLC, Research Division Satya, on your comment about accelerating demand for cloud migrations. I'm curious if you could dig in and extrapolate a little more what you're seeing there.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Thanks, Brent. So yes -- so I sort of think about 3 big things that are happening in the cloud all in parallel, and there's also a relationship between them. One is, I'll just say, the classic migration of whether it's SQL, Windows Server. And so that sort of again got good steady-state progress because the reality is, I think everyone is now, perhaps there's another sort of kick in the data center migrations just because of the efficiency the cloud provides. So that's sort of one part. The second piece is good data growth. You saw some -- like Postgres on Azure -- I mean, forgetting even SQL server, Postgres on Azure is growing. Cosmos is growing. The analytics stuff I talked about with Fabric. It's even the others, whether it is Databricks or even Snowflake on Azure are growing. So we feel very good about Fabric growth and our data growth. Then the cloud-native growth. So this is again before we even get to AI, some of the core compute consumption of cloud-native players is also pretty very healthy. It was healthy throughout the quarter. We projected to go moving forward as well. Then the thing to notice is the ratio, and I think we mentioned this multiple times before, if you look underneath even ChatGPT, in fact, that team does a fantastic job of thinking about not only their growth in terms of AI accelerators they need, they use Cosmos DB, they use Postgres. They use core compute and storage. And so there's even a ratio between any AI workload in terms of AI accelerator to others. So those are the 4 pockets, I'd say, or 4 different trend lines, which all have a relationship with each other. And if I step back, and Amy and I talk a lot about this, this time around, there's nothing certain for sure in the future, except for one thing, which is our largest business is our infrastructure business. And the good news here is the next big platform shift builds on that. So it's not a complete rebuild, having gone through all these platform shifts where you have to come out on the other side with a full rebuild. If there is good news here is that we have a good business in Azure that continues to grow and the new platform depends on that. So we want to stay disciplined and execute super well on that.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Mark Moerdler with Bernstein Research.",
      "role_category": "Operator"
    },
    {
      "speaker": "Mark L. Moerdler",
      "role": "Sanford C. Bernstein & Co., LLC., Research Division",
      "text": "Sanford C. Bernstein & Co., LLC., Research Division I will reiterate what my peers have said. Congratulations on the great quarter. Satya and Amy, Microsoft is a very different business than it was during the last recession. Incredible job you've done. If we get into a recession, I hope we don't, how do you think about the stability, the sustainability, revenue volatility of Microsoft today if we were to get into a recession? Would the business react early to a recession or late? Would a recession have a more shallow impact on revenue? Any thoughts would be appreciated.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Maybe I'll start, and then Amy should add, Mark. The way at least I think we will approach it is, quite frankly, be very focused on how we help our customers if there is any turbulence in the macro because one of the things that we feel we can do just because of the efficiencies of the cloud and the footprint we have and the differentiated sort of layers of the stack from the SaaS application side to the infrastructure side. I think if you sort of buy into the argument that software is the most valuable resource we have to fight any type of inflationary pressure or any type of growth pressure where you need to do more with less, I think we can be super helpful in that. And so if anything, we would probably have more of that mindset is how do we make sure we are helping our customers. And then, of course, we'll look to share gains.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Karl Keirstead with UBS.",
      "role_category": "Operator"
    },
    {
      "speaker": "Karl Emil Keirstead",
      "role": "UBS Investment Bank, Research Division",
      "text": "UBS Investment Bank, Research Division A number of metrics to applaud, but I think the one that stands out to me is the 16-point growth rate lift to Azure from AI. Satya and Amy, I just wanted to ask if you could unpack that a little bit. Of course, you mentioned that you got a bit of a kicker from capacity coming online. But I'm a little bit more interested in where the demand came in above expectations, like what workload type? It's hard for us to see that on the outside. Was it a surge in ChatGPT inference that landed in Azure? Was it an uptick in enterprise AI adoption? And Amy, do you think that 16 points could be higher in June?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Thanks, Karl, for the question. Just to provide some clarity because I think your question implies something that we didn't mean to imply on the call. First, the real outperformance in Azure this quarter was in our non- AI business. So then to talk about the AI business, really, what was better was precisely what we said. We talked about this. We knew Q3 that we had and hadn't really match supply and demand pretty carefully and so didn't expect to do much better than we had guided to on the AI side. We've been quite consistent on that. So the only real upside we saw on the AI side of the business was that we were able to deliver supply early to a number of customers. And being able to do that throughout the quarter creates quite a good benefit to us. But the majority of our outperformance versus where we had expected to be was on the non-AI piece of the business.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Kash Rangan with Goldman Sachs.",
      "role_category": "Operator"
    },
    {
      "speaker": "Kasthuri Gopalan Rangan",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division One question for Amy. You've said in the past that you can attain better and better capital efficiency with the cloud business and probably cloud and AI business. Where do you stand today, Amy, and maybe Satya you can opine as well, that you've said before that you can slow down your CapEx growth rate while still accelerate Azure, which includes AI? Can we get a mark-to-market on that?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Maybe I'll start, Kash, and let talk Satya add on, because I really think when you go back and read some of Satya's comments on how the S-curves build on themselves, that's actually the levers that go into the answer of the question that you're asking. And so the way, of course, you've seen that historically is right when we went through the prior cloud transitions, you see CapEx accelerate, you build out data center footprint.,, You slowly filled GPU capacity. And over time, you see software efficiencies and hardware efficiencies build on themselves. And you saw that process for us for goodness now quite a long time. And what Satya's talking about is how quickly that's happening on the AI side of the business and you add to that model diversity. So think about the same levers plus model efficiency, those compounds. Now the one thing that's a little different this time is just the pace. And so when you're seeing that happen, pace in terms of efficiency side, but also pace in terms of the build-out. So it can mask some of the progress. But we are working hard across all of the teams, hardware, software, even the build teams to get things in place as quickly as possible, dock to live times, all of that is improving and all of that actually is benefiting us. And I'll go ahead and say our margins on the AI side of the business are better than they were at this point by far than when we went through the same transition and the server to cloud transition.",
      "role_category": "Executive"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Yes. I mean I think at a macro level, I think the way to think about this is you can ask the question, what's the difference between a hosting business and a hyperscale business? It's software. That's, I think, the gist of it. Yes, for sure, it's a capital-intensive business, but capital efficiency comes from that system-wide software optimization. And that's what makes the hyperscale business attractive and that's what we want to just keep executing super well on.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Mark Murphy with JPMorgan.",
      "role_category": "Operator"
    },
    {
      "speaker": "Mark Ronald Murphy",
      "role": "JPMorgan Chase & Co, Research Division",
      "text": "JPMorgan Chase & Co, Research Division Satya, you had commented recently that the DeepSeek moment is a real thing. And you had said that software efficiencies mean that the fleet will be aged for a longer time. Can you comment on how those advances are affecting the pace and volume of AI experimentation and activity in the marketplace? And Amy, could we start to consider the possibility that software enhancements might extend the useful life assumption that you're using for GPUs? Is it a little premature to be thinking that way?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Yes. First of all, I think some of the work that actually OpenAI first pioneered indeed with all other reasoning models. And of course, DeepSeek has sort of added to it and done good work as well and others as well. The idea that you can have test-time compute plus pre-training and then some of the great optimization at inference time that has all happened has proven up. I mean if you look at -- I would say, for every Moore's Law change and movement, there's probably a 10x improvement because of software, right? That's sort of what's happening with these models. Some of it comes from model architecture, some of that comes from data efficiency, compute efficiency and what have you. So that's what we are writing. And we feel that, all-up, when you have a commodity that is getting that better, then the question is how do you build out a fleet that's super balanced so that then the workloads can be built and can, in fact, take advantage of that efficiency and the underlying infrastructure. I mean it's kind of like virtualization. What is the difference between servers and sort of, again, client-server with virtualization? It was efficiency. What is the difference between virtualization and cloud? It was efficiency. What is the difference between this generation of cloud and AI? It's efficiency. So the more you can kind of continue to think about software driving that efficiency is what drives demand ultimately.",
      "role_category": "Executive"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO And to your specific question, in terms of thinking about the depreciable life of an asset, we like to have a long history before we make any of those changes. So we're focused on getting every bit of useful life we can, of course, out of assets. But to Satya's point, that tends to be a software question more than a hardware one.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Kirk Materne with Evercore ISI.",
      "role_category": "Operator"
    },
    {
      "speaker": "Kirk  Materne",
      "role": "Evercore ISI Institutional Equities, Research Division",
      "text": "Evercore ISI Institutional Equities, Research Division Congrats on a great quarter. Amy, you mentioned that the upside on Azure came from the non-AI services this time around. I was wondering if you could just talk a little bit more about that. And I guess as you look forward, maybe what's different this go around versus what we saw a few years ago when obviously, things like optimization weighed on the growth a little bit. It sounds like the product portfolio is much broader right now. But just wondering if you could add some color on that front.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Sure. And thanks for the question, Kirk. If we go to non-AI, I talked a little bit about this. In general, we saw better-than-expected performance across our segments, but we saw acceleration in our largest customers. We call that the Enterprise segment in general. And then in what we talked about of our scale motions, where we had some challenges in Q2, things were a little better. And we still have some work to do in our scale motions, and we're encouraged by our progress. We're excited to stay focused on that as, of course, we work through the final quarter of our fiscal year. By geo, the performance was pretty consistent. Satya actually highlighted some of the workloads that came in a little better than we thought. Obviously, just some good consistent work on migrations, good execution by the sales and partner teams, the data workloads he went through. And so in general, Kirk, I wouldn't say it's anything beyond that. I do think it was improved execution. And I was happy to see it, but there's still some work to do on our scale motions, in particular. Jonathan Neilson Operator, we have time for one last question.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The last question will come from the line of Alex Zukin with Wolfe Research.",
      "role_category": "Operator"
    },
    {
      "speaker": "Aleksandr J. Zukin",
      "role": "Wolfe Research, LLC",
      "text": "Wolfe Research, LLC And again, just amazing congratulations on those Azure numbers, which I think are quite honestly, just inspiring. So maybe, Amy, to the point that you're making that the surprise factor was on the non-Azure -- non-AI side of the house. And it sounds like there's confidence in that continuing beyond. How much of that are you starting to see the pull in of the non-AI driven by the AI portion of Azure? And on the AI portion specifically, as test-time compute really just blows out kind of prior conceptions of scaling law challenges, how much does that change potentially the curve of the AI Azure growth as you go forward here over the next few quarters?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Thanks, Alex. Let me first of all say, I think we've talked about this quite a bit, it's always a good chance to get to iterate this. It's getting harder and harder to separate what an AI workload is from a non-AI workload. And we've talked about it this way. I think in most instances, to make sure people understood that when we were accelerating all of our CapEx spend over the past 2.5 or 3 years now, that people had confidence that we were turning that into revenue and product in a way that was transparent and that everyone could understand really the goals that we have set for ourselves and for our partners and customers in terms of building product that turned to revenue. But if you take a step back from that, it's that these workloads are being built, GPU, CPU, storage, network, all the same things. And so I think really what we're talking about is really how Satya talked about in one of the earlier questions, we're seeing digital natives. Digital natives build workloads. They do AI work. They do non-AI work. Do they tend to do that work in the same cloud? Lots of times. Sometimes it all in the same place, not all the time, but that relationship gets stronger and stronger as people pivot to more of AI-heavy workloads. And so I think you're starting to see some of that relationship. I think we'll continue to see that as AI workloads continue to get built and experimented with and proof of concepts get expanded. And so I think I mostly focus on the fact that together, we saw good performance in Q3 on Azure. As you're inclusive of both components, in terms of our execution, in terms of the skilled and partner teams and backlog and conversion and interesting workloads and adding customer value and solving real problems and adding real value. And I think that's probably, Alex, how I would approach that number more than trying to separate it in the way that even we have talked about it, but for very different reasons. Jonathan Neilson That wraps up the Q&A portion of today's earnings call. Thank you for joining us today, and we look forward to speaking with you all soon.",
      "role_category": "Executive"
    },
    {
      "speaker": "Satya  Nadella",
      "role": "Chairman & CEO",
      "text": "Chairman & CEO Thank you.",
      "role_category": "Executive"
    },
    {
      "speaker": "Amy E. Hood",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Thank you. OperatorThis concludes today's conference. You may disconnect your lines at this time, and enjoy the rest of your day. Copyright  2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.  2025 S&P Global Market Intelligence.",
      "role_category": "Executive"
    }
  ],
  "source_file": "Microsoft Corporation, Q3 2025 Earnings Call, Apr 30, 2025.rtf"
}