{
  "event_id": "ORCL_2025-06-11",
  "ticker": "ORCL",
  "company": "Oracle Corporation",
  "quarter": 4,
  "fiscal_year": 2025,
  "call_date": "2025-06-11",
  "call_start_ts": "2025-06-11 21:00:00+00:00",
  "raw_text": "Oracle Corporation NYSE:ORCL\nFQ4 2025 Earnings Call Transcripts\nWednesday, June 11, 2025 9:00 PM GMT\nS&P Global Market Intelligence Estimates\n\nPresentation\n\nOperator\n\nHello, and welcome to the Oracle Corporation Fourth Quarter and Full Year\n2025 Earnings Call.\n\n[Operator Instructions]\n\nI would now like to turn the conference over to Ken Bond, Head of Investor\nRelations. Please go ahead.\n\nKen Bond\nSenior Vice President of Investor Relations\n\nThank you, Sarah, and good afternoon, everyone, and welcome to Oracle's\nFourth Quarter and Fiscal Year 2025 Earnings Conference Call. A copy of the\npress release and financial tables, which includes a GAAP to non-GAAP\nreconciliation and other supplemental financial information can be viewed\nand downloaded from our Investor Relations website.\n\nAdditionally, a list of many customers who purchased Oracle Cloud Services\nor went live on Oracle Cloud recently will be available from our Investor\nRelations website. On the call today are Chairman and Chief Technology\nOfficer, Larry Ellison; and Chief Executive Officer, Safra Catz.\n\nAs a reminder, today's discussion will include forward-looking statements,\nincluding predictions, expectations, estimates or other information that\nmight be considered forward-looking. Throughout today's discussion, we will\npresent some important factors relating to our business, which may\npotentially affect these forward-looking statements.\n\nThese forward-looking statements are also subject to risks and\nuncertainties that may cause actual results to differ materially from the\nstatements being made today. As a result, we caution you against placing\nundue reliance on these forward-looking statements, and we encourage you to\nreview our most recent reports, including our 10-K and 10-Q and any\napplicable amendments for a complete discussion of these factors and other\nrisks that may affect our future results or the market price of our stock.\nAnd finally, we are not obligating ourselves to revise our results or these\nforward-looking statements in light of new information or future events.\nBefore taking questions, we will begin with a few prepared remarks.\n\nAnd with that, I'd like to turn the call over to Safra.\n\nSafra Ada Catz\nCEO & Director\n\nThanks, Ken, and good afternoon, everyone. As you can see, we had an\nexcellent fourth quarter to finish out an amazing year with Q4 total\nrevenue and EPS both exceeding my guidance. We are reporting our fiscal\nyear-end results just 11 days after the last day of the quarter. Using\nOracle Fusion, we continue to announce our quarterly and annual financial\nresults faster than any other company in the S&P 500. Now a few years ago,\nI told you that we've reached a tipping point in our cloud transition and\nexpected revenue growth to accelerate, and it has. In Q4, we hit double-\ndigit revenue growth, and it's only going up from here, even as the company\ngets bigger. Our remaining performance obligations now stand at $138\nbillion, up $8 billion from last quarter and up 41% from last year, and yet\nthe best is still to come. Our applications business was the first area we\nmoved to the cloud more than a decade ago, and we are now the leader in\nenterprise back office with SaaS solutions for ERP, financials, EPM, HCM,\nsupply chain and manufacturing. With the addition of over 100 AI agents,\nalong with strong bookings and higher renewal rates for our strategic SaaS\nproducts, I expect the cloud applications growth rate will accelerate this\ncoming year.\n\nOur infrastructure business was the next area to move to the cloud. we made\nengineering decisions that were much different from the other hyperscalers\nand that were better suited to the needs of enterprise customers, resulting\nin lower costs to them and giving them deployment flexibility. OCI has seen\nexceptional demand for infrastructure services and those contracted\nnoncancelable bookings in RPO give us confidence that OCI revenue will grow\nover 70% this current year. Included in that is that Oracle Autonomous\nDatabase and the AI data platform Enterprises know that their AI needs\ndemand the most capable database to manage a company's full data set.\nFurther, with our AI and autonomous features, our customers can bring all\ntheir data together, make it available for LLMs and yet have the best\nsecurity built in. In addition, our customers have the flexibility to run\ntheir Oracle databases in OCI, in private clouds or in partner clouds with\nour multi-cloud offering. But what is clear is that more customers will use\nthe Oracle database to leverage AI. So -- as a result of the strength in\nour cloud applications and infrastructure, including database services, we\nare raising our revenue guidance for fiscal year '26 to over $67 billion,\nup 16% for the year. Now to the results. And as usual, I'll be discussing\nour financials using constant currency growth rates as it is how we manage\nthe business.\n\nTotal cloud revenue, SaaS plus IaaS was up 27% at $6.7 billion. And total\ncloud services and license support revenue for the quarter was $11.7\nbillion, up 14% IaaS revenue was $3 billion, up 52% on top of the 42%\ngrowth reported last year. OCI consumption revenue was up 62% and demand\ncontinues to dramatically outstrip supply. Our infrastructure cloud\nservices now have an annualized revenue of nearly $12 billion. Cloud\ndatabase services, which were up 31%, now have annualized revenue of $2.6\nbillion. Autonomous Database consumption revenue was up 47% on top of the\n27% growth reported last year. As on-premise databases migrate to the\ncloud, either on OCI directly or through our database at cloud services\nwith Azure, Google or AWS, we expect that cloud database revenues\ncollectively will be the third driver of revenue growth alongside OCI and\nstrategic SaaS. We are currently live in 23 cloud regions with database at\ncloud services and have another 47 planned. Database subscription revenues,\nwhich include database license support, were up 7%. Infrastructure\nsubscription revenues in the quarter, which includes license support, were\n$6.7 billion, up 19% SaaS revenue was $3.7 billion, up 11%.\n\nApplication subscription revenues, which include support, were $5 billion,\nup 8%. Our strategic back-office SaaS applications now have annualized\nrevenues of $9.3 billion, and they were up 20%. Software license revenues\nwere up 8% to $2 billion. So all in, total revenues for the quarter were\n$15.9 billion, up 11% from last year. Operating income grew 7%. Non-GAAP\nEPS was $1.70 in U.S. dollars, while GAAP EPS was USD 1.19 in U.S.. The non-\nGAAP tax rate for the quarter was 9.7%, higher than my 19.7%, which was\nhigher than my 19% guidance. For the full fiscal year, total company\nrevenue was $57.4 billion, up 9%. Total cloud services and license support\nrevenue, which is entirely subscription-based and accounts for 77% of total\nrevenue was $44 billion, up 12%. Total application subscription revenue\ngrew 7% and infrastructure subscription revenues grew 17%. Total cloud\nservices were up 24% to $24.5 billion. IaaS or cloud infrastructure revenue\nwas up 51% to $10.2 billion for the quarter with consumption revenue up 59%\nfrom last year. SaaS revenue was up 10% to $14.3 billion for the year. Non-\nGAAP EPS for the full year was USD 6, up 9% and the full year operating\nincome grew 9%.\n\nAs mentioned, remaining performance obligation at the end of Q4 is now $138\nbillion, up 41% in USD. Further, our cloud RPO grew 56% on top of the 80%\ngrowth last year and now represents nearly 80% of total RPO and\napproximately 33% of total RPO is expected to be recognized as revenue over\nthe next 12 months. For the year, operating cash flow was up 12% at $20.8\nbillion, and free cash flow was a negative $400 million with $21.2 billion\nof CapEx. Operating cash flow for Q4 was $6.2 billion, while free cash flow\nwas a negative $2.9 billion with CapEx of $9.1 billion. The vast majority\nof our CapEx investments are for revenue-generating equipment that is going\ninto data centers and not for land or buildings. I expect that FY '26 CapEx\nwill be higher at over $25 billion as we work to meet demand from our\nbacklog. As we bring more capacity online, our revenue and profit growth\nwill further accelerate. At quarter end, we had $11.2 billion in cash and\nmarketable securities. The short-term deferred revenue balance was $9.4\nbillion. We are committed to returning value to our shareholders through\ntechnical innovation, strategic acquisitions, stock repurchases, prudent\nuse of debt and a dividend. This quarter, we repurchased a little over 1\nmillion shares for a total of $150 million.\n\nAnd over the last 10 years, we've reduced shares outstanding by more than\n1/3 at an average share price of just over $54. In addition, we have paid\nout dividends of $4.7 billion over the last 12 months, and the Board of\nDirectors again declared a quarterly dividend of $0.50 per share. Since\nit's the beginning of FY '26, I'd like to comment on the financial\nacceleration we expect to see in the coming years. Between our $138 billion\nRPO and even larger pipeline, we have a clear line of sight to future\nrevenue growth. So for fiscal year 2026, I expect that total cloud revenue\nwill grow over 40% in constant currency, up from 24% in FY '25 I expect\nthat cloud infrastructure revenue will grow over 70%, up from 51% in FY\n'25. I expect total revenue will be at least $67 billion, up 16% in\nconstant currency and up more than $1 billion from our prior guidance. RPO\nis likely to grow more than 100% in fiscal '26. And lastly, I expect we\nwill exceed the revenue growth target we previously provided for FY '27.\nBeyond FY '27, I'm even more confident in our ability to meet and likely\nexceed our previously provided FY '29 targets. We will provide a more\nfulsome update on our long-range financial targets at the Financial Analyst\nMeeting at Oracle Cloud World in Las Vegas in October. Now let me turn to\nmy guidance for Q1, which I'll review on a non-GAAP basis.\n\nNow assuming currency exchange rates remain the same as they are now,\ncurrency should have a $0.02 positive effect on EPS and a flat to 1%\npositive effect on revenue depending on rounding. However, of course, the\nactual currency impact may be different. Total revenues are expected to\ngrow from 11% to 13% in constant currency are expected to grow from 12% to\n14% in U.S. dollars. Total cloud revenue is expected to grow from 26% to\n30% in constant currency and U.S. dollars. Non-GAAP EPS is expected to grow\nbetween 4% to 6% and be between $1.44 and $1.48 in constant currency. Non-\nGAAP EPS is expected to grow between 5% to 7% and be between USD 1.46 and\nUSD 1.50 in. Lastly, my EPS guidance assumes a base tax rate of 19%.\nHowever, onetime tax events could cause actual tax rates to vary. We had a\ngreat year. And this year, the one we're in now, will be better. Oracle is\nwell on its way to being not only the world's largest cloud application\ncompany, but also one of the world's largest cloud infrastructure\ncompanies. And with that, I'll turn it over to Larry for his comments.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nThank you, Safra. Oracle's future is bright in this new era of cloud\ncomputing. Oracle will be the #1 cloud database company. Oracle will be the\n#1 cloud applications company, and Oracle will be the #1 builder and\noperator of cloud infrastructure data centers. We will build and operate\nmore cloud infrastructure data centers than all of our cloud infrastructure\ncompetitors combined. First, database. Most of the world's most valuable\ndata is stored in an Oracle database. All of those databases are moving to\nthe cloud. Oracle's Cloud, Microsoft's Azure cloud, Amazon's cloud or\nGoogle's Cloud. Oracle runs everywhere. The latest vector version of the\nOracle Database, Oracle 23 AI, is an AI data platform, the only database\nthat can make all of the customer's data immediately available to all of\nthe popular AI large language models while maintaining complete data\nprivacy for the customer. As use of AI increases, so will Oracle's database\nmarket share. Oracle will be the largest and most profitable cloud\napplications company in the world. Oracle developed suites of integrated AI\nagent-based applications for ERP, for EPM, supply chain, manufacturing,\nhuman resources and customer engagement, plus industry applications for\nhealth care, banking, utilities, retail, hospitality and many other\nindustries.\n\nWe use the most modern application generators and AI database technology to\nbuild our application suite. And then we add AI and analytics using OpenAI,\nxAI, Google, Llama and other popular LLMs on top of that application data.\nNo other company is even attempting to build the depth and breadth of AI-\nbased applications that we have already built. Oracle will build more cloud\ninfrastructure data centers than all of our infrastructure competitors\ncombined. All of our OCI data centers from the smallest low-cost data\ncenter to the largest gigawatt AI training data center include all Oracle\nOCI capabilities. A large percentage of those capabilities are autonomous.\nSo labor costs are minimized and human error is dramatically reduced.\nOracle is already prospering in this new era of cloud computing and AI, and\nit's just the beginning. Back to you, Safra.\n\nKen Bond\nSenior Vice President of Investor RelationsThank you, Larry. Before we go\nto the Q&A, just to repeat one number. FY '25 cloud infrastructure revenue\nwas up 51% to $10.2 billion for the year with consumption revenue up 59%\nfrom last year. Sarah, if you could please poll the audience for questions.\n\nQuestion and Answer\n\nOperator\n\n[Operator Instructions]\n\nYour first question comes from Mark Moerdler with Bernstein.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nLarry, Safra and the whole Oracle family, congratulations on the strong\nquarter and the strong year. You've been promising and are now starting to\ndeliver extraordinary growth acceleration, something we've not seen at\nother very large software companies. Yet there's a lack of understanding\nacross the street of your AI business. Can you give us color or break out\nany numbers to help investors understand the durability and profitability\nof the AI business?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nOkay. Well, the interesting thing is a lot of people are talking about that\nthey have all the data. So these other companies say they have all the\ndata, so they can do AI really well. They can build all these AI agents on\ntop of all of that data. The only problem with that statement is they don't\nhave all the data we do. We have most of the world's valuable data. The\nvast majority of it is in an Oracle database. And the latest version of the\nOracle database is an AI-centric piece of technology, a vector database\ncalled Oracle 23 AI. So what it does, it allows -- it's the key enabler for\ncompanies to use AI. Using AI, I mean, the current AI models are trained on\nthe Internet, otherwise known as publicly available data. Do you think\nJPMorgan Chase makes all of their internal data publicly available?\n\nDo you think those AI models train on JPMorgan Chase's data? Companies want\nto be able to use AI models on top of their own data. That is essential.\nOracle applications make all of the data inside the Oracle applications\navailable to AI models like Rock or ChatGPT or all -- by the way, all the\nrest of them, from Google, from whomever, from Meta, Llama, all of us, we\nhave all of those LLMs are in our cloud or in the Oracle Cloud. So this is\nour value proposition. Our database takes all of your data. our\napplications take all of your application data and make that data available\nto the most popular AI models, like if you like ChatGPT, you use ChatGPT.\nIf you like Grock, you use Grok, you use that in the Oracle Cloud. We are\nthe key enabler for enterprises to use their own data and AI models. No one\nelse is doing that.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nThat makes sense.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nIt's a huge -- this is not a small point. This is why our database business\nis going to grow dramatically. Think about it. You have to put all of your\ndata into a database. So that database must be highly secure. It must be\nscalable. It must be economical. It must be reliable, 7 days a week, 24\nhours a day. It has to be fall tolerant. It can never break. That's how\nOracle got popular in the first place. But then it has to hold the data in\na way that's consumable by the AI models. In other words, the data has to\nbe vectorized and searchable by the AI models and you use that data to\ntrain up those models on your data? Who else is doing that. Let me answer\nthe question, nobody.\n\nOperator\n\nThe next question comes from John DiFucci with Guggenheim.\n\nJohn Stephen DiFucci\nGuggenheim Securities, LLC, Research Division\n\nSafra, your quote in that press release that you repeated on this call\nabout next year was pretty amazing and a strong a statement as I've seen\nyou make. And I've known you a long time. So putting that in print means a\nlot to me because I know it means a lot to you. Can you help us unpack that\nstatement a bit? For instance, is Stargate part of the more than 70% growth\nyou expect in IaaS in fiscal '26? And we don't know the timing of Stargate\nor even your financial share. Like we know there's big numbers out there,\nbut not how much of it's yours or you're going to be involved. But is\nStargate also in the RPO growth of more than 100% in fiscal '26? And any\nother color beyond Stargate to help us get our heads around those massive\ngrowth numbers for IaaS would be helpful.\n\nSafra Ada Catz\nCEO & Director\n\nThanks, John. And yes, we have known each other a very long time, longer\nthan to admit. So the reality is that Stargate is still in formation. The\nwork -- there are a lot of partnerships we are in the middle of right now\nthat are all part of this enormous growth rate. We are the destination for\neveryone who wants AI workloads who want database workloads and want --\nwant applications. We are really -- and all of that together comes in our\nRPO. We have so much in pipeline right now that -- and of course, we have\nso much in RPO, meaning those are noncancelable contracts, and we see the\ndemand. I am still in a position where our supply is not meeting our\ndemand. We actually currently are still waving off customers from -- or\nscheduling them out into the future so that we have enough supply to meet\ndemand. This is a situation that we have not seen in our history. And the\nnumbers themselves are so enormous.\n\nAnd the reason is because our technology is different. As Larry has said on\nprevious calls, the cloud we built runs faster and has more capabilities\nthan our competitors and that are built for enormous amounts of data. And\nso we are very much the destination of choice. As Stargate forms, that will\ncontribute into all of this. But some of our partners, many of our\npartners, some of them will be in Stargate. Some are outside of Stargate.\nWe really are working with many, many companies right now and have enormous\npipeline as a result.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nSo let me give you a couple of -- let me chime in here also a little bit.\nLet me surprise you with -- there are huge contracts that have nothing to\ndo with even AI. We got a gigantic contract from Temu that would have been\nunprecedented, except for all the other gigantic contracts we've also been\ngetting. But Temu is a very large company that's growing extremely rapidly.\nAnd they are basically moving their infrastructure to the Oracle Cloud.\nThat was a very big contract. We're seeing huge growth in multi-cloud from\nthe data centers we've already built and the data -- I mean, it's revenue,\nobviously, data centers we already built. And -- but the future -- the\ngrowth rate in multi-cloud is astonishing.\n\nIn other words, our database is now moving very rapidly to the cloud, I\nthink because -- a few reasons because the database has now all these AI\ncapabilities, but also, quite frankly, now people can get it in whatever\ncloud they want. If you're dedicated to using Microsoft Azure, you can get\nthe Oracle database and Microsoft Azure. The fully capable Oracle database\nin Microsoft Azure with all of our fanciest features, including the new AI\nfeatures. You can get it at Google, you can get it in Amazon, you can get\nit at the Oracle Cloud. It's all the same in every place. And that's given\nour customers a lot of comfort that Oracle is not only where they store all\nof their current data, but they want to keep using the Oracle database and\nexpand their use of the Oracle database and move all of that data to the\ncloud as quickly as they can, and they're now able to do it at the place of\nthe cloud that they're choosing. So the database business is growing\nrapidly. This next generation of companies like ByteDance, TikTok, which\nobviously, we do business with them. Temu's another. But Uber, I mean,\nthere are just lots of these companies. A bunch of the security companies\nhave moved to the Oracle Cloud. It's a multi -- it's growth coming from\nmany, many different directions.\n\nJohn Stephen DiFucci\nGuggenheim Securities, LLC, Research Division\n\nSo if I could just -- so Stargate is just part of it. There's a lot of\nthings happening here. And -- but I just wanted -- just to clarify, it\nsounds like it's part of RPO, but is it also part of that 70% in IaaS\nrevenue growth, too?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nWell -- go ahead, Safra.\n\nSafra Ada Catz\nCEO & Director\n\nStargate is not formed yet, but some of our business with OpenAI, which is\none of our partners in Stargate is part of our future very much so. But you\nunderstand, we work with OpenAI. We -- those are still small numbers in the\nscheme of everything else we're doing, but it will ultimately be bigger.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nOkay. Next question, please -- let me add 1 little thing. If Stargate turns\nout to be everything is advertised, then we've understated our RPO growth.\n\nSafra Ada Catz\nCEO & Director\n\nCorrect.\n\nOperator\n\nThe next question comes from Ben Reitzes with Melius Research.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nSafra, Larry, great to be speaking with you today. Nice presentation. Your\nCapEx in the quarter was much higher than expected. I mean, $5 billion more\nthan we expected to get to the $21 billion. And now you're thinking about\nit going to $25 billion. Just wanted a little more color on what it was\nspent on? How is it helping you yield more revenue? And how do you know 25%\nis the right number for this year? And Larry, you usually have some pretty\ngood color on architecture when you answer this question. So I'm looking\nforward to that as well.\n\nSafra Ada Catz\nCEO & Director\n\nOkay. So let me start and let Larry make it perfect. The reality is that,\nas I mentioned on the call, our CapEx is usually about equipment. We're not\n-- we have building partners who charge us rent once they finished\nconstructing things. And when we all of a sudden have higher CapEx, it\nmeans we are filling out data centers, and we are buying components to\nbuild our computers, which are different than other people's, and we are\nputting them on the floor. We had an opportunity to buy up and for\ndeployment, and so we did. And we are putting out as much capacity as we\npossibly can as quickly as we can. I do believe that the $25 billion next\nyear may turn out to be understated. So it is all to meet demand. We don't\norder, we don't build unless we've got orders for our capacity to be built\nout. And we have so much in orders right now that I actually expect, I\nbelieve I said on the call, over $25 billion this next quarter. And that\nis, again, to match demand.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nLet me add, we recently got an order that said we'll take all the capacity\nyou have wherever it is. it could be in Europe, it could be in Asia. We'll\njust take everything. I mean we never got an order like that before. We had\nto move things around. We did the best we could to give them the capacity\nthey needed. The demand is astronomical. Now we have -- but we have to do\nthis methodically. The reason demand continues to outstrip supply is we can\nonly build these data centers, build these computers so fast. And we're\nalso doing a lot of engineering around high-speed networking. You'll see us\nmaking -- we are making large engineering investments to speed up the\nnetworking, the reliability of the network and lower the cost of the\nnetworking. So we're doing a bunch of things -- we are doing a bunch of\nthings to lower our CapEx costs. But even if we do that, CapEx is going to\ngo up because the demand right now seems almost insatiable. I mean I don't\nknow how to describe it. I've never seen anything remotely like this. I\nmean people are calling up and asking us, please, can you find us more\ncapacity. We'll take it wherever. It's in Malaysia, we'll take it fine.\nWe'll take it there. We got some wherever.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nAre you having trouble getting GPUs?\n\nSafra Ada Catz\nCEO & Director\n\nNo.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nNo, not right now. No.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nGot it. Appreciate it.\n\nOperator\n\nThe next question comes from Siti Panigrahi with Mizuho.\n\nSitikantha Panigrahi\nMizuho Securities USA LLC, Research Division\n\nCongratulations on a strong Q4 and impressive guidance. I want to go back\nto the cloud database, mainly you have massive database on on-prem. So what\nare -- what are you hearing from customers in terms of migrating to cloud.\nNow you have multi-cloud strategy, you have dedicated alloy customer. And\nSafra, what's your expectation on the cloud database revenue contribution\nare driving that 70% growth of OCI in fiscal '26?\n\nSafra Ada Catz\nCEO & Director\n\nOkay. Let me just start. So first of all, the database business is really\nhealthy, really growing. In fact, you even see it in the number that I\nthink folks didn't think was possible, which is in license. You should\nunderstand that when our customers are buying more licenses, that actually\nmeans often that they want to use the bring your own license pricing to go\nto the cloud. So database support is up, is solid. License is up, all the\ncloud metrics, autonomous, consumption, Oracle Cloud, all of multi-cloud is\nbasically using up all capacity that gets put out there. So the Oracle\ndatabase is on fire. And it is only the beginning. I want to remind you\nwhat a significant and large business it is and the bulk of it is still on-\npremise. As Larry said, now that you can have it in any of the clouds you\nlike with the database at Oracle in all the other clouds also beyond just\nOCI or you can deploy it at cloud customer, another place where the numbers\nare enormous in growth rates. So consumption going way up, more licensing,\nmore bookings and a lot of demand. And the database side of the world for\nall the reasons Larry said, is the -- is just a superb business and\nextremely compelling, especially to the extent you want to leverage\nartificial intelligence?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nYou asked for a number or an easy number to figure out so let's say, 10% --\nor $10 billion of our support revenue -- our database support revenue,\nmoves to the cloud. So that becomes at least $50 billion because it\nincludes all the computers and all the networking and all of that. So the\nsupport was just 20% of the license fee. So you move $10 billion of our\ndatabase to the cloud, it becomes at least $50 billion in cloud revenue.\nIt's almost as big as Oracle as now.\n\nOperator\n\nThe next question comes from Raimo Lenschow with Barclays.\n\nRaimo Lenschow\nBarclays Bank PLC, Research Division\n\nCongrats as well. The one subject we haven't really talked about was\napplications, but with all the excitement around OCI, like I think you\ndon't get enough credit on applications. Can you talk a little bit about\nwhat's going on there because I had to go back in my model quite a bit to\nsee 22% growth on Fusion and the outlook looks really strong as well, and\nyou talked about accelerating growth there. With all the worries about\ntariffs and stuff like that, I kind of I'm surprised to see kind of these\nvery, very good numbers from you. Can you maybe talk about that a little\nbit?\n\nSafra Ada Catz\nCEO & Director\n\nSure. Tariffs have no impact really at all to play in this. What it does\nallow our customers to do is do what I do when I announce on a year on day\n11 is to be much more -- really much better run and have a better idea of\nwhere their business is and how it's doing and to do more and spend a lot\nless. What you're seeing now, and it hasn't been obvious in the numbers\nbecause, as you know, we have our strategic SaaS products, and we break\nthat down for you in the release to some extent.\n\nAnd those are going gangbusters. And we've had other things in the numbers\nthat have made you not be able to really see. We have some nonstrategic\nproducts. And in addition, we've also had an advertising business, which we\nare now lapping. I stopped even mentioning it because what's the\ndifference, a few hundred million. But the reality is what you're starting\nto see is our strategic SaaS products as they roll out in our customer\nsites and as they ramp up, they're very, very popular. They're obviously\ncompelling because only if you're in the cloud, can you use the AI\ncapabilities. See many customers are still on on-premise ERP products.\nthose can't really use the advanced AgentX and AI capabilities. So if you\nwant to use that and many do for automation and to do more spend less,\nyou've got to move to Fusion or NetSuite. And those are just very, very\ncompelling, and it's just now starting to show through the noise.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nLook, I would add -- let me add one thing, which is companies don't really\nenjoy buying applications from 5 different vendors and then making all of\nthose applications work together. So some companies, not all, but some\ncompanies are saying, Oracle, you build these integrated suites of\napplications, and they're all -- and they are all AI agent-based\napplications. So they're modern applications, they're modern cloud\napplications. And -- but all of your applications are engineered to work\nwith one another. So our ERP and EPM and supply chain manufacturing, human\nresources, customer engagement, all those apps are designed as a single\nsuite of applications to run an enterprise or government agency. And all\nthose pieces then work together. So there's no cost of integrating those\napplications. So we're seeing a lot of companies buying -- basically\nsaying, I'm going to go all Oracle. I'm going to buy the complete Oracle\nsuite for ERP, EPM, supply chain, manufacturing. A lot of people don't have\nmanufacturing, supply chain, human report sources and customer engagement.\nThey're picking us -- if they pick our back-office applications, they'll\nsometimes pick our front office applications over Salesforce as a result of\nthat. And our customer engagement applications are getting better and\nbetter. We continue to invest in those. And our intent is to give our --\nsome of our biggest customers a one-stop shop where they can buy the entire\nsuite to run their enterprise from us. And that gets rid of a lot of\nheadaches. Everything is in the same database.\n\nEverything comes with the same AI data platform with it. All the analytics\nare there, everything is there. You don't have to do the system\nintegration. You don't have to fit -- buy a bunch of pieces and make them\nwork together. That has been our strategy for some time, and that's all\ncoming together as a bunch of companies are not successfully navigating\nthis difficult, admittedly difficult transition from on-premise to the\ncloud. There have been a lot of companies that have not done it very well,\nand they are casualties, and we're picking up a lot of their users. So the\napplication business is very, very promising. And then I add Oracle Health\nand Oracle Banking, Oracle Retail, hospitality, the different industries on\ntop of that. There's no other apps company that is trying to build such a\nbroad-based integrated suite of AI cloud applications. Who's closest?\nThere's no one doing -- no one attempting to do what we're doing.\n\nOperator\n\nYour final question comes from Brad Zelnick with Deutsche Bank.\n\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\n\nCongrats. Safra, Larry, the things you've been telling us would happen are\nclearly happening and it's amazing. As we go forward, Larry, Oracle has\nalways had the advantage of being the only vendor with enterprise-grade\ntechnology from apps, all the way down to infrastructure -- and since the\nSunday is optimized even down to the silicon, why does the full stack\nnature of what you do remain important as we enter this new era of\ncomputing.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nWell, such an interesting question because I think to some degree, people\nthought our biggest weakness is that we were just spread too thin. We're\ntrying to do infrastructure -- I mean, database initially, infrastructure\nand then applications on top of that infrastructure. But what made our\ndatabase so good? I can argue there -- we made some good technology\ndecisions. But the other thing that made our database so good is we had --\nwe developed apps on top of our own database.\n\nIn the same company, you have people using the database to develop\napplications and the people who are developing that database. And if the\napplications found features missing from the database, they found\ncapabilities they wish were in the database that would make their\napplications better, more reliable, more secure. We gain those insights by\nbuilding those applications. Building applications allowed us to understand\nhow to build database better. Building great databases made it much easier\nto build the cloud. there are a lot of databases that run the cloud. You\nbecome -- there's a database of our users, all of our resources are in\ndatabases. So the autonomous database, the Oracle Autonomous Database is\none of the reasons our cloud -- at some point, we're going to rerisen our\ncloud from Gen 2 cloud to the autonomous cloud. Right now, that would be\ntoo aggressive. We're not fully autonomous. But we're getting there. And\nbecause we were able to use a lot of our existing database technology,\nspecifically the autonomous database technology to make our cloud more\nscalable, more reliable. And by the way, when you eliminate human labor,\nwhen you have an autonomous database, you eliminate human labor, you save\nmoney, but you also eliminate human error and human mischief. So it makes\nyour cloud much more secure.\n\nOne of the reasons our cloud is more secure. One of the reasons our cloud\nis faster is because we have an autonomous database that runs it. So having\nall of these levels of technology allows us to solve a technical problem at\nthe right layer of the technology. Should we solve the problem in the\nnetwork fabric. Should we solve the problem with our cloud computer\ncontroller, something we have with other people that we embedded different\nhardware to run the cloud. We added -- we have different hardware\narchitecture to make it more secure and more reliable. So we've done\ninnovation in the network. We've done innovation in our host computing. We\nhave an autonomous nonstop Linux operating system that we built, the\nautonomous database that manages all the data in the cloud and so on. Being\nable to solve problems at different layers of the technology, understanding\nthe different layers of the technology allows us to build an integrated\nsolution that is faster, cheaper, more reliable than what our competitors\ncan do.\n\nUnknown Executive\n\nA telephonic replay of this conference call will be available for 24 hours\non our Investor Relations website. Thank you for joining us today. With\nthat, I'll turn the call back to Sarah for closing.\n\nOperatorThank you. This concludes today's conference. Thank you for\njoining. You may now disconnect.\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence.",
  "presentation_text": "Operator\n\nHello, and welcome to the Oracle Corporation Fourth Quarter and Full Year\n2025 Earnings Call.\n\n[Operator Instructions]\n\nI would now like to turn the conference over to Ken Bond, Head of Investor\nRelations. Please go ahead.\n\nKen Bond\nSenior Vice President of Investor Relations\n\nThank you, Sarah, and good afternoon, everyone, and welcome to Oracle's\nFourth Quarter and Fiscal Year 2025 Earnings Conference Call. A copy of the\npress release and financial tables, which includes a GAAP to non-GAAP\nreconciliation and other supplemental financial information can be viewed\nand downloaded from our Investor Relations website.\n\nAdditionally, a list of many customers who purchased Oracle Cloud Services\nor went live on Oracle Cloud recently will be available from our Investor\nRelations website. On the call today are Chairman and Chief Technology\nOfficer, Larry Ellison; and Chief Executive Officer, Safra Catz.\n\nAs a reminder, today's discussion will include forward-looking statements,\nincluding predictions, expectations, estimates or other information that\nmight be considered forward-looking. Throughout today's discussion, we will\npresent some important factors relating to our business, which may\npotentially affect these forward-looking statements.\n\nThese forward-looking statements are also subject to risks and\nuncertainties that may cause actual results to differ materially from the\nstatements being made today. As a result, we caution you against placing\nundue reliance on these forward-looking statements, and we encourage you to\nreview our most recent reports, including our 10-K and 10-Q and any\napplicable amendments for a complete discussion of these factors and other\nrisks that may affect our future results or the market price of our stock.\nAnd finally, we are not obligating ourselves to revise our results or these\nforward-looking statements in light of new information or future events.\nBefore taking questions, we will begin with a few prepared remarks.\n\nAnd with that, I'd like to turn the call over to Safra.\n\nSafra Ada Catz\nCEO & Director\n\nThanks, Ken, and good afternoon, everyone. As you can see, we had an\nexcellent fourth quarter to finish out an amazing year with Q4 total\nrevenue and EPS both exceeding my guidance. We are reporting our fiscal\nyear-end results just 11 days after the last day of the quarter. Using\nOracle Fusion, we continue to announce our quarterly and annual financial\nresults faster than any other company in the S&P 500. Now a few years ago,\nI told you that we've reached a tipping point in our cloud transition and\nexpected revenue growth to accelerate, and it has. In Q4, we hit double-\ndigit revenue growth, and it's only going up from here, even as the company\ngets bigger. Our remaining performance obligations now stand at $138\nbillion, up $8 billion from last quarter and up 41% from last year, and yet\nthe best is still to come. Our applications business was the first area we\nmoved to the cloud more than a decade ago, and we are now the leader in\nenterprise back office with SaaS solutions for ERP, financials, EPM, HCM,\nsupply chain and manufacturing. With the addition of over 100 AI agents,\nalong with strong bookings and higher renewal rates for our strategic SaaS\nproducts, I expect the cloud applications growth rate will accelerate this\ncoming year.\n\nOur infrastructure business was the next area to move to the cloud. we made\nengineering decisions that were much different from the other hyperscalers\nand that were better suited to the needs of enterprise customers, resulting\nin lower costs to them and giving them deployment flexibility. OCI has seen\nexceptional demand for infrastructure services and those contracted\nnoncancelable bookings in RPO give us confidence that OCI revenue will grow\nover 70% this current year. Included in that is that Oracle Autonomous\nDatabase and the AI data platform Enterprises know that their AI needs\ndemand the most capable database to manage a company's full data set.\nFurther, with our AI and autonomous features, our customers can bring all\ntheir data together, make it available for LLMs and yet have the best\nsecurity built in. In addition, our customers have the flexibility to run\ntheir Oracle databases in OCI, in private clouds or in partner clouds with\nour multi-cloud offering. But what is clear is that more customers will use\nthe Oracle database to leverage AI. So -- as a result of the strength in\nour cloud applications and infrastructure, including database services, we\nare raising our revenue guidance for fiscal year '26 to over $67 billion,\nup 16% for the year. Now to the results. And as usual, I'll be discussing\nour financials using constant currency growth rates as it is how we manage\nthe business.\n\nTotal cloud revenue, SaaS plus IaaS was up 27% at $6.7 billion. And total\ncloud services and license support revenue for the quarter was $11.7\nbillion, up 14% IaaS revenue was $3 billion, up 52% on top of the 42%\ngrowth reported last year. OCI consumption revenue was up 62% and demand\ncontinues to dramatically outstrip supply. Our infrastructure cloud\nservices now have an annualized revenue of nearly $12 billion. Cloud\ndatabase services, which were up 31%, now have annualized revenue of $2.6\nbillion. Autonomous Database consumption revenue was up 47% on top of the\n27% growth reported last year. As on-premise databases migrate to the\ncloud, either on OCI directly or through our database at cloud services\nwith Azure, Google or AWS, we expect that cloud database revenues\ncollectively will be the third driver of revenue growth alongside OCI and\nstrategic SaaS. We are currently live in 23 cloud regions with database at\ncloud services and have another 47 planned. Database subscription revenues,\nwhich include database license support, were up 7%. Infrastructure\nsubscription revenues in the quarter, which includes license support, were\n$6.7 billion, up 19% SaaS revenue was $3.7 billion, up 11%.\n\nApplication subscription revenues, which include support, were $5 billion,\nup 8%. Our strategic back-office SaaS applications now have annualized\nrevenues of $9.3 billion, and they were up 20%. Software license revenues\nwere up 8% to $2 billion. So all in, total revenues for the quarter were\n$15.9 billion, up 11% from last year. Operating income grew 7%. Non-GAAP\nEPS was $1.70 in U.S. dollars, while GAAP EPS was USD 1.19 in U.S.. The non-\nGAAP tax rate for the quarter was 9.7%, higher than my 19.7%, which was\nhigher than my 19% guidance. For the full fiscal year, total company\nrevenue was $57.4 billion, up 9%. Total cloud services and license support\nrevenue, which is entirely subscription-based and accounts for 77% of total\nrevenue was $44 billion, up 12%. Total application subscription revenue\ngrew 7% and infrastructure subscription revenues grew 17%. Total cloud\nservices were up 24% to $24.5 billion. IaaS or cloud infrastructure revenue\nwas up 51% to $10.2 billion for the quarter with consumption revenue up 59%\nfrom last year. SaaS revenue was up 10% to $14.3 billion for the year. Non-\nGAAP EPS for the full year was USD 6, up 9% and the full year operating\nincome grew 9%.\n\nAs mentioned, remaining performance obligation at the end of Q4 is now $138\nbillion, up 41% in USD. Further, our cloud RPO grew 56% on top of the 80%\ngrowth last year and now represents nearly 80% of total RPO and\napproximately 33% of total RPO is expected to be recognized as revenue over\nthe next 12 months. For the year, operating cash flow was up 12% at $20.8\nbillion, and free cash flow was a negative $400 million with $21.2 billion\nof CapEx. Operating cash flow for Q4 was $6.2 billion, while free cash flow\nwas a negative $2.9 billion with CapEx of $9.1 billion. The vast majority\nof our CapEx investments are for revenue-generating equipment that is going\ninto data centers and not for land or buildings. I expect that FY '26 CapEx\nwill be higher at over $25 billion as we work to meet demand from our\nbacklog. As we bring more capacity online, our revenue and profit growth\nwill further accelerate. At quarter end, we had $11.2 billion in cash and\nmarketable securities. The short-term deferred revenue balance was $9.4\nbillion. We are committed to returning value to our shareholders through\ntechnical innovation, strategic acquisitions, stock repurchases, prudent\nuse of debt and a dividend. This quarter, we repurchased a little over 1\nmillion shares for a total of $150 million.\n\nAnd over the last 10 years, we've reduced shares outstanding by more than\n1/3 at an average share price of just over $54. In addition, we have paid\nout dividends of $4.7 billion over the last 12 months, and the Board of\nDirectors again declared a quarterly dividend of $0.50 per share. Since\nit's the beginning of FY '26, I'd like to comment on the financial\nacceleration we expect to see in the coming years. Between our $138 billion\nRPO and even larger pipeline, we have a clear line of sight to future\nrevenue growth. So for fiscal year 2026, I expect that total cloud revenue\nwill grow over 40% in constant currency, up from 24% in FY '25 I expect\nthat cloud infrastructure revenue will grow over 70%, up from 51% in FY\n'25. I expect total revenue will be at least $67 billion, up 16% in\nconstant currency and up more than $1 billion from our prior guidance. RPO\nis likely to grow more than 100% in fiscal '26. And lastly, I expect we\nwill exceed the revenue growth target we previously provided for FY '27.\nBeyond FY '27, I'm even more confident in our ability to meet and likely\nexceed our previously provided FY '29 targets. We will provide a more\nfulsome update on our long-range financial targets at the Financial Analyst\nMeeting at Oracle Cloud World in Las Vegas in October. Now let me turn to\nmy guidance for Q1, which I'll review on a non-GAAP basis.\n\nNow assuming currency exchange rates remain the same as they are now,\ncurrency should have a $0.02 positive effect on EPS and a flat to 1%\npositive effect on revenue depending on rounding. However, of course, the\nactual currency impact may be different. Total revenues are expected to\ngrow from 11% to 13% in constant currency are expected to grow from 12% to\n14% in U.S. dollars. Total cloud revenue is expected to grow from 26% to\n30% in constant currency and U.S. dollars. Non-GAAP EPS is expected to grow\nbetween 4% to 6% and be between $1.44 and $1.48 in constant currency. Non-\nGAAP EPS is expected to grow between 5% to 7% and be between USD 1.46 and\nUSD 1.50 in. Lastly, my EPS guidance assumes a base tax rate of 19%.\nHowever, onetime tax events could cause actual tax rates to vary. We had a\ngreat year. And this year, the one we're in now, will be better. Oracle is\nwell on its way to being not only the world's largest cloud application\ncompany, but also one of the world's largest cloud infrastructure\ncompanies. And with that, I'll turn it over to Larry for his comments.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nThank you, Safra. Oracle's future is bright in this new era of cloud\ncomputing. Oracle will be the #1 cloud database company. Oracle will be the\n#1 cloud applications company, and Oracle will be the #1 builder and\noperator of cloud infrastructure data centers. We will build and operate\nmore cloud infrastructure data centers than all of our cloud infrastructure\ncompetitors combined. First, database. Most of the world's most valuable\ndata is stored in an Oracle database. All of those databases are moving to\nthe cloud. Oracle's Cloud, Microsoft's Azure cloud, Amazon's cloud or\nGoogle's Cloud. Oracle runs everywhere. The latest vector version of the\nOracle Database, Oracle 23 AI, is an AI data platform, the only database\nthat can make all of the customer's data immediately available to all of\nthe popular AI large language models while maintaining complete data\nprivacy for the customer. As use of AI increases, so will Oracle's database\nmarket share. Oracle will be the largest and most profitable cloud\napplications company in the world. Oracle developed suites of integrated AI\nagent-based applications for ERP, for EPM, supply chain, manufacturing,\nhuman resources and customer engagement, plus industry applications for\nhealth care, banking, utilities, retail, hospitality and many other\nindustries.\n\nWe use the most modern application generators and AI database technology to\nbuild our application suite. And then we add AI and analytics using OpenAI,\nxAI, Google, Llama and other popular LLMs on top of that application data.\nNo other company is even attempting to build the depth and breadth of AI-\nbased applications that we have already built. Oracle will build more cloud\ninfrastructure data centers than all of our infrastructure competitors\ncombined. All of our OCI data centers from the smallest low-cost data\ncenter to the largest gigawatt AI training data center include all Oracle\nOCI capabilities. A large percentage of those capabilities are autonomous.\nSo labor costs are minimized and human error is dramatically reduced.\nOracle is already prospering in this new era of cloud computing and AI, and\nit's just the beginning. Back to you, Safra.\n\nKen Bond\nSenior Vice President of Investor RelationsThank you, Larry. Before we go\nto the Q&A, just to repeat one number. FY '25 cloud infrastructure revenue\nwas up 51% to $10.2 billion for the year with consumption revenue up 59%\nfrom last year. Sarah, if you could please poll the audience for questions.",
  "qa_text": "Operator\n\n[Operator Instructions]\n\nYour first question comes from Mark Moerdler with Bernstein.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nLarry, Safra and the whole Oracle family, congratulations on the strong\nquarter and the strong year. You've been promising and are now starting to\ndeliver extraordinary growth acceleration, something we've not seen at\nother very large software companies. Yet there's a lack of understanding\nacross the street of your AI business. Can you give us color or break out\nany numbers to help investors understand the durability and profitability\nof the AI business?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nOkay. Well, the interesting thing is a lot of people are talking about that\nthey have all the data. So these other companies say they have all the\ndata, so they can do AI really well. They can build all these AI agents on\ntop of all of that data. The only problem with that statement is they don't\nhave all the data we do. We have most of the world's valuable data. The\nvast majority of it is in an Oracle database. And the latest version of the\nOracle database is an AI-centric piece of technology, a vector database\ncalled Oracle 23 AI. So what it does, it allows -- it's the key enabler for\ncompanies to use AI. Using AI, I mean, the current AI models are trained on\nthe Internet, otherwise known as publicly available data. Do you think\nJPMorgan Chase makes all of their internal data publicly available?\n\nDo you think those AI models train on JPMorgan Chase's data? Companies want\nto be able to use AI models on top of their own data. That is essential.\nOracle applications make all of the data inside the Oracle applications\navailable to AI models like Rock or ChatGPT or all -- by the way, all the\nrest of them, from Google, from whomever, from Meta, Llama, all of us, we\nhave all of those LLMs are in our cloud or in the Oracle Cloud. So this is\nour value proposition. Our database takes all of your data. our\napplications take all of your application data and make that data available\nto the most popular AI models, like if you like ChatGPT, you use ChatGPT.\nIf you like Grock, you use Grok, you use that in the Oracle Cloud. We are\nthe key enabler for enterprises to use their own data and AI models. No one\nelse is doing that.\n\nMark L. Moerdler\nSanford C. Bernstein & Co., LLC., Research Division\n\nThat makes sense.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nIt's a huge -- this is not a small point. This is why our database business\nis going to grow dramatically. Think about it. You have to put all of your\ndata into a database. So that database must be highly secure. It must be\nscalable. It must be economical. It must be reliable, 7 days a week, 24\nhours a day. It has to be fall tolerant. It can never break. That's how\nOracle got popular in the first place. But then it has to hold the data in\na way that's consumable by the AI models. In other words, the data has to\nbe vectorized and searchable by the AI models and you use that data to\ntrain up those models on your data? Who else is doing that. Let me answer\nthe question, nobody.\n\nOperator\n\nThe next question comes from John DiFucci with Guggenheim.\n\nJohn Stephen DiFucci\nGuggenheim Securities, LLC, Research Division\n\nSafra, your quote in that press release that you repeated on this call\nabout next year was pretty amazing and a strong a statement as I've seen\nyou make. And I've known you a long time. So putting that in print means a\nlot to me because I know it means a lot to you. Can you help us unpack that\nstatement a bit? For instance, is Stargate part of the more than 70% growth\nyou expect in IaaS in fiscal '26? And we don't know the timing of Stargate\nor even your financial share. Like we know there's big numbers out there,\nbut not how much of it's yours or you're going to be involved. But is\nStargate also in the RPO growth of more than 100% in fiscal '26? And any\nother color beyond Stargate to help us get our heads around those massive\ngrowth numbers for IaaS would be helpful.\n\nSafra Ada Catz\nCEO & Director\n\nThanks, John. And yes, we have known each other a very long time, longer\nthan to admit. So the reality is that Stargate is still in formation. The\nwork -- there are a lot of partnerships we are in the middle of right now\nthat are all part of this enormous growth rate. We are the destination for\neveryone who wants AI workloads who want database workloads and want --\nwant applications. We are really -- and all of that together comes in our\nRPO. We have so much in pipeline right now that -- and of course, we have\nso much in RPO, meaning those are noncancelable contracts, and we see the\ndemand. I am still in a position where our supply is not meeting our\ndemand. We actually currently are still waving off customers from -- or\nscheduling them out into the future so that we have enough supply to meet\ndemand. This is a situation that we have not seen in our history. And the\nnumbers themselves are so enormous.\n\nAnd the reason is because our technology is different. As Larry has said on\nprevious calls, the cloud we built runs faster and has more capabilities\nthan our competitors and that are built for enormous amounts of data. And\nso we are very much the destination of choice. As Stargate forms, that will\ncontribute into all of this. But some of our partners, many of our\npartners, some of them will be in Stargate. Some are outside of Stargate.\nWe really are working with many, many companies right now and have enormous\npipeline as a result.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nSo let me give you a couple of -- let me chime in here also a little bit.\nLet me surprise you with -- there are huge contracts that have nothing to\ndo with even AI. We got a gigantic contract from Temu that would have been\nunprecedented, except for all the other gigantic contracts we've also been\ngetting. But Temu is a very large company that's growing extremely rapidly.\nAnd they are basically moving their infrastructure to the Oracle Cloud.\nThat was a very big contract. We're seeing huge growth in multi-cloud from\nthe data centers we've already built and the data -- I mean, it's revenue,\nobviously, data centers we already built. And -- but the future -- the\ngrowth rate in multi-cloud is astonishing.\n\nIn other words, our database is now moving very rapidly to the cloud, I\nthink because -- a few reasons because the database has now all these AI\ncapabilities, but also, quite frankly, now people can get it in whatever\ncloud they want. If you're dedicated to using Microsoft Azure, you can get\nthe Oracle database and Microsoft Azure. The fully capable Oracle database\nin Microsoft Azure with all of our fanciest features, including the new AI\nfeatures. You can get it at Google, you can get it in Amazon, you can get\nit at the Oracle Cloud. It's all the same in every place. And that's given\nour customers a lot of comfort that Oracle is not only where they store all\nof their current data, but they want to keep using the Oracle database and\nexpand their use of the Oracle database and move all of that data to the\ncloud as quickly as they can, and they're now able to do it at the place of\nthe cloud that they're choosing. So the database business is growing\nrapidly. This next generation of companies like ByteDance, TikTok, which\nobviously, we do business with them. Temu's another. But Uber, I mean,\nthere are just lots of these companies. A bunch of the security companies\nhave moved to the Oracle Cloud. It's a multi -- it's growth coming from\nmany, many different directions.\n\nJohn Stephen DiFucci\nGuggenheim Securities, LLC, Research Division\n\nSo if I could just -- so Stargate is just part of it. There's a lot of\nthings happening here. And -- but I just wanted -- just to clarify, it\nsounds like it's part of RPO, but is it also part of that 70% in IaaS\nrevenue growth, too?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nWell -- go ahead, Safra.\n\nSafra Ada Catz\nCEO & Director\n\nStargate is not formed yet, but some of our business with OpenAI, which is\none of our partners in Stargate is part of our future very much so. But you\nunderstand, we work with OpenAI. We -- those are still small numbers in the\nscheme of everything else we're doing, but it will ultimately be bigger.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nOkay. Next question, please -- let me add 1 little thing. If Stargate turns\nout to be everything is advertised, then we've understated our RPO growth.\n\nSafra Ada Catz\nCEO & Director\n\nCorrect.\n\nOperator\n\nThe next question comes from Ben Reitzes with Melius Research.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nSafra, Larry, great to be speaking with you today. Nice presentation. Your\nCapEx in the quarter was much higher than expected. I mean, $5 billion more\nthan we expected to get to the $21 billion. And now you're thinking about\nit going to $25 billion. Just wanted a little more color on what it was\nspent on? How is it helping you yield more revenue? And how do you know 25%\nis the right number for this year? And Larry, you usually have some pretty\ngood color on architecture when you answer this question. So I'm looking\nforward to that as well.\n\nSafra Ada Catz\nCEO & Director\n\nOkay. So let me start and let Larry make it perfect. The reality is that,\nas I mentioned on the call, our CapEx is usually about equipment. We're not\n-- we have building partners who charge us rent once they finished\nconstructing things. And when we all of a sudden have higher CapEx, it\nmeans we are filling out data centers, and we are buying components to\nbuild our computers, which are different than other people's, and we are\nputting them on the floor. We had an opportunity to buy up and for\ndeployment, and so we did. And we are putting out as much capacity as we\npossibly can as quickly as we can. I do believe that the $25 billion next\nyear may turn out to be understated. So it is all to meet demand. We don't\norder, we don't build unless we've got orders for our capacity to be built\nout. And we have so much in orders right now that I actually expect, I\nbelieve I said on the call, over $25 billion this next quarter. And that\nis, again, to match demand.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nLet me add, we recently got an order that said we'll take all the capacity\nyou have wherever it is. it could be in Europe, it could be in Asia. We'll\njust take everything. I mean we never got an order like that before. We had\nto move things around. We did the best we could to give them the capacity\nthey needed. The demand is astronomical. Now we have -- but we have to do\nthis methodically. The reason demand continues to outstrip supply is we can\nonly build these data centers, build these computers so fast. And we're\nalso doing a lot of engineering around high-speed networking. You'll see us\nmaking -- we are making large engineering investments to speed up the\nnetworking, the reliability of the network and lower the cost of the\nnetworking. So we're doing a bunch of things -- we are doing a bunch of\nthings to lower our CapEx costs. But even if we do that, CapEx is going to\ngo up because the demand right now seems almost insatiable. I mean I don't\nknow how to describe it. I've never seen anything remotely like this. I\nmean people are calling up and asking us, please, can you find us more\ncapacity. We'll take it wherever. It's in Malaysia, we'll take it fine.\nWe'll take it there. We got some wherever.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nAre you having trouble getting GPUs?\n\nSafra Ada Catz\nCEO & Director\n\nNo.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nNo, not right now. No.\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nGot it. Appreciate it.\n\nOperator\n\nThe next question comes from Siti Panigrahi with Mizuho.\n\nSitikantha Panigrahi\nMizuho Securities USA LLC, Research Division\n\nCongratulations on a strong Q4 and impressive guidance. I want to go back\nto the cloud database, mainly you have massive database on on-prem. So what\nare -- what are you hearing from customers in terms of migrating to cloud.\nNow you have multi-cloud strategy, you have dedicated alloy customer. And\nSafra, what's your expectation on the cloud database revenue contribution\nare driving that 70% growth of OCI in fiscal '26?\n\nSafra Ada Catz\nCEO & Director\n\nOkay. Let me just start. So first of all, the database business is really\nhealthy, really growing. In fact, you even see it in the number that I\nthink folks didn't think was possible, which is in license. You should\nunderstand that when our customers are buying more licenses, that actually\nmeans often that they want to use the bring your own license pricing to go\nto the cloud. So database support is up, is solid. License is up, all the\ncloud metrics, autonomous, consumption, Oracle Cloud, all of multi-cloud is\nbasically using up all capacity that gets put out there. So the Oracle\ndatabase is on fire. And it is only the beginning. I want to remind you\nwhat a significant and large business it is and the bulk of it is still on-\npremise. As Larry said, now that you can have it in any of the clouds you\nlike with the database at Oracle in all the other clouds also beyond just\nOCI or you can deploy it at cloud customer, another place where the numbers\nare enormous in growth rates. So consumption going way up, more licensing,\nmore bookings and a lot of demand. And the database side of the world for\nall the reasons Larry said, is the -- is just a superb business and\nextremely compelling, especially to the extent you want to leverage\nartificial intelligence?\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nYou asked for a number or an easy number to figure out so let's say, 10% --\nor $10 billion of our support revenue -- our database support revenue,\nmoves to the cloud. So that becomes at least $50 billion because it\nincludes all the computers and all the networking and all of that. So the\nsupport was just 20% of the license fee. So you move $10 billion of our\ndatabase to the cloud, it becomes at least $50 billion in cloud revenue.\nIt's almost as big as Oracle as now.\n\nOperator\n\nThe next question comes from Raimo Lenschow with Barclays.\n\nRaimo Lenschow\nBarclays Bank PLC, Research Division\n\nCongrats as well. The one subject we haven't really talked about was\napplications, but with all the excitement around OCI, like I think you\ndon't get enough credit on applications. Can you talk a little bit about\nwhat's going on there because I had to go back in my model quite a bit to\nsee 22% growth on Fusion and the outlook looks really strong as well, and\nyou talked about accelerating growth there. With all the worries about\ntariffs and stuff like that, I kind of I'm surprised to see kind of these\nvery, very good numbers from you. Can you maybe talk about that a little\nbit?\n\nSafra Ada Catz\nCEO & Director\n\nSure. Tariffs have no impact really at all to play in this. What it does\nallow our customers to do is do what I do when I announce on a year on day\n11 is to be much more -- really much better run and have a better idea of\nwhere their business is and how it's doing and to do more and spend a lot\nless. What you're seeing now, and it hasn't been obvious in the numbers\nbecause, as you know, we have our strategic SaaS products, and we break\nthat down for you in the release to some extent.\n\nAnd those are going gangbusters. And we've had other things in the numbers\nthat have made you not be able to really see. We have some nonstrategic\nproducts. And in addition, we've also had an advertising business, which we\nare now lapping. I stopped even mentioning it because what's the\ndifference, a few hundred million. But the reality is what you're starting\nto see is our strategic SaaS products as they roll out in our customer\nsites and as they ramp up, they're very, very popular. They're obviously\ncompelling because only if you're in the cloud, can you use the AI\ncapabilities. See many customers are still on on-premise ERP products.\nthose can't really use the advanced AgentX and AI capabilities. So if you\nwant to use that and many do for automation and to do more spend less,\nyou've got to move to Fusion or NetSuite. And those are just very, very\ncompelling, and it's just now starting to show through the noise.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nLook, I would add -- let me add one thing, which is companies don't really\nenjoy buying applications from 5 different vendors and then making all of\nthose applications work together. So some companies, not all, but some\ncompanies are saying, Oracle, you build these integrated suites of\napplications, and they're all -- and they are all AI agent-based\napplications. So they're modern applications, they're modern cloud\napplications. And -- but all of your applications are engineered to work\nwith one another. So our ERP and EPM and supply chain manufacturing, human\nresources, customer engagement, all those apps are designed as a single\nsuite of applications to run an enterprise or government agency. And all\nthose pieces then work together. So there's no cost of integrating those\napplications. So we're seeing a lot of companies buying -- basically\nsaying, I'm going to go all Oracle. I'm going to buy the complete Oracle\nsuite for ERP, EPM, supply chain, manufacturing. A lot of people don't have\nmanufacturing, supply chain, human report sources and customer engagement.\nThey're picking us -- if they pick our back-office applications, they'll\nsometimes pick our front office applications over Salesforce as a result of\nthat. And our customer engagement applications are getting better and\nbetter. We continue to invest in those. And our intent is to give our --\nsome of our biggest customers a one-stop shop where they can buy the entire\nsuite to run their enterprise from us. And that gets rid of a lot of\nheadaches. Everything is in the same database.\n\nEverything comes with the same AI data platform with it. All the analytics\nare there, everything is there. You don't have to do the system\nintegration. You don't have to fit -- buy a bunch of pieces and make them\nwork together. That has been our strategy for some time, and that's all\ncoming together as a bunch of companies are not successfully navigating\nthis difficult, admittedly difficult transition from on-premise to the\ncloud. There have been a lot of companies that have not done it very well,\nand they are casualties, and we're picking up a lot of their users. So the\napplication business is very, very promising. And then I add Oracle Health\nand Oracle Banking, Oracle Retail, hospitality, the different industries on\ntop of that. There's no other apps company that is trying to build such a\nbroad-based integrated suite of AI cloud applications. Who's closest?\nThere's no one doing -- no one attempting to do what we're doing.\n\nOperator\n\nYour final question comes from Brad Zelnick with Deutsche Bank.\n\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\n\nCongrats. Safra, Larry, the things you've been telling us would happen are\nclearly happening and it's amazing. As we go forward, Larry, Oracle has\nalways had the advantage of being the only vendor with enterprise-grade\ntechnology from apps, all the way down to infrastructure -- and since the\nSunday is optimized even down to the silicon, why does the full stack\nnature of what you do remain important as we enter this new era of\ncomputing.\n\nLawrence J. Ellison\nCo-Founder, Chairman & CTO\n\nWell, such an interesting question because I think to some degree, people\nthought our biggest weakness is that we were just spread too thin. We're\ntrying to do infrastructure -- I mean, database initially, infrastructure\nand then applications on top of that infrastructure. But what made our\ndatabase so good? I can argue there -- we made some good technology\ndecisions. But the other thing that made our database so good is we had --\nwe developed apps on top of our own database.\n\nIn the same company, you have people using the database to develop\napplications and the people who are developing that database. And if the\napplications found features missing from the database, they found\ncapabilities they wish were in the database that would make their\napplications better, more reliable, more secure. We gain those insights by\nbuilding those applications. Building applications allowed us to understand\nhow to build database better. Building great databases made it much easier\nto build the cloud. there are a lot of databases that run the cloud. You\nbecome -- there's a database of our users, all of our resources are in\ndatabases. So the autonomous database, the Oracle Autonomous Database is\none of the reasons our cloud -- at some point, we're going to rerisen our\ncloud from Gen 2 cloud to the autonomous cloud. Right now, that would be\ntoo aggressive. We're not fully autonomous. But we're getting there. And\nbecause we were able to use a lot of our existing database technology,\nspecifically the autonomous database technology to make our cloud more\nscalable, more reliable. And by the way, when you eliminate human labor,\nwhen you have an autonomous database, you eliminate human labor, you save\nmoney, but you also eliminate human error and human mischief. So it makes\nyour cloud much more secure.\n\nOne of the reasons our cloud is more secure. One of the reasons our cloud\nis faster is because we have an autonomous database that runs it. So having\nall of these levels of technology allows us to solve a technical problem at\nthe right layer of the technology. Should we solve the problem in the\nnetwork fabric. Should we solve the problem with our cloud computer\ncontroller, something we have with other people that we embedded different\nhardware to run the cloud. We added -- we have different hardware\narchitecture to make it more secure and more reliable. So we've done\ninnovation in the network. We've done innovation in our host computing. We\nhave an autonomous nonstop Linux operating system that we built, the\nautonomous database that manages all the data in the cloud and so on. Being\nable to solve problems at different layers of the technology, understanding\nthe different layers of the technology allows us to build an integrated\nsolution that is faster, cheaper, more reliable than what our competitors\ncan do.\n\nUnknown Executive\n\nA telephonic replay of this conference call will be available for 24 hours\non our Investor Relations website. Thank you for joining us today. With\nthat, I'll turn the call back to Sarah for closing.\n\nOperatorThank you. This concludes today's conference. Thank you for\njoining. You may now disconnect.\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com (free of charge), and www.ratingsdirect.com and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Oracle Corporation NYSE:ORCL FQ4 2025 Earnings Call Transcripts Wednesday, June 11, 2025 9:00 PM GMT S&P Global Market Intelligence Estimates Presentation",
      "role_category": "Unknown"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Hello, and welcome to the Oracle Corporation Fourth Quarter and Full Year 2025 Earnings Call. [Operator Instructions] I would now like to turn the conference over to Ken Bond, Head of Investor Relations. Please go ahead.",
      "role_category": "Operator"
    },
    {
      "speaker": "Ken  Bond",
      "role": "Senior Vice President of Investor Relations",
      "text": "Senior Vice President of Investor Relations Thank you, Sarah, and good afternoon, everyone, and welcome to Oracle's Fourth Quarter and Fiscal Year 2025 Earnings Conference Call. A copy of the press release and financial tables, which includes a GAAP to non-GAAP reconciliation and other supplemental financial information can be viewed and downloaded from our Investor Relations website. Additionally, a list of many customers who purchased Oracle Cloud Services or went live on Oracle Cloud recently will be available from our Investor Relations website. On the call today are Chairman and Chief Technology Officer, Larry Ellison; and Chief Executive Officer, Safra Catz. As a reminder, today's discussion will include forward-looking statements, including predictions, expectations, estimates or other information that might be considered forward-looking. Throughout today's discussion, we will present some important factors relating to our business, which may potentially affect these forward-looking statements. These forward-looking statements are also subject to risks and uncertainties that may cause actual results to differ materially from the statements being made today. As a result, we caution you against placing undue reliance on these forward-looking statements, and we encourage you to review our most recent reports, including our 10-K and 10-Q and any applicable amendments for a complete discussion of these factors and other risks that may affect our future results or the market price of our stock. And finally, we are not obligating ourselves to revise our results or these forward-looking statements in light of new information or future events. Before taking questions, we will begin with a few prepared remarks. And with that, I'd like to turn the call over to Safra.",
      "role_category": "Executive"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Thanks, Ken, and good afternoon, everyone. As you can see, we had an excellent fourth quarter to finish out an amazing year with Q4 total revenue and EPS both exceeding my guidance. We are reporting our fiscal year-end results just 11 days after the last day of the quarter. Using Oracle Fusion, we continue to announce our quarterly and annual financial results faster than any other company in the S&P 500. Now a few years ago, I told you that we've reached a tipping point in our cloud transition and expected revenue growth to accelerate, and it has. In Q4, we hit double- digit revenue growth, and it's only going up from here, even as the company gets bigger. Our remaining performance obligations now stand at $138 billion, up $8 billion from last quarter and up 41% from last year, and yet the best is still to come. Our applications business was the first area we moved to the cloud more than a decade ago, and we are now the leader in enterprise back office with SaaS solutions for ERP, financials, EPM, HCM, supply chain and manufacturing. With the addition of over 100 AI agents, along with strong bookings and higher renewal rates for our strategic SaaS products, I expect the cloud applications growth rate will accelerate this coming year. Our infrastructure business was the next area to move to the cloud. we made engineering decisions that were much different from the other hyperscalers and that were better suited to the needs of enterprise customers, resulting in lower costs to them and giving them deployment flexibility. OCI has seen exceptional demand for infrastructure services and those contracted noncancelable bookings in RPO give us confidence that OCI revenue will grow over 70% this current year. Included in that is that Oracle Autonomous Database and the AI data platform Enterprises know that their AI needs demand the most capable database to manage a company's full data set. Further, with our AI and autonomous features, our customers can bring all their data together, make it available for LLMs and yet have the best security built in. In addition, our customers have the flexibility to run their Oracle databases in OCI, in private clouds or in partner clouds with our multi-cloud offering. But what is clear is that more customers will use the Oracle database to leverage AI. So -- as a result of the strength in our cloud applications and infrastructure, including database services, we are raising our revenue guidance for fiscal year '26 to over $67 billion, up 16% for the year. Now to the results. And as usual, I'll be discussing our financials using constant currency growth rates as it is how we manage the business. Total cloud revenue, SaaS plus IaaS was up 27% at $6.7 billion. And total cloud services and license support revenue for the quarter was $11.7 billion, up 14% IaaS revenue was $3 billion, up 52% on top of the 42% growth reported last year. OCI consumption revenue was up 62% and demand continues to dramatically outstrip supply. Our infrastructure cloud services now have an annualized revenue of nearly $12 billion. Cloud database services, which were up 31%, now have annualized revenue of $2.6 billion. Autonomous Database consumption revenue was up 47% on top of the 27% growth reported last year. As on-premise databases migrate to the cloud, either on OCI directly or through our database at cloud services with Azure, Google or AWS, we expect that cloud database revenues collectively will be the third driver of revenue growth alongside OCI and strategic SaaS. We are currently live in 23 cloud regions with database at cloud services and have another 47 planned. Database subscription revenues, which include database license support, were up 7%. Infrastructure subscription revenues in the quarter, which includes license support, were $6.7 billion, up 19% SaaS revenue was $3.7 billion, up 11%. Application subscription revenues, which include support, were $5 billion, up 8%. Our strategic back-office SaaS applications now have annualized revenues of $9.3 billion, and they were up 20%. Software license revenues were up 8% to $2 billion. So all in, total revenues for the quarter were $15.9 billion, up 11% from last year. Operating income grew 7%. Non-GAAP EPS was $1.70 in U.S. dollars, while GAAP EPS was USD 1.19 in U.S.. The non- GAAP tax rate for the quarter was 9.7%, higher than my 19.7%, which was higher than my 19% guidance. For the full fiscal year, total company revenue was $57.4 billion, up 9%. Total cloud services and license support revenue, which is entirely subscription-based and accounts for 77% of total revenue was $44 billion, up 12%. Total application subscription revenue grew 7% and infrastructure subscription revenues grew 17%. Total cloud services were up 24% to $24.5 billion. IaaS or cloud infrastructure revenue was up 51% to $10.2 billion for the quarter with consumption revenue up 59% from last year. SaaS revenue was up 10% to $14.3 billion for the year. Non- GAAP EPS for the full year was USD 6, up 9% and the full year operating income grew 9%. As mentioned, remaining performance obligation at the end of Q4 is now $138 billion, up 41% in USD. Further, our cloud RPO grew 56% on top of the 80% growth last year and now represents nearly 80% of total RPO and approximately 33% of total RPO is expected to be recognized as revenue over the next 12 months. For the year, operating cash flow was up 12% at $20.8 billion, and free cash flow was a negative $400 million with $21.2 billion of CapEx. Operating cash flow for Q4 was $6.2 billion, while free cash flow was a negative $2.9 billion with CapEx of $9.1 billion. The vast majority of our CapEx investments are for revenue-generating equipment that is going into data centers and not for land or buildings. I expect that FY '26 CapEx will be higher at over $25 billion as we work to meet demand from our backlog. As we bring more capacity online, our revenue and profit growth will further accelerate. At quarter end, we had $11.2 billion in cash and marketable securities. The short-term deferred revenue balance was $9.4 billion. We are committed to returning value to our shareholders through technical innovation, strategic acquisitions, stock repurchases, prudent use of debt and a dividend. This quarter, we repurchased a little over 1 million shares for a total of $150 million. And over the last 10 years, we've reduced shares outstanding by more than 1/3 at an average share price of just over $54. In addition, we have paid out dividends of $4.7 billion over the last 12 months, and the Board of Directors again declared a quarterly dividend of $0.50 per share. Since it's the beginning of FY '26, I'd like to comment on the financial acceleration we expect to see in the coming years. Between our $138 billion RPO and even larger pipeline, we have a clear line of sight to future revenue growth. So for fiscal year 2026, I expect that total cloud revenue will grow over 40% in constant currency, up from 24% in FY '25 I expect that cloud infrastructure revenue will grow over 70%, up from 51% in FY '25. I expect total revenue will be at least $67 billion, up 16% in constant currency and up more than $1 billion from our prior guidance. RPO is likely to grow more than 100% in fiscal '26. And lastly, I expect we will exceed the revenue growth target we previously provided for FY '27. Beyond FY '27, I'm even more confident in our ability to meet and likely exceed our previously provided FY '29 targets. We will provide a more fulsome update on our long-range financial targets at the Financial Analyst Meeting at Oracle Cloud World in Las Vegas in October. Now let me turn to my guidance for Q1, which I'll review on a non-GAAP basis. Now assuming currency exchange rates remain the same as they are now, currency should have a $0.02 positive effect on EPS and a flat to 1% positive effect on revenue depending on rounding. However, of course, the actual currency impact may be different. Total revenues are expected to grow from 11% to 13% in constant currency are expected to grow from 12% to 14% in U.S. dollars. Total cloud revenue is expected to grow from 26% to 30% in constant currency and U.S. dollars. Non-GAAP EPS is expected to grow between 4% to 6% and be between $1.44 and $1.48 in constant currency. Non- GAAP EPS is expected to grow between 5% to 7% and be between USD 1.46 and USD 1.50 in. Lastly, my EPS guidance assumes a base tax rate of 19%. However, onetime tax events could cause actual tax rates to vary. We had a great year. And this year, the one we're in now, will be better. Oracle is well on its way to being not only the world's largest cloud application company, but also one of the world's largest cloud infrastructure companies. And with that, I'll turn it over to Larry for his comments.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Thank you, Safra. Oracle's future is bright in this new era of cloud computing. Oracle will be the #1 cloud database company. Oracle will be the #1 cloud applications company, and Oracle will be the #1 builder and operator of cloud infrastructure data centers. We will build and operate more cloud infrastructure data centers than all of our cloud infrastructure competitors combined. First, database. Most of the world's most valuable data is stored in an Oracle database. All of those databases are moving to the cloud. Oracle's Cloud, Microsoft's Azure cloud, Amazon's cloud or Google's Cloud. Oracle runs everywhere. The latest vector version of the Oracle Database, Oracle 23 AI, is an AI data platform, the only database that can make all of the customer's data immediately available to all of the popular AI large language models while maintaining complete data privacy for the customer. As use of AI increases, so will Oracle's database market share. Oracle will be the largest and most profitable cloud applications company in the world. Oracle developed suites of integrated AI agent-based applications for ERP, for EPM, supply chain, manufacturing, human resources and customer engagement, plus industry applications for health care, banking, utilities, retail, hospitality and many other industries. We use the most modern application generators and AI database technology to build our application suite. And then we add AI and analytics using OpenAI, xAI, Google, Llama and other popular LLMs on top of that application data. No other company is even attempting to build the depth and breadth of AI- based applications that we have already built. Oracle will build more cloud infrastructure data centers than all of our infrastructure competitors combined. All of our OCI data centers from the smallest low-cost data center to the largest gigawatt AI training data center include all Oracle OCI capabilities. A large percentage of those capabilities are autonomous. So labor costs are minimized and human error is dramatically reduced. Oracle is already prospering in this new era of cloud computing and AI, and it's just the beginning. Back to you, Safra.",
      "role_category": "Executive"
    },
    {
      "speaker": "Ken  Bond",
      "role": "Senior Vice President of Investor RelationsThank you, Larry. Before we go",
      "text": "Senior Vice President of Investor RelationsThank you, Larry. Before we go to the Q&A, just to repeat one number. FY '25 cloud infrastructure revenue was up 51% to $10.2 billion for the year with consumption revenue up 59% from last year. Sarah, if you could please poll the audience for questions. Question and Answer",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] Your first question comes from Mark Moerdler with Bernstein.",
      "role_category": "Operator"
    },
    {
      "speaker": "Mark L. Moerdler",
      "role": "Sanford C. Bernstein & Co., LLC., Research Division",
      "text": "Sanford C. Bernstein & Co., LLC., Research Division Larry, Safra and the whole Oracle family, congratulations on the strong quarter and the strong year. You've been promising and are now starting to deliver extraordinary growth acceleration, something we've not seen at other very large software companies. Yet there's a lack of understanding across the street of your AI business. Can you give us color or break out any numbers to help investors understand the durability and profitability of the AI business?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Okay. Well, the interesting thing is a lot of people are talking about that they have all the data. So these other companies say they have all the data, so they can do AI really well. They can build all these AI agents on top of all of that data. The only problem with that statement is they don't have all the data we do. We have most of the world's valuable data. The vast majority of it is in an Oracle database. And the latest version of the Oracle database is an AI-centric piece of technology, a vector database called Oracle 23 AI. So what it does, it allows -- it's the key enabler for companies to use AI. Using AI, I mean, the current AI models are trained on the Internet, otherwise known as publicly available data. Do you think JPMorgan Chase makes all of their internal data publicly available? Do you think those AI models train on JPMorgan Chase's data? Companies want to be able to use AI models on top of their own data. That is essential. Oracle applications make all of the data inside the Oracle applications available to AI models like Rock or ChatGPT or all -- by the way, all the rest of them, from Google, from whomever, from Meta, Llama, all of us, we have all of those LLMs are in our cloud or in the Oracle Cloud. So this is our value proposition. Our database takes all of your data. our applications take all of your application data and make that data available to the most popular AI models, like if you like ChatGPT, you use ChatGPT. If you like Grock, you use Grok, you use that in the Oracle Cloud. We are the key enabler for enterprises to use their own data and AI models. No one else is doing that.",
      "role_category": "Executive"
    },
    {
      "speaker": "Mark L. Moerdler",
      "role": "Sanford C. Bernstein & Co., LLC., Research Division",
      "text": "Sanford C. Bernstein & Co., LLC., Research Division That makes sense.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO It's a huge -- this is not a small point. This is why our database business is going to grow dramatically. Think about it. You have to put all of your data into a database. So that database must be highly secure. It must be scalable. It must be economical. It must be reliable, 7 days a week, 24 hours a day. It has to be fall tolerant. It can never break. That's how Oracle got popular in the first place. But then it has to hold the data in a way that's consumable by the AI models. In other words, the data has to be vectorized and searchable by the AI models and you use that data to train up those models on your data? Who else is doing that. Let me answer the question, nobody.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from John DiFucci with Guggenheim.",
      "role_category": "Operator"
    },
    {
      "speaker": "John Stephen DiFucci",
      "role": "Guggenheim Securities, LLC, Research Division",
      "text": "Guggenheim Securities, LLC, Research Division Safra, your quote in that press release that you repeated on this call about next year was pretty amazing and a strong a statement as I've seen you make. And I've known you a long time. So putting that in print means a lot to me because I know it means a lot to you. Can you help us unpack that statement a bit? For instance, is Stargate part of the more than 70% growth you expect in IaaS in fiscal '26? And we don't know the timing of Stargate or even your financial share. Like we know there's big numbers out there, but not how much of it's yours or you're going to be involved. But is Stargate also in the RPO growth of more than 100% in fiscal '26? And any other color beyond Stargate to help us get our heads around those massive growth numbers for IaaS would be helpful.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Thanks, John. And yes, we have known each other a very long time, longer than to admit. So the reality is that Stargate is still in formation. The work -- there are a lot of partnerships we are in the middle of right now that are all part of this enormous growth rate. We are the destination for everyone who wants AI workloads who want database workloads and want -- want applications. We are really -- and all of that together comes in our RPO. We have so much in pipeline right now that -- and of course, we have so much in RPO, meaning those are noncancelable contracts, and we see the demand. I am still in a position where our supply is not meeting our demand. We actually currently are still waving off customers from -- or scheduling them out into the future so that we have enough supply to meet demand. This is a situation that we have not seen in our history. And the numbers themselves are so enormous. And the reason is because our technology is different. As Larry has said on previous calls, the cloud we built runs faster and has more capabilities than our competitors and that are built for enormous amounts of data. And so we are very much the destination of choice. As Stargate forms, that will contribute into all of this. But some of our partners, many of our partners, some of them will be in Stargate. Some are outside of Stargate. We really are working with many, many companies right now and have enormous pipeline as a result.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO So let me give you a couple of -- let me chime in here also a little bit. Let me surprise you with -- there are huge contracts that have nothing to do with even AI. We got a gigantic contract from Temu that would have been unprecedented, except for all the other gigantic contracts we've also been getting. But Temu is a very large company that's growing extremely rapidly. And they are basically moving their infrastructure to the Oracle Cloud. That was a very big contract. We're seeing huge growth in multi-cloud from the data centers we've already built and the data -- I mean, it's revenue, obviously, data centers we already built. And -- but the future -- the growth rate in multi-cloud is astonishing. In other words, our database is now moving very rapidly to the cloud, I think because -- a few reasons because the database has now all these AI capabilities, but also, quite frankly, now people can get it in whatever cloud they want. If you're dedicated to using Microsoft Azure, you can get the Oracle database and Microsoft Azure. The fully capable Oracle database in Microsoft Azure with all of our fanciest features, including the new AI features. You can get it at Google, you can get it in Amazon, you can get it at the Oracle Cloud. It's all the same in every place. And that's given our customers a lot of comfort that Oracle is not only where they store all of their current data, but they want to keep using the Oracle database and expand their use of the Oracle database and move all of that data to the cloud as quickly as they can, and they're now able to do it at the place of the cloud that they're choosing. So the database business is growing rapidly. This next generation of companies like ByteDance, TikTok, which obviously, we do business with them. Temu's another. But Uber, I mean, there are just lots of these companies. A bunch of the security companies have moved to the Oracle Cloud. It's a multi -- it's growth coming from many, many different directions.",
      "role_category": "Executive"
    },
    {
      "speaker": "John Stephen DiFucci",
      "role": "Guggenheim Securities, LLC, Research Division",
      "text": "Guggenheim Securities, LLC, Research Division So if I could just -- so Stargate is just part of it. There's a lot of things happening here. And -- but I just wanted -- just to clarify, it sounds like it's part of RPO, but is it also part of that 70% in IaaS revenue growth, too?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Well -- go ahead, Safra.",
      "role_category": "Executive"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Stargate is not formed yet, but some of our business with OpenAI, which is one of our partners in Stargate is part of our future very much so. But you understand, we work with OpenAI. We -- those are still small numbers in the scheme of everything else we're doing, but it will ultimately be bigger.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Okay. Next question, please -- let me add 1 little thing. If Stargate turns out to be everything is advertised, then we've understated our RPO growth.",
      "role_category": "Executive"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Correct.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from Ben Reitzes with Melius Research.",
      "role_category": "Operator"
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC Safra, Larry, great to be speaking with you today. Nice presentation. Your CapEx in the quarter was much higher than expected. I mean, $5 billion more than we expected to get to the $21 billion. And now you're thinking about it going to $25 billion. Just wanted a little more color on what it was spent on? How is it helping you yield more revenue? And how do you know 25% is the right number for this year? And Larry, you usually have some pretty good color on architecture when you answer this question. So I'm looking forward to that as well.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Okay. So let me start and let Larry make it perfect. The reality is that, as I mentioned on the call, our CapEx is usually about equipment. We're not -- we have building partners who charge us rent once they finished constructing things. And when we all of a sudden have higher CapEx, it means we are filling out data centers, and we are buying components to build our computers, which are different than other people's, and we are putting them on the floor. We had an opportunity to buy up and for deployment, and so we did. And we are putting out as much capacity as we possibly can as quickly as we can. I do believe that the $25 billion next year may turn out to be understated. So it is all to meet demand. We don't order, we don't build unless we've got orders for our capacity to be built out. And we have so much in orders right now that I actually expect, I believe I said on the call, over $25 billion this next quarter. And that is, again, to match demand.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Let me add, we recently got an order that said we'll take all the capacity you have wherever it is. it could be in Europe, it could be in Asia. We'll just take everything. I mean we never got an order like that before. We had to move things around. We did the best we could to give them the capacity they needed. The demand is astronomical. Now we have -- but we have to do this methodically. The reason demand continues to outstrip supply is we can only build these data centers, build these computers so fast. And we're also doing a lot of engineering around high-speed networking. You'll see us making -- we are making large engineering investments to speed up the networking, the reliability of the network and lower the cost of the networking. So we're doing a bunch of things -- we are doing a bunch of things to lower our CapEx costs. But even if we do that, CapEx is going to go up because the demand right now seems almost insatiable. I mean I don't know how to describe it. I've never seen anything remotely like this. I mean people are calling up and asking us, please, can you find us more capacity. We'll take it wherever. It's in Malaysia, we'll take it fine. We'll take it there. We got some wherever.",
      "role_category": "Executive"
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC Are you having trouble getting GPUs?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director No.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO No, not right now. No.",
      "role_category": "Executive"
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC Got it. Appreciate it.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from Siti Panigrahi with Mizuho.",
      "role_category": "Operator"
    },
    {
      "speaker": "Sitikantha  Panigrahi",
      "role": "Mizuho Securities USA LLC, Research Division",
      "text": "Mizuho Securities USA LLC, Research Division Congratulations on a strong Q4 and impressive guidance. I want to go back to the cloud database, mainly you have massive database on on-prem. So what are -- what are you hearing from customers in terms of migrating to cloud. Now you have multi-cloud strategy, you have dedicated alloy customer. And Safra, what's your expectation on the cloud database revenue contribution are driving that 70% growth of OCI in fiscal '26?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Okay. Let me just start. So first of all, the database business is really healthy, really growing. In fact, you even see it in the number that I think folks didn't think was possible, which is in license. You should understand that when our customers are buying more licenses, that actually means often that they want to use the bring your own license pricing to go to the cloud. So database support is up, is solid. License is up, all the cloud metrics, autonomous, consumption, Oracle Cloud, all of multi-cloud is basically using up all capacity that gets put out there. So the Oracle database is on fire. And it is only the beginning. I want to remind you what a significant and large business it is and the bulk of it is still on- premise. As Larry said, now that you can have it in any of the clouds you like with the database at Oracle in all the other clouds also beyond just OCI or you can deploy it at cloud customer, another place where the numbers are enormous in growth rates. So consumption going way up, more licensing, more bookings and a lot of demand. And the database side of the world for all the reasons Larry said, is the -- is just a superb business and extremely compelling, especially to the extent you want to leverage artificial intelligence?",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO You asked for a number or an easy number to figure out so let's say, 10% -- or $10 billion of our support revenue -- our database support revenue, moves to the cloud. So that becomes at least $50 billion because it includes all the computers and all the networking and all of that. So the support was just 20% of the license fee. So you move $10 billion of our database to the cloud, it becomes at least $50 billion in cloud revenue. It's almost as big as Oracle as now.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from Raimo Lenschow with Barclays.",
      "role_category": "Operator"
    },
    {
      "speaker": "Raimo  Lenschow",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division Congrats as well. The one subject we haven't really talked about was applications, but with all the excitement around OCI, like I think you don't get enough credit on applications. Can you talk a little bit about what's going on there because I had to go back in my model quite a bit to see 22% growth on Fusion and the outlook looks really strong as well, and you talked about accelerating growth there. With all the worries about tariffs and stuff like that, I kind of I'm surprised to see kind of these very, very good numbers from you. Can you maybe talk about that a little bit?",
      "role_category": "Analyst"
    },
    {
      "speaker": "Safra Ada Catz",
      "role": "CEO & Director",
      "text": "CEO & Director Sure. Tariffs have no impact really at all to play in this. What it does allow our customers to do is do what I do when I announce on a year on day 11 is to be much more -- really much better run and have a better idea of where their business is and how it's doing and to do more and spend a lot less. What you're seeing now, and it hasn't been obvious in the numbers because, as you know, we have our strategic SaaS products, and we break that down for you in the release to some extent. And those are going gangbusters. And we've had other things in the numbers that have made you not be able to really see. We have some nonstrategic products. And in addition, we've also had an advertising business, which we are now lapping. I stopped even mentioning it because what's the difference, a few hundred million. But the reality is what you're starting to see is our strategic SaaS products as they roll out in our customer sites and as they ramp up, they're very, very popular. They're obviously compelling because only if you're in the cloud, can you use the AI capabilities. See many customers are still on on-premise ERP products. those can't really use the advanced AgentX and AI capabilities. So if you want to use that and many do for automation and to do more spend less, you've got to move to Fusion or NetSuite. And those are just very, very compelling, and it's just now starting to show through the noise.",
      "role_category": "Executive"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Look, I would add -- let me add one thing, which is companies don't really enjoy buying applications from 5 different vendors and then making all of those applications work together. So some companies, not all, but some companies are saying, Oracle, you build these integrated suites of applications, and they're all -- and they are all AI agent-based applications. So they're modern applications, they're modern cloud applications. And -- but all of your applications are engineered to work with one another. So our ERP and EPM and supply chain manufacturing, human resources, customer engagement, all those apps are designed as a single suite of applications to run an enterprise or government agency. And all those pieces then work together. So there's no cost of integrating those applications. So we're seeing a lot of companies buying -- basically saying, I'm going to go all Oracle. I'm going to buy the complete Oracle suite for ERP, EPM, supply chain, manufacturing. A lot of people don't have manufacturing, supply chain, human report sources and customer engagement. They're picking us -- if they pick our back-office applications, they'll sometimes pick our front office applications over Salesforce as a result of that. And our customer engagement applications are getting better and better. We continue to invest in those. And our intent is to give our -- some of our biggest customers a one-stop shop where they can buy the entire suite to run their enterprise from us. And that gets rid of a lot of headaches. Everything is in the same database. Everything comes with the same AI data platform with it. All the analytics are there, everything is there. You don't have to do the system integration. You don't have to fit -- buy a bunch of pieces and make them work together. That has been our strategy for some time, and that's all coming together as a bunch of companies are not successfully navigating this difficult, admittedly difficult transition from on-premise to the cloud. There have been a lot of companies that have not done it very well, and they are casualties, and we're picking up a lot of their users. So the application business is very, very promising. And then I add Oracle Health and Oracle Banking, Oracle Retail, hospitality, the different industries on top of that. There's no other apps company that is trying to build such a broad-based integrated suite of AI cloud applications. Who's closest? There's no one doing -- no one attempting to do what we're doing.",
      "role_category": "Executive"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Your final question comes from Brad Zelnick with Deutsche Bank.",
      "role_category": "Operator"
    },
    {
      "speaker": "Brad Alan Zelnick",
      "role": "Deutsche Bank AG, Research Division",
      "text": "Deutsche Bank AG, Research Division Congrats. Safra, Larry, the things you've been telling us would happen are clearly happening and it's amazing. As we go forward, Larry, Oracle has always had the advantage of being the only vendor with enterprise-grade technology from apps, all the way down to infrastructure -- and since the Sunday is optimized even down to the silicon, why does the full stack nature of what you do remain important as we enter this new era of computing.",
      "role_category": "Analyst"
    },
    {
      "speaker": "Lawrence J. Ellison",
      "role": "Co-Founder, Chairman & CTO",
      "text": "Co-Founder, Chairman & CTO Well, such an interesting question because I think to some degree, people thought our biggest weakness is that we were just spread too thin. We're trying to do infrastructure -- I mean, database initially, infrastructure and then applications on top of that infrastructure. But what made our database so good? I can argue there -- we made some good technology decisions. But the other thing that made our database so good is we had -- we developed apps on top of our own database. In the same company, you have people using the database to develop applications and the people who are developing that database. And if the applications found features missing from the database, they found capabilities they wish were in the database that would make their applications better, more reliable, more secure. We gain those insights by building those applications. Building applications allowed us to understand how to build database better. Building great databases made it much easier to build the cloud. there are a lot of databases that run the cloud. You become -- there's a database of our users, all of our resources are in databases. So the autonomous database, the Oracle Autonomous Database is one of the reasons our cloud -- at some point, we're going to rerisen our cloud from Gen 2 cloud to the autonomous cloud. Right now, that would be too aggressive. We're not fully autonomous. But we're getting there. And because we were able to use a lot of our existing database technology, specifically the autonomous database technology to make our cloud more scalable, more reliable. And by the way, when you eliminate human labor, when you have an autonomous database, you eliminate human labor, you save money, but you also eliminate human error and human mischief. So it makes your cloud much more secure. One of the reasons our cloud is more secure. One of the reasons our cloud is faster is because we have an autonomous database that runs it. So having all of these levels of technology allows us to solve a technical problem at the right layer of the technology. Should we solve the problem in the network fabric. Should we solve the problem with our cloud computer controller, something we have with other people that we embedded different hardware to run the cloud. We added -- we have different hardware architecture to make it more secure and more reliable. So we've done innovation in the network. We've done innovation in our host computing. We have an autonomous nonstop Linux operating system that we built, the autonomous database that manages all the data in the cloud and so on. Being able to solve problems at different layers of the technology, understanding the different layers of the technology allows us to build an integrated solution that is faster, cheaper, more reliable than what our competitors can do. Unknown Executive A telephonic replay of this conference call will be available for 24 hours on our Investor Relations website. Thank you for joining us today. With that, I'll turn the call back to Sarah for closing. OperatorThank you. This concludes today's conference. Thank you for joining. You may now disconnect. Copyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees. © 2025 S&P Global Market Intelligence.",
      "role_category": "Executive"
    }
  ],
  "source_file": "Oracle Corporation, Q4 2025 Earnings Call, Jun 11, 2025.rtf"
}