{
  "event_id": "AMD_2025-08-05",
  "ticker": "AMD",
  "company": "Advanced Micro Devices, Inc.",
  "quarter": 2,
  "fiscal_year": 2025,
  "call_date": "2025-08-05",
  "call_start_ts": "2025-08-05 21:00:00+00:00",
  "raw_text": "\n|[pic]                     |\n\nAdvanced Micro Devices, Inc. NasdaqGS:AMD\nFQ2 2025 Earnings Call Transcripts\nTuesday, August 5, 2025 9:00 PM GMT\nS&P Global Market Intelligence Estimates\n|      |-FQ2 2025-           |-FQ3  |-FY   |-FY   |\n|      |                     |2025- |2025- |2026- |\n|                              |CONSENSUS      |ACTUAL         |SURPRISE       |\n|                   |CONSENSUS          |ACTUAL             |SURPRISE           |\n|FQ3 2024           |0.92               |0.92               |[pic]0.00 %        |\n|FQ4 2024           |1.09               |1.09               |[pic]0.00 %        |\n|FQ1 2025           |0.93               |0.96               |[pic]3.23 %        |\n|FQ2 2025           |0.48               |0.48               |[pic]0.00 %        |\n\n|Table of Contents                                     |   |\n|Call Participants          |..............................................|3      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Presentation               |..............................................|4      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Question and Answer        |..............................................|10     |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|                                                                                  |\n|Call Participants                                                                 |\n|                           |                           |                           |\n|EXECUTIVES                 |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Jean X. Hu                 |                           |                           |\n|Executive VP, CFO &        |                           |                           |\n|Treasurer                  |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Lisa T. Su                 |                           |                           |\n|Chair, President & CEO     |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Matthew D. Ramsay          |                           |                           |\n|Vice President of Financial|                           |                           |\n|Strategy & Investor        |                           |                           |\n|Relations                  |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|ANALYSTS                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Aaron Christopher Rakers   |                           |                           |\n|Wells Fargo Securities,    |                           |                           |\n|LLC, Research Division     |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Benjamin Alexander Reitzes |                           |                           |\n|                           |                           |                           |\n|Melius Research LLC        |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Christopher James Muse     |                           |                           |\n|Cantor Fitzgerald & Co.,   |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Joseph Lawrence Moore      |                           |                           |\n|Morgan Stanley, Research   |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Joshua Louis Buchalter     |                           |                           |\n|TD Cowen, Research Division|                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Ross Clark Seymore         |                           |                           |\n|Deutsche Bank AG, Research |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Thomas James O'Malley      |                           |                           |\n|Barclays Bank PLC, Research|                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Timothy Michael Arcuri     |                           |                           |\n|UBS Investment Bank,       |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Vivek  Arya                |                           |                           |\n|BofA Securities, Research  |                           |                           |\n|Division                   |                           |                           |\n|                                                                                  |\n\n\nPresentation\n\n\nOperator\n\nGreetings, and welcome to the AMD Second Quarter 2025 Conference Call.\n[Operator Instructions] As a reminder, this conference is being recorded.\nAnd it is now my pleasure to introduce to you, Matthew Ramsay, VP of\nInvestor Relations and Financial Strategy. Thank you, sir. Please go ahead.\n\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor Relations\n\nThank you, and welcome to AMD's 2025 Second Quarter Financial Results\nConference Call. By now, you should have had the opportunity to review a\ncopy of our earnings press release and the accompanying slides. If you have\nnot had the chance to review these materials, they can be found on the\nInvestor Relations page of amd.com.\n\n\nWe will refer primarily to non-GAAP financial measures during today's call.\nThe full non-GAAP to GAAP reconciliations are available in today's press\nrelease and slides posted on our website.\n\n\nParticipants in today's conference call are Dr. Lisa Su, our Chair and\nChief Executive Officer; and Jean Hu, our Executive Vice President, Chief\nFinancial Officer and Treasurer. This is a live call and will be replayed\nvia webcast on our website.\n\n\nBefore we begin, I would like to note that Jean Hu, Executive Vice\nPresident, Chief Financial Officer and Treasurer, will present at Citi's\n2025 Global TMT Conference on Wednesday, September 3; and Forrest Norrod,\nExecutive Vice President and General Manager of Data Center Solutions\nbusiness unit, will present at the Goldman Sachs Communacopia and\nTechnology Conference on Monday, September 8.\n\n\nToday's discussion contains forward-looking statements based on our current\nbeliefs, assumptions and expectations, speaks only as of today and as such,\ninvolve risks and uncertainties that could cause actual results to differ\nmaterially from our current expectations. Please refer to the cautionary\nstatement in our press release for more information on factors that could\ncause actual results to differ materially.\n\n\nWith that, I will hand the call over to Lisa.\n\n\nLisa T. Su\nChair, President & CEO\n\nThank you, Matt, and good afternoon to all those listening today. We\ndelivered very strong second quarter results, with revenue exceeding the\nmidpoint of guidance as higher EPYC and Ryzen processor sales more than\noffset headwinds from export controls that impacted Instinct sales. We set\nrecords for both EPYC and Ryzen CPU sales, reflecting the broad-based\ndemand for our differentiated high-performance data center, PC and embedded\nprocessors.\n\n\nSecond quarter revenue increased 32% year-over-year      to a record $7.7\nbillion, and we delivered over $1 billion in free cash flow. Excluding the\n$800 million inventory write-down related to data center AI export\ncontrols, gross margin was 54%, marking our sixth consecutive quarter of\nyear-over-year margin expansion led by a richer product mix.\n\n\nTurning to the segments. Data Center segment revenue increased 14% year-\nover-year to $3.2 billion. We saw robust demand across our EPYC portfolio\nto power cloud and enterprise workloads and increasingly for emerging AI\nuse cases. In particular, adoption of agentic AI is creating additional\ndemand for general purpose compute infrastructure as customers quickly\nrealize that each token generated by a GPU triggers multiple CPU-intensive\ntasks. Against this backdrop, fifth-gen EPYC Turin shipments ramped\nsignificantly, and we had sustained demand for our prior-generation EPYC\nprocessors. As a result, we set records for both cloud and enterprise CPU\nsales and delivered our 33rd consecutive quarter of year-over-year share\ngains.\n\n\nIn cloud, adoption expanded with the largest hyperscalers as they deployed\nEPYC to power more of their mission-critical infrastructure, services and\npublic cloud products. More than 100 new AMD-powered cloud instances\nlaunched in the quarter, including multiple Turin instances from Google and\nOracle Cloud that deliver up to twice the performance of our previous\ngeneration, which were already the industry's highest-performing offerings.\nThere are now nearly 1,200 EPYC cloud instances available globally as\nproviders continue expanding both the breadth and regional availability of\ntheir AMD offerings. This continued expansion is accelerating enterprise\nadoption of EPYC in the cloud, with deployments growing significantly from\nthe prior quarter as we closed large wins with dozens of large aerospace,\nstreaming, financial services, retail and energy companies.\n\n\nEPYC adoption also grew with telecom customers as providers modernize their\ninfrastructure for next-generation networks. For example, KDDI announced\nplans to deploy EPYC processors to power its 5G virtualized network. And\nNokia selected EPYC for its cloud platform used by service providers to\nbuild, deploy and manage core network functions.\n\n\nTurning to enterprise on-prem adoption. HPE, Dell, Lenovo and Super Micro\nlaunched 28 new Turin platforms in the quarter that deliver leadership\nperformance, efficiency and TCO across a wide range of enterprise\nworkloads. EPYC enterprise deployments grew significantly from the prior\nquarter, supported by new wins with large technology, automotive,\nmanufacturing, financial services and public sector customers. To extend\nour momentum with SMB and hosted IT service customers, we launched the EPYC\n4005 Series that combine enterprise-grade performance and features and cost-\noptimized platforms purpose built for smaller scale deployments.\n\n\nTurning to HPC. AMD now powers more than 1/3 of the world's fastest\nsupercomputers, including El Capitan and Frontier, which retained the #1\nand #2 spots on the latest Top 500 list. We also power 12 of the top 20\nsystems on the Green500, highlighting the performance per watt advantages\nof EPYC and Instinct for large-scale deployments. Looking ahead, we remain\nbullish on our server CPU business, driven by durable tailwinds, including\ngrowing demand for cloud and on-prem compute, sustained share gains, and\nthe growing investments in general purpose infrastructure required to\nenable AI.\n\n\nTurning to our Data Center AI business. Revenue declined year-over-year as\nU.S. export restrictions effectively eliminated MI308 sales to China, and\nwe began transitioning to our next-generation MI350 series accelerators. We\nmade solid progress with MI300 and MI325 in the quarter, closing new wins\nand expanding adoption with Tier 1 customers, next-generation AI cloud\nproviders and end users. Today, 7 of the top 10 model builders and AI\ncompanies use Instinct, underscoring the performance and TCO advantages of\nour Data Center AI solutions.\n\n\nWe launched our Instinct MI350 series with industry-leading memory\nbandwidth and capacity and broad adoption across hyperscalers, AI companies\nand OEMs. From a competitive standpoint, MI355 matches or exceeds B200 in\ncritical training and inference workloads and delivers comparable\nperformance to GB200 for key workloads at significantly lower cost and\ncomplexity. For upscale inferencing, MI355 delivers up to 40% more tokens\nper dollar, providing leadership performance and clear TCO advantages.\n\n\nWith the MI350 series, we're also expanding our system-level capabilities\nto support deployments powered by AMD CPUs, GPUs and NICs. As one example,\nOracle is building a 27,000-plus node AI cluster combining MI355X\naccelerators, fifth-gen EPYC Turin CPUs and Pollara 400 SmartNICs. We began\nvolume production of the MI350 series ahead of schedule in June and expect\na steep production ramp in the second half of the year to support large-\nscale production deployments with multiple customers.\n\n\nOur sovereign AI engagements accelerated in the quarter as governments\naround the world adopt AMD technology to build secure AI infrastructure and\nadvance their economies. As one example, we announced a multibillion-dollar\ncollaboration with HUMAIN to build AI infrastructure powered entirely on\nAMD CPUs, GPUs and software. Initial deployments are underway in key\nregions with quarterly expansions planned over the coming years. In\naddition, we have more than 40 active engagements globally and see\nsignificant opportunities to power an increasingly larger portion of\nnational computing centers and sovereign AI initiatives.\n\n\nOn the AI software front, we made significant progress this quarter\nincreasing the performance, improving the usability and expanding the\nadoption of ROCm. We announced ROCm 7 with major upgrades across every\nlayer of the stack, delivering more than 3x higher inferencing and training\nperformance compared to our prior generation and adding support for large-\nscale training, distributed inference and lower precision data types.\n\n\nTo deepen developer engagement, we introduced nightly ROCm builds and\nexpanded access to Instinct compute infrastructure, including launching our\nfirst developer cloud that provides preconfigured containers for instant\naccess to AMD GPUs. We also expanded native support for ROCm across key\nframeworks, including vLLM and SGLang, enabling Frontier models like Llama\n4, Gemma 3 and DeepSeek-R1 to launch with day 0 AMD support. To accelerate\nenterprise adoption, we introduced ROCm Enterprise AI, a full-stack\nplatform that integrates seamlessly with existing IT infrastructure and\nincludes everything needed for an enterprise to deploy, manage and scale AI\nacross their business.\n\n\nLooking ahead, the development of our next-generation MI400 series is\nprogressing rapidly. These are the most advanced GPUs we have ever built\nwith up to 40 petaflops of FP4 AI performance and 50% more memory, memory\nbandwidth and scale-out throughput than the competition. With the MI400\nseries, we're bringing together everything we've learned across silicon,\nsoftware and systems to deliver Helios, a full-stack rack scale AI\nplatform. Helios is purpose built for the most demanding AI workloads with\neach rack connecting up to 72 GPUs that can operate as a single massive AI\naccelerator. Helios is expected to deliver up to a 10x generational\nperformance increase for the most advanced Frontier models, and we believe\nit will be the highest-performance AI system in the world when it launches.\nMI400 series development is progressing well towards our planned launch in\n2026, with significant interest in large-scale deployments from multiple\nhigh-profile customers.\n\n\nTo accelerate our development, we have invested significantly to expand our\nAI software and hardware capabilities, both organically and inorganically\nwith a number of acquisitions and strategic investments. We strengthened\nour software stack last quarter with the addition of the Brium and Lamini\nteams, building on our acquisitions of Nod.ai, Mipsology, and Silo AI.\n\n\nOn the hardware side, we added a world-class rack and data center scale\ndesign team in the second quarter with our acquisition of ZT Systems. The\nZT team is integrated seamlessly, and they are actively engaging with\nmultiple customers to accelerate deployments of our Helios solutions at\nscale. We also announced last quarter that Sanmina intends to acquire ZT's\nU.S.-based manufacturing business, becoming our lead partner for AI rack\nmanufacturing.\n\n\nTurning to the AI regulatory environment. Earlier this quarter, we were\nnotified by the Department of Commerce that it is moving forward with the\nreview of our license applications to export MI308 to China. We appreciate\nthe focus the Trump administration is placing on assuring that the U.S.\ntechnology remains central to global AI infrastructure, and we expect to\nresume MI308 shipments as licenses are approved, subject to end customer\ndemand and supply chain readiness.\n\n\nAs our licenses are still under review, we are not including any MI308\nrevenue in our third quarter guidance. Despite that, we expect Instinct\nrevenue to grow year-over-year in the third quarter, driven by the ramp of\nMI350 at multiple customers.\n\n\nIn Client and Gaming, segment revenue increased 69% year-over-year to $3.6\nbillion, driven by record client CPU sales and strong demand for our semi-\ncustom game console SoCs and Radeon GPUs. Client revenue increased 67% year-\nover-year to $2.5 billion, led by record desktop CPU sales. Demand for our\nlatest-generation Ryzen 9000 series was strong, especially for our\ndifferentiated X3D processors. We delivered record desktop channel CPU\nsales as Ryzen processors consistently topped the best-selling CPU lists at\nmajor global e-tailers throughout the quarter.\n\n\nWe also expanded our Zen 5 desktop portfolio with the launch of our latest\nThreadripper processors that feature up to 96 cores and deliver up to\ndouble the performance of the competition in many popular content creation\nand design workloads. In mobile, demand for AMD-powered notebooks was\nstrong with sellout growing by a large double-digit percentage year-over-\nyear. We drove a richer mix of higher ASP mobile parts year-over-year as we\nexpanded our share in the premium notebook segment where our Ryzen AI 300\nCPUs deliver leadership performance and value for both general purpose and\nAI workloads.\n\n\nIn commercial PCs, Ryzen adoption accelerated as OEM consumption increased\nmore than 25% year-over-year. We saw strong sell-through for AMD commercial\nnotebooks with Lenovo and HP and a significant uptick in Dell sales as they\nramp availability of their AMD commercial portfolio. We also closed new\nenterprise wins with Forbes 2000 pharma, tech, automotive, financial\nservices, aerospace and health care companies. We expect to continue\ngrowing our commercial client share based on the strength of our product\nportfolio and expanded breadth of OEM offerings. Looking more broadly, we\nremain confident we can continue growing client processor revenue ahead of\nthe market over the coming quarters, driven by increased adoption of our\ndesktop and notebook products, growing commercial momentum and a richer\nproduct mix.\n\n\nIn Gaming, revenue increased 73% year-over-year to $1.1 billion. Semi-\ncustom revenue increased by a large double-digit percentage year-over-year\nas console inventories normalized and our customers began preparing for the\nholiday season. We announced a new multiyear collaboration with Microsoft\nfor custom chips that will power the next generation of Xbox devices,\nincluding consoles, PCs and handhelds. We also deepened our collaboration\nwith Sony through Project Amethyst, a co-engineering program that will use\nmachine learning to power the next wave of immersive gaming experiences.\n\n\nIn PC gaming, demand for our latest-generation Radeon 9000 series GPUs was\nvery strong, with desktop GPU sell-through accelerating in the quarter as\ndemand outpaced supply. We launched the Radeon 9600 XT, extending the\nperformance advantages of RDNA 4 to mainstream gamers and delivering a\nsignificant uplift in gaming performance, including more than double the\nray tracing of our prior generation. As part of our end-to-end AI strategy,\nwe introduced the Radeon AI Pro R9700 GPU for local inferencing, model fine-\ntuning and other data-intensive workloads. The R9700 features more memory,\nfull ROCm support and multi-GPU scalability, enabling advanced AI\ndevelopment and deployment directly on the desktop.\n\n\nTurning to our Embedded segment. Revenue decreased 4% year-over-year to\n$824 million. Demand continues recovering gradually with sell-through in\nthe second quarter picking up as strength in most markets was offset by a\nfew pockets of softness in inventory reduction actions largely with\nindustrial customers. We expanded our Embedded portfolio with the first\nproduction shipments of Spartan UltraScale+ FPGAs that deliver leadership\nperformance and advanced security for cost-sensitive low-power\napplications.\n\n\nAdoption of our Versal adaptive SoCs continues expanding in high-end\napplications including next-generation robotaxi platforms developed by\nBosch in Europe, where Versal serves as a high-performance controller,\nenabling real-time processing, security and encryption in fully electric\nautomated vehicles. Looking ahead, we expect improving demand in the test\nand measurement, communications, and aerospace markets will drive a return\nto sequential growth in the second half of 2025.\n\n\nLonger term, design win momentum continues to build, tracking ahead of this\npoint last year and putting us on pace to pass the record $14 billion in\ndesign wins we achieved in 2024. In summary, demand is very strong across\nour product portfolio, and we are well positioned to deliver significant\ngrowth in the second half of the year, led by the steep ramp of MI350\nseries accelerators and ongoing EPYC and Ryzen share gains.\n\n\nOur server and PC CPU businesses are accelerating, driven by growing demand\nfor high-performance compute, sustained share gains, the strength of our\nproduct portfolio and expanded go-to-market investments. Our Embedded and\nGaming businesses are returning to growth and are well positioned for long-\nterm success, supported by strong design win momentum. And in AI, we are\nseeing strong adoption of our MI350 series and ROCm 7 as we deliver\nleadership performance and TCO advantages across a broader range of\nworkloads and ramp deployments with an expanded set of cloud and enterprise\ncustomers.\n\n\nLooking ahead, we see a clear path to scaling our AI business to tens of\nbillions of dollars in annual revenue. We are very excited about our next-\ngeneration MI400 series, which is another giant step forward on our road\nmap and has been designed to deliver leadership performance at the chip,\nserver and rack levels. Customer interest for the MI400 series is very\nstrong, and we are actively engaging with an expanding set of customers to\nsupport large-scale deployments in 2026.\n\n\nWe are in the early stages of an industry-wide AI transformation that will\ndrive a step function increase in compute demand across all of our markets,\npositioning us for significant revenue and earnings growth over the coming\nyears.\n\n\nNow I'd like to turn the call over to Jean to provide some additional color\non our second quarter results. Jean?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nThank you, Lisa, and good afternoon, everyone. I'll start with a review of\nour financial results and then provide our outlook for the third quarter of\nfiscal 2025. We are pleased with our strong second quarter financial\nresults. We delivered record revenue of $7.7 billion, exceeding the middle\npoint of our guidance, up 32% year-over-year, reflecting strong momentum\nacross our business. Record sales of Ryzen and EPYC processors and higher\nsemi-custom shipments more than offset the impact of the U.S. export\ncontrols, restricting MI308 sales to China.\n\n\nRevenue increased 3% sequentially due to strong growth in the Client and\nthe Gaming segment, partially offset by the Data Center revenue decrease\ndue to export controls. Gross margin was 43%, down 10 points from 53% a\nyear ago. The decrease was due to the $800 million inventory and related\ncharges associated with the export restrictions. Excluding this charge, non-\nGAAP gross margin would have been approximately 54%.\n\n\nOperating expenses were approximately $2.4 billion, an increase of 32% year-\nover-year as we continue to invest aggressively in go-to-market activities\nfor revenue growth and in R&D to capitalize on significant future AI\nexpansion opportunities. Operating income was $897 million, representing a\n12% operating margin compared to $1.3 billion or 22% a year ago. The\ndecline was primarily due to the inventory and related charges. Taxes,\ninterest expense and other totaled $126 million. For the second quarter of\n2025, diluted earnings per share were $0.48 compared to $0.69 a year ago.\nThe inventory and related charges reduced earnings per share by\napproximately $0.43.\n\n\nNow turning to our reportable segment, starting with Data Center. Data\nCenter segment revenue was $3.2 billion, up 14% year-over-year, driven by\nstrong EPYC CPU revenue and share gains across both cloud and enterprise\ncustomers. On a sequential basis, Data Center revenue decreased 12% due to\nthe impact of the export controls on MI308. The Data Center segment\noperating loss was $155 million compared to operating income of $743\nmillion a year ago or 26% of revenue. The loss was primarily due to the\ninventory and related charges.\n\n\nClient and Gaming segment revenue was $3.6 billion, up 69% year-over-year\nand 20% sequentially, driven by record client CPU sales and strong demand\nfor our PC and console gaming products. In the Client business, revenue was\na record of $2.5 billion, up 67% year-over-year, driven by record sales of\nour Ryzen desktop CPUs and a richer product mix. Gaming revenue rose to\n$1.1 billion, up 73% year-over-year, reflecting strong demand for our newly\nlaunched gaming GPUs and higher semi-custom revenue as inventory has now\nnormalized and the customers prepare for the holiday season. Client and\nGaming segment operating income was $767 million or 21% of revenue compared\nto $166 million or 8% a year ago, driven by richer Client product mix and\noperating leverage on higher revenue.\n\n\nEmbedded segment revenue was $824 million, down 4% year-over-year and flat\nsequentially as Embedded end market demand remains mixed. Embedded segment\noperating income was $275 million or 33% of revenue compared to $345\nmillion or 40% a year ago. The decline in operating income was primarily\ndue to product mix.\n\n\nBefore I review the balance sheet and cash flow, as a reminder, we closed\nthe acquisition of ZT Systems early in the second quarter. As we had\nannounced our intent to divest the ZT manufacturing business, the financial\nresults of the ZT manufacturing business are reported separately in our\nfinancial statement as discontinued operations and are excluded from our\nnon-GAAP financials. Subsequently, in May, we entered into agreement with\nSanmina Corporation to sell the ZT manufacturing business for $3 billion in\ncash and stock, inclusive of contingent payment. The transaction is\nexpected to close near the end of 2025, subject to regulatory approvals and\nthe customary closing conditions.\n\n\nTurning to the balance sheet and cash flow. During the quarter, we\ngenerated $1.5 billion in cash from operating activities of continuing\noperations, and free cash flow was a record of $1.2 billion. We returned\n$478 million to shareholders through share repurchase, resulting in $1.2\nbillion in share repurchases for the first half of 2025. In May, our Board\nof Directors approved an additional $6 billion authorization. Exiting the\nquarter, we have $9.5 billion remaining under our share repurchase program.\n\n\n\nAt the end of the quarter, cash, cash equivalents and short-term investment\nwere $5.9 billion. Our long-term debt was $3.2 billion during the quarter.\nWe paid down $950 million of commercial paper used to finance the ZT\nSystems acquisition close.\n\n\nNow turning to our third quarter 2025 outlook. Please note that our third\nquarter outlook does not include any revenue from AMD Instinct MI308\nshipment to China as our license applications are currently under review by\nU.S. government. For the third quarter of 2025, we expect revenue to be\napproximately $8.7 billion, plus or minus $300 million. The midpoint of our\nguidance represents approximately 28% year-over-year revenue growth, driven\nby strong double-digit growth in our Client and Gaming, and Data Center\nsegments.\n\n\nSequentially, we expect revenue to grow by approximately 13%, driven by\nstrong double-digit growth in the Data Center segment with the ramp of our\nAMD Instinct MI350 series GPU products; modest growth in our Client and\nGaming segment, with Client revenue increasing and the Gaming revenue to be\nflattish; and our Embedded segment revenue to return to growth. In\naddition, we expect third quarter non-GAAP gross margin to be approximately\n54%, and we expect non-GAAP operating expenses to be approximately $2.55\nbillion. We expect net interest and other expenses to be a gain of\napproximately $10 million. We expect our non-GAAP effective tax rate to be\n13%, and diluted share count is expected to be approximately 1.63 billion\nshares.\n\n\nIn closing, we executed very well in the first half of the year, delivering\nrecord revenue and building strong momentum for growth in the second half.\nThe strategic investments we are making position us to capitalize on the\nexpanding AI opportunities across all our end markets, driving sustainable\nlong-term revenue growth and earnings expansion for compelling value\ncreation.\n\n\nWith that, I'll turn it back to Matt for the Q&A session.\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor RelationsOperator, will you\nplease poll the audience for questions? Thank you.\n\n\nQuestion and Answer\n\n\nOperator\n\n[Operator Instructions] And the first question comes from the line of\nThomas O'Malley with Barclays.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nLisa, I want to start on the Client business. So you had previously laid\nout a second half outlook that was roughly flattish with the first half as\nyou're kind of protecting against some pull forwards. So first, do you\nthink that your Q2 results included some pull forwards and the second half\nshould still be flattish? And longer term after the Intel commentary\nregarding 18A, maybe what that means as a knee-jerk reaction just right\naway for AMD longer term in terms of share and ASPs?\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, Tom. Thanks for the question. So first of all, our Client and Gaming\nsegment and particularly our Client business just performed very well in\nthe first half of the year. I think if you look at the entire first half,\nit was up 68% year-over-year. I think if you look underneath that, what\nwe're seeing is strength in every part of our Client business, so we saw\nvery strong sales in our desktop channel area. We have a leadership product\nthere, best gaming GPUs with our X3D GPUs.\n\n\nWe've had strong Ryzen AI adoption as well in the first half of the year.\nWe see that in sell-through. And in addition, we've had strong enterprise\nsell-through as we brought that forward. So to your question of how much is\npull forward, we don't think a whole lot of that is. We actually -- when we\nlook at the sell-through patterns, the end user consumption is actually\nquite strong for Client in terms of going into the second half of the year.\n\n\n\nAs we said in our Q3 guide, the primary driver of our Q3 guide is a very\nstrong Data Center driven by MI350 ramping. We are expecting some growth in\nthe Client business, so I wouldn't say it'll be flat to the first half, but\nit will be -- we're planning for it to be a little bit less than seasonal\njust given some of the uncertainties out there. But the Client business is\nperforming extremely well for us, and we believe we are gaining share in\nall the right places.\n\n\nSo if you look at the numbers in the first quarter, and it'll show through\nin the second quarter as well, a lot of the uplift in revenue is in ASPs.\nAnd that is basically we're selling up the stack on the strength of our\nportfolio. And I think we're still quite underrepresented in the enterprise\nportion of the business. That is where we have increased our go-to-market\nresources and focus, and we're seeing nice traction there, especially with\nthe portfolios that we have from HP and Lenovo in enterprise PCs, and now\nwe're adding Dell as well as ramping here, started in the second quarter.\nWe'll ramp more in the second half of the year. So I think all of those are\ntailwinds for our Client business beyond the second half of '25 but really\ninto the next number of quarters as we think about the portfolio and the\nopportunities for us.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nSuper helpful. And then secondly, I was hopeful you could provide us a\nlittle more color on China. So the guide doesn't include MI308, but perhaps\nyou could comment on when you get approval, if the supply chain is ready,\nwhat's currently in inventory? And maybe compare what you think the\ncontribution will look like versus the $700 million in Q2 and the $800\nmillion for the second half you spoke about in April.\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, Tom. So yes, let me answer some of the questions on China. I'm sure\nthat there are some questions. Look, we're very pleased with the progress\nthat's been made with the administration over the last couple of months.\nWe've been working very closely with the administration. I think the focus\nhere on ensuring that U.S. technology gets utilized throughout the world is\nsomething that we certainly support and very much want to contribute to.\n\n\nChina is an important market for us. Given the timing of licenses, we have\na number of licenses that are under review now. We are working with the\nDepartment of Commerce to get those reviewed. We do expect that once those\nlicenses are approved, we will start MI308 shipments. In terms of the\nsupply chain, most of our inventory was not in finished goods, so it was\nwork in process, and it will take us a couple of quarters to run through\nthat. The exact timing of revenue and contribution will depend a bit on\nwhen those are -- when the licenses are actually granted. But overall, I\nthink this is a better position than we were 90 days ago. And we certainly\nview China as a market that we would like to service with MI308, and we're\nworking closely with the administration to do that.\n\n\nOperator\n\nThe next question comes from the line of Vivek Arya with Bank of America\nSecurities.\n\n\nVivek  Arya\nBofA Securities, Research Division\n\nLisa, if we look into 2026, right, that's when I think the sovereign\nopportunity could get quite meaningful for AMD. What is the right way to\nsize that? What does this JV structure mean with some of the contracts that\nyou signed? And would you consider this incremental to the kind of growth\nrate that you're seeing with your current MI business or would this be\ninstead of? So just if you could give us a way to size what is that\nincremental opportunity from sovereign customers when it comes to '26. Like\nis it dependent on MI400, right, in which case it might be more [ back half\nweighted ], et cetera? So just some ways to think about sovereign for AMD\nnext year.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, absolutely, Vivek. Thanks for the question. So look, we're really\nexcited about the overall AI opportunity for us with MI355 and the MI400\nseries as we go through the back half of this year and into 2026. I think\nit's -- there's a very large opportunity with, let's call it, hyperscalers,\nsome of the leading AI companies as well as sovereign. I think sovereign is\nadditive to that, for sure.\n\n\nFrom the standpoint of what to expect, there are also some regulatory\nthings that need to be worked through on the sovereign side. But again,\nwe're working closely with the administration as they go through the\nvarious regulatory decisions that need to be made. But from my perspective,\nI think the fact that countries want their own sovereign computing\ncapability is very, very clear. I think we see that all over the world.\n\n\nThe HUMAIN opportunity that you're referring to that we announced with the\nKingdom of Saudi Arabia, I think, is a great example of where, together\nwith their ambitions, our technology, I think you heard from Tareq that was\n-- he was at our event saying that, that would start with MI355, that we\nwould expect that, that would continue on. I think what's attractive about\nour offering is our open ecosystem, and I think that really resonates with\nthe sovereign community. But to your original question, I think it's an\nadditive opportunity, and it's one that we believe will continue to be very\nimportant for us going forward with both MI355 as well as the MI400 series.\n\n\n\nVivek  Arya\nBofA Securities, Research Division\n\nGot it. And for my follow-up, I wanted to ask about gross margins for your\nMI product. So I understand in the early days, right, it has been dilutive.\nWhat kind of sales level is required for it to start becoming additive to\nmargins? And let's say if I fast forward to Q4 and assume that your Q4\nsales are growing year-on-year roughly the same rate as Q3 sales, should we\nexpect gross margins to kind of stay at these Q3 levels? Or are there other\nplus/minus drivers we should think about in terms of gross margins as you\ngo into Q4?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes. Vivek, thank you for the question. The gross margin for our MI\nproduct, we said it's a little bit below corporate average. I think at this\npoint, our priority is really to address the larger, faster-growing revenue\nopportunities we have and provide customers a better TCO to really expand\nour presence in the marketplace. I think the way to think about our gross\nmargin, there are different dynamics, right, different customers, different\ngenerations. But also our operation team has been continuing to really\ndrive operational efficiency to improve our MI family's gross margin.\n\n\nThat has been ongoing. So it's not necessarily really tied to, okay, the\nrevenue level each quarter, but you should think about is a trend in the\nlonger term, it should improve continually going forward. Overall, the way\nI think about these gross margin dollars, right, is -- this is one of the\nfastest-growing market opportunities for any financial metrics. Gross\nmargin dollars is what we try to grab as much as we can. Hopefully, that\nhelped your question.\n\n\nOperator\n\nAnd the next question comes from the line of Timothy Arcuri with UBS.\n\n\nTimothy Michael Arcuri\nUBS Investment Bank, Research Division\n\nLisa, so my question is on Data Center GPU. You did say that June is up\nyear-over-year, so it sounds like it's maybe a little more than $1 billion.\nAnd you used words like strong ramp into the back half of the year. Can you\ngive us just any color on what that means? Can you get to, say, $7 billion\nfor the year? And can you give us some -- maybe a milepost on what you're\nassuming for Q3? Would be great.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Thanks, Tim, for the question. I think what we said in the prepared\nremarks is that we are seeing a strong ramp from Q2 into Q3. MI355, we\nactually started production in June. So we had some shipments sort of in\nthe month of June, but it really is ramping as we go through this quarter\nand the third quarter. So in terms of guideposts, we said it would grow\nyear-on-year from last year. And that, I think, is a strong ramp, and then\nwe would expect it to grow into the fourth quarter as well.\n\n\nThe demand, I should say, what we're seeing from customers is I think\nreally positive around MI355. Sort of the way I would contrast it with\nmaybe the MI300 ramp, I think MI300 started with perhaps some smaller\ndeployments. I think what we're seeing with MI355 is very competitive\nversus the B200, GB200 family of products. I think there's a strong desire\nto really use us at scale. The MI355 is very strong for inferencing. We're\nalso working with a number of customers on training. And this is also an\nopportunity for us to build into the MI400 series as we go into 2026. So\nwe're bullish on MI355 and where the AI opportunity is for us. And I think\nwe're right on track to what we expected to be as we were going through the\ndevelopment of the road map.\n\n\nTimothy Michael Arcuri\nUBS Investment Bank, Research Division\n\nAnd then, Lisa, just on that point also, you did talk about a new developer\ncloud. So obviously, you're beginning to lease back some of the capacity\nthat you're selling into the clouds and the neoclouds. Is that going to be\na material portion of the revenue you're going to recognize for MI355 in\nthe back half of the year? Can you just talk about that and maybe how to\nthink about how much demand that's going to stimulate and what the ultimate\ngoal is for that cloud?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. So there are a couple of things in that question, so let me answer. So\nthe developer cloud is simply we want to make it super easy for developers\nto get on AMD Instinct GPUs. One could say, again, if we look back at the\nMI300 family, we were very focused on the largest hyperscalers and the\nlargest customers, but there's a lot of interest in the -- in our GPUs\nacross a number of customers who just wanted easier access. And so by\nensuring that a developer cloud is there, that it has ready-to-deploy\ncontainers. You can run training and inference easily. You don't\nnecessarily have to make longer-term commitments. I think that's the\npurpose of the developer cloud.\n\n\nI don't think it adds meaningfully to revenue in the second half of the\nyear, but it certainly adds to customers getting experience with AMD. I\nthink the larger revenue opportunities for us are really with large\ncustomer adoption as they ramp to larger deployments. And we're very\nactively trying to get those deployments up and running as soon as\npossible. One of the things, just as a reminder, that the MI355 is -- given\nthat it's a similar infrastructure to MI300, we actually think it's going\nto ramp very quickly and very well for customers, and I think that's one of\nthe attractive portions of it as well.\n\n\nOperator\n\nAnd the next question comes from the line of Ross Seymore with Deutsche\nBank.\n\n\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\n\nLisa, want to go back to the Instinct side of things and the MI355 ramp. It\nlooks like the second half is going to ramp really significantly. You said\nit's going to be up year-over-year in the third quarter. I believe a\nquarter ago, you said roughly the same thing. And the MI308 is out of both\nnumbers, so that shouldn't really matter, and I guess it would be upside.\nBut I just wondered how have things changed from a quarter ago as far as\nthe MI350 family adoption, especially because you are -- you launched a\nlittle bit early. Is the growth a little bit more than you would have\nexpected a quarter ago, about the same or a little worse? Just any sort of\ncolor on that would be helpful.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, Ross, thanks for the question. I think the main thing I would say is,\nI think the adoption is a bit faster than we might have expected. Again,\nwhenever you launch a product, we want to make sure that we go through the\nfull validation and all of that with our customers. I think there's a lot\nof interest -- broad-based interest in MI355. And so I feel like, over the\nlast 90 days, I think we've had significant sort of new customer interest,\nand that's certainly positive.\n\n\nI will say -- I'm sorry, Ross. I was just going to add, our engagements are\n-- I think the other piece is I think there's also a lot of excitement\naround MI400 and what we can do with the Helios rack. And so there are a\nnumber of customers who, based on sort of the strong road map that we're\nshowing, want to get familiar and really work with us earlier in the life\ncycle, which I think is, again, positive.\n\n\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\n\nGreat. I guess as my follow-up, an earlier question, you talked about a\nlittle bit below seasonality in the second half of the year for your Client\nbusiness. It seems like there's just, I don't know, enough seasonality of\nthe framework that matters. But how are you thinking about that for the\nsecond half as a whole for Client? And then Gaming, which was just up a\nhuge amount sequentially in the second quarter, you described a little bit\nof what you're expecting there. But how do you think about seasonality for\nthe second half and its entirety in the Gaming side as well?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Let me try, and then Jean might add if you want a little bit more\ncolor. So the way to think about it is we do expect the -- some growth --\nsequential growth in clients as we go into the third quarter, I would say\nsort of single-digit type growth. We continue to see good traction for our\nproducts in that portfolio. On the Gaming side, I would call it flattish to\nQ2. And we're coming off of such a strong Q2 that I think flattish is\nactually to be expected.\n\n\nAs we go into the fourth quarter, the dynamics that we would see is we\nwould see that the console business would actually be down substantially,\nso think about it as down strong double digits. Our customers usually build\nfor the holiday season in -- sort of before that, and then that will be\ncompleted by the fourth quarter. So we would expect as the Client and\nGaming segment, that the segment would probably be down in the fourth\nquarter. So hopefully, that helps. Jean, did I -- did you want to add to\nthat?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nNo, I think you covered it.\n\n\nOperator\n\nAnd the next question comes from the line of Joshua Buchalter with TD\nCowen.\n\n\nJoshua Louis Buchalter\nTD Cowen, Research Division\n\nI wanted to ask about lead times on your -- on the Instinct family, both\nfor the MI350 family and MI400. I mean, as you move into larger cluster\nsizes, which it sounds like you're doing at least with Oracle on 350 and\nthen endeavor to do more so on 400, how much visibility and lead time do\nyou need from your customers? Because I would imagine the lead time for\nyour parts is measured in months, but on the infrastructure side, in\nparticular, for the larger-scale deployments, I mean, those things are\nmeasured in years at this point. So maybe you could speak to the visibility\nspecifically on the 400.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Sure, Josh. So yes, I mean, our lead times are long, given all of the\nprocessing steps that we have to go through. Think about it as somewhere\nbetween 8, 9 months, that type of thing. We have a very, very strong supply\nchain. We've been preparing for these ramps of both MI350 series and MI400\nseries and that preparation is ongoing. So we feel like we have a very\nstrong supply chain there.\n\n\nIn terms of visibility with customers, we're absolutely working with\ncustomers very closely on near-term MI350 series deployments, getting those\ndeployments up as quickly as possible. Again, one of the things about the\nMI350 series that is good is that it can go into existing data centers\ngiven the -- just given the platform that it is in. So we have been\ncertainly working with our customers there.\n\n\nAnd then for the MI400 series, there are lots and lots of details in sort\nof full rack scale design implementation, and we're actively working with\nthe largest customers right now on just ensuring that our Helios rack is\nfully compatible with their data center build-outs as we go into 2026. So\nthat visibility is important. I think that co-development, co-engineering\nis important as we get into the rack scale architecture. And the ZT team\nthat we brought in has been extremely, extremely helpful in terms of both\ninternal platform build-out as well as ensuring that we're working closely\nwith our customers on their data center needs.\n\n\nJoshua Louis Buchalter\nTD Cowen, Research Division\n\nMaybe for Jean, I wanted to follow up on Vivek's question earlier on gross\nmargins. So if we add back the charges in 2Q -- and then your gross margin\nimplied in the guidance is roughly flat sequentially and that's despite\nwhat's implied to be data center GPUs up meaningfully sequentially. It\ndoesn't seem like console is falling off in the third quarter. I mean, can\nyou maybe talk to the underlying drivers of how you're able to keep the\nflat gross margins despite what sounds like still margin dilutive data\ncenter GPUs up significantly within the mix?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes, Josh, thanks for the question. Yes, we are guiding our Q3 gross margin\naround 54%. And Q2, you're right, excluding the $800 million charge, it was\nclose to 54%. I think the Gaming business actually is quite high, so the\nmix actually is unfavorable. But we do have some tailwinds we have been\nreally driving. First is we have been expanding our server business, which\nhas really nice gross margin. And on the Client business side, we are\nexpanding the commercial PC business, so that really helps us to drive the\ngross margin up.\n\n\nIn addition, we do have a really strong operational team. They are driving\nthe gross margin improvement just from an operational efficiency\nperspective across the board. So overall, our objective is to continue to\nimprove gross margin. Despite MI350 very strong ramp in Q3, we are able to\ncontinue to drive the margin up.\n\n\nOperator\n\nAnd the next question comes from the line of Joe Moore with Morgan Stanley.\n\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nYou used this language before, the kind of tens of billions opportunity\naround MI400. Can you talk about the time frame when that might occur and\nnot to pin you down too much, but -- and what would help you get to that\nlevel sooner rather than later? Should we think of that as a 2027 realistic\noutcome that you could be looking at $20 billion-plus? Just a little bit\nmore color on that tens of billions comment.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. I mean, maybe without being specific, Joe, I can give you sort of the\nway I look at it and back to this notion of are we incrementally more\nconfident. I think we're seeing a lot of positive signs in our AI customer\nadoption, I think the strength of the MI350 series, the very positive\nfeedback that we're getting on MI400 from customers, the work that we're\ndoing in terms of ensuring that we are fully ready for large-scale\ndeployments of not just inference but training.\n\n\nI think when we get to tens of billions of dollars, we're talking about\nsignificant gigawatt-scale type deployments. And those would be important\nfor us to get there. And we're certainly, I think, engaged with all of the\nright customers that can enable that type of ramp. But I won't necessarily\nspeculate on the exact time other than to say, certainly, that would be our\nset of aspirations.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nRight. That's helpful. And then as these workloads evolve, I mean, you've\nsort of talked about inference and training and sort of different\nopportunities for AMD. Are you seeing those start to come together? It\nseems like with inference, there's -- the reasoning models are requiring\nmuch higher complexity. Is rack scale more important to the inference\nmarket than you thought it might be? Just any color around how that\ncomplexity of inference is impacting you guys.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, I think that's absolutely true, Joe. I think with the proliferation of\nmodels, I think what we're seeing is GPUs continue to be very -- sort of\nthe computing of choice as you think about all the models that are out\nthere. And then as you go into distributed inference and some of the newer\ntechniques, we are seeing the importance of the scale-up and scale-out\narchitecture, which we are investing in.\n\n\nBut I think the overarching thing is, I think, we have a very competitive\nroad map across the next couple of generations. I think that has now gotten\nstrong customer validation. We're getting a lot of feedback from customers\non where they would like to see us continue to add more resources and add\nmore focus, and so that is very helpful. And the key is to be a full-scale\nsolution provider for these large customer deployments, and that's what\nwe're working on.\n\n\nOperator\n\nAnd the next question comes from the line of Aaron Rakers with Wells Fargo.\n\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI do have a follow-up as well. I guess the first question is when we look\nat the Data Center guide, Jean, you had alluded to double-digit sequential\ngrowth. Obviously, the MI355 series kind of ramping. I'm curious, how can\nwe conceptualize what you're expecting in the server side? And where do you\nthink your market share is today in traditional enterprise servers outside\nof cloud?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes. I think when you look at our Data Center business, we do have a strong\ndouble-digit growth, both in server and MI. Both sides are growing\nsequentially. Of course, MI ramp is the most significant one. As far as the\nserver market share, we do think we continue to drive the market share up\ncompared to Q1. It's not -- a third party has not published a report yet,\nbut we feel really good about the Q2 market share increase versus Q1.\n\n\nLisa T. Su\nChair, President & CEO\n\nAaron, if I'd just add to that, one of the things that -- it's important\nfor people to understand is in some of the cloud CapEx numbers that have\ncome out that have been quite positive, that is not only a GPU statement,\nbut there's actually significant CPU CapEx in there as well. We started to\nsee more robust forecasts going out a number of quarters on the server CPU\nside because all of that AI content really requires traditional CPUs as\nwell. And so we're very bullish on the opportunity in servers. I think the\nteam has really executed extremely well.\n\n\nI mean, if you look at our portfolio now, Turin and Genoa are very well\nadopted, broadening workloads. Enterprise adoption is also increasing. And\nso I think all of those are positive for the server opportunity in the\nsecond half of '25 as well as going into '26 and beyond.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. And then as a follow-up, I'm kind of thinking about the China, the\nMI308 opportunity. When we do see a license, I think you alluded to this\nearlier, it's going to take a little bit of time to kind of ramp and get\nthe supply chain to satisfy the demand. But I'm curious, the $800 million\nwrite-down that you had taken, is there no kind of finished inventory\nthere? Does that come back? Do you have any reversal aspects of that once\nthe license gets approved?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nLet me start first. Then Lisa can add. First, on the $800 million, majority\nof them are WIPs. We really don't have that on the shelf, a finished good\nwe can ship immediately. So we do need to take time if we get license.\n\n\nOperator\n\nAnd the next question comes from the line of C.J. Muse with Cantor\nFitzgerald.\n\n\nChristopher James Muse\nCantor Fitzgerald & Co., Research Division\n\nI guess, Lisa, was hoping you could level set us on the Instinct ramp into\n2026. How are you thinking about the timing of the handoff, 350 to 400? How\nare you thinking about Helios' contributions? And I guess very importantly\nfrom a customer contribution perspective, how you might see that evolve\nfrom traditional hyperscalers to perhaps more sovereign and neocloud with\nthe mix?\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, C.J. So certainly, as second half this year, it's all about MI355\nramp into first half of next year. I think the MI400 series development is\nright on track. The development of the Helios platform is also right on\ntrack. We would expect significant revenue contribution from Helios in\n2026.\n\n\nAnd then relative to the contribution of the various things, hyperscalers,\nsort of some of the -- versus neoclouds, versus sovereign, I think it's a\nlittle early to really talk about the different pieces other than to say\nyou would expect that hyperscalers and, let's call it, neoclouds that would\nbe working for other large AI natives may be significant pieces of the\ninitial ramp and then sovereign may come a little bit later in time just\ngiven sort of the timing of when different build-outs would happen. So\nhopefully, that gives you some color, C.J.\n\n\nChristopher James Muse\nCantor Fitzgerald & Co., Research Division\n\nYes, very helpful. And then, Jean, I guess, a question for you. With the\nsale of ZT for $3 billion of cash and stock and you only have $3 billion of\ndebt outstanding, how are you thinking about the use of proceeds? Is there\nsaving for a rainy day or bolt-on acquisitions, perhaps more aggressive\nshare buyback? How are you thinking about it today?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes, thanks for the question. Our business model actually generated a lot\nof free cash flow. As you see in Q2, free cash flow generation was $1.2\nbillion. So if we close the ZT sale and we'll get more cash, overall, our\ncapital allocation principle continues to be the first phase, investing,\nespecially with the tremendous AI opportunities ahead of us. And then we\nwill continue to return cash to shareholders. We did a $1.2 billion\nrepurchase in the first half of the year. We are committed to continue to\nreturn cash to shareholders through share repurchase.\n\n\nOperator\n\nOkay. The final question comes from the line of Ben Reitzes with Melius\nResearch.\n\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nI wanted to clarify a little bit on the $1 billion increase in sequential\nsales. It would seem like it's coming from GPUs primarily. I was wondering\nif you could back that. And that's with nothing in China, and if the answer\nto the prior question that GPUs are over $1 billion, that kind of puts you\nat a $2 billion run rate. And I was just wondering if that was accurate in\nterms of thinking. And then I have just a very quick follow-up.\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nBen, thanks for the question. If you look at the sequential revenue\nincrease, as I mentioned during the prepared remarks, we see Data Center a\nstrong double-digit increase, which include both GPU and CPU, but GPU\ndefinitely drives largest incremental amount increase. We also mentioned\nthe Client actually is going to increase sequentially. In addition, the\nEmbedded business will return to sequential growth. So multiple business\ncontributed to sequential increase, but the majority of the increase is\nreally driven by MI355's strong ramp.\n\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nOkay. Great. And then if indeed that gets you pretty close to a couple\nbillion dollars, if the MI300 comes in, do you see it at the same run rate\nthat you exited and then you have the ability to get at the $800 million\nrun rate right away? Or you think it will take several quarters to ramp\nwhen you get the license?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, Ben, it will take some time to ramp, just given -- particularly today,\nI mean, we're sitting already in early August, so I don't think you would\nsee a lot of it in Q3. But certainly, as licenses would be approved, we\nwould schedule that, and it would take a little while to ramp.\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor Relations\n\nAll right, operator, thank you very much. We appreciate everybody that\njoined the call today, and we'd just like to end the call now. Thank you.\n\n\nOperatorLadies and gentlemen, that does conclude today's teleconference. We\nthank you for your participation. You may disconnect your lines at this\ntime.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.\n\n",
  "presentation_text": "Operator\n\nGreetings, and welcome to the AMD Second Quarter 2025 Conference Call.\n[Operator Instructions] As a reminder, this conference is being recorded.\nAnd it is now my pleasure to introduce to you, Matthew Ramsay, VP of\nInvestor Relations and Financial Strategy. Thank you, sir. Please go ahead.\n\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor Relations\n\nThank you, and welcome to AMD's 2025 Second Quarter Financial Results\nConference Call. By now, you should have had the opportunity to review a\ncopy of our earnings press release and the accompanying slides. If you have\nnot had the chance to review these materials, they can be found on the\nInvestor Relations page of amd.com.\n\n\nWe will refer primarily to non-GAAP financial measures during today's call.\nThe full non-GAAP to GAAP reconciliations are available in today's press\nrelease and slides posted on our website.\n\n\nParticipants in today's conference call are Dr. Lisa Su, our Chair and\nChief Executive Officer; and Jean Hu, our Executive Vice President, Chief\nFinancial Officer and Treasurer. This is a live call and will be replayed\nvia webcast on our website.\n\n\nBefore we begin, I would like to note that Jean Hu, Executive Vice\nPresident, Chief Financial Officer and Treasurer, will present at Citi's\n2025 Global TMT Conference on Wednesday, September 3; and Forrest Norrod,\nExecutive Vice President and General Manager of Data Center Solutions\nbusiness unit, will present at the Goldman Sachs Communacopia and\nTechnology Conference on Monday, September 8.\n\n\nToday's discussion contains forward-looking statements based on our current\nbeliefs, assumptions and expectations, speaks only as of today and as such,\ninvolve risks and uncertainties that could cause actual results to differ\nmaterially from our current expectations. Please refer to the cautionary\nstatement in our press release for more information on factors that could\ncause actual results to differ materially.\n\n\nWith that, I will hand the call over to Lisa.\n\n\nLisa T. Su\nChair, President & CEO\n\nThank you, Matt, and good afternoon to all those listening today. We\ndelivered very strong second quarter results, with revenue exceeding the\nmidpoint of guidance as higher EPYC and Ryzen processor sales more than\noffset headwinds from export controls that impacted Instinct sales. We set\nrecords for both EPYC and Ryzen CPU sales, reflecting the broad-based\ndemand for our differentiated high-performance data center, PC and embedded\nprocessors.\n\n\nSecond quarter revenue increased 32% year-over-year      to a record $7.7\nbillion, and we delivered over $1 billion in free cash flow. Excluding the\n$800 million inventory write-down related to data center AI export\ncontrols, gross margin was 54%, marking our sixth consecutive quarter of\nyear-over-year margin expansion led by a richer product mix.\n\n\nTurning to the segments. Data Center segment revenue increased 14% year-\nover-year to $3.2 billion. We saw robust demand across our EPYC portfolio\nto power cloud and enterprise workloads and increasingly for emerging AI\nuse cases. In particular, adoption of agentic AI is creating additional\ndemand for general purpose compute infrastructure as customers quickly\nrealize that each token generated by a GPU triggers multiple CPU-intensive\ntasks. Against this backdrop, fifth-gen EPYC Turin shipments ramped\nsignificantly, and we had sustained demand for our prior-generation EPYC\nprocessors. As a result, we set records for both cloud and enterprise CPU\nsales and delivered our 33rd consecutive quarter of year-over-year share\ngains.\n\n\nIn cloud, adoption expanded with the largest hyperscalers as they deployed\nEPYC to power more of their mission-critical infrastructure, services and\npublic cloud products. More than 100 new AMD-powered cloud instances\nlaunched in the quarter, including multiple Turin instances from Google and\nOracle Cloud that deliver up to twice the performance of our previous\ngeneration, which were already the industry's highest-performing offerings.\nThere are now nearly 1,200 EPYC cloud instances available globally as\nproviders continue expanding both the breadth and regional availability of\ntheir AMD offerings. This continued expansion is accelerating enterprise\nadoption of EPYC in the cloud, with deployments growing significantly from\nthe prior quarter as we closed large wins with dozens of large aerospace,\nstreaming, financial services, retail and energy companies.\n\n\nEPYC adoption also grew with telecom customers as providers modernize their\ninfrastructure for next-generation networks. For example, KDDI announced\nplans to deploy EPYC processors to power its 5G virtualized network. And\nNokia selected EPYC for its cloud platform used by service providers to\nbuild, deploy and manage core network functions.\n\n\nTurning to enterprise on-prem adoption. HPE, Dell, Lenovo and Super Micro\nlaunched 28 new Turin platforms in the quarter that deliver leadership\nperformance, efficiency and TCO across a wide range of enterprise\nworkloads. EPYC enterprise deployments grew significantly from the prior\nquarter, supported by new wins with large technology, automotive,\nmanufacturing, financial services and public sector customers. To extend\nour momentum with SMB and hosted IT service customers, we launched the EPYC\n4005 Series that combine enterprise-grade performance and features and cost-\noptimized platforms purpose built for smaller scale deployments.\n\n\nTurning to HPC. AMD now powers more than 1/3 of the world's fastest\nsupercomputers, including El Capitan and Frontier, which retained the #1\nand #2 spots on the latest Top 500 list. We also power 12 of the top 20\nsystems on the Green500, highlighting the performance per watt advantages\nof EPYC and Instinct for large-scale deployments. Looking ahead, we remain\nbullish on our server CPU business, driven by durable tailwinds, including\ngrowing demand for cloud and on-prem compute, sustained share gains, and\nthe growing investments in general purpose infrastructure required to\nenable AI.\n\n\nTurning to our Data Center AI business. Revenue declined year-over-year as\nU.S. export restrictions effectively eliminated MI308 sales to China, and\nwe began transitioning to our next-generation MI350 series accelerators. We\nmade solid progress with MI300 and MI325 in the quarter, closing new wins\nand expanding adoption with Tier 1 customers, next-generation AI cloud\nproviders and end users. Today, 7 of the top 10 model builders and AI\ncompanies use Instinct, underscoring the performance and TCO advantages of\nour Data Center AI solutions.\n\n\nWe launched our Instinct MI350 series with industry-leading memory\nbandwidth and capacity and broad adoption across hyperscalers, AI companies\nand OEMs. From a competitive standpoint, MI355 matches or exceeds B200 in\ncritical training and inference workloads and delivers comparable\nperformance to GB200 for key workloads at significantly lower cost and\ncomplexity. For upscale inferencing, MI355 delivers up to 40% more tokens\nper dollar, providing leadership performance and clear TCO advantages.\n\n\nWith the MI350 series, we're also expanding our system-level capabilities\nto support deployments powered by AMD CPUs, GPUs and NICs. As one example,\nOracle is building a 27,000-plus node AI cluster combining MI355X\naccelerators, fifth-gen EPYC Turin CPUs and Pollara 400 SmartNICs. We began\nvolume production of the MI350 series ahead of schedule in June and expect\na steep production ramp in the second half of the year to support large-\nscale production deployments with multiple customers.\n\n\nOur sovereign AI engagements accelerated in the quarter as governments\naround the world adopt AMD technology to build secure AI infrastructure and\nadvance their economies. As one example, we announced a multibillion-dollar\ncollaboration with HUMAIN to build AI infrastructure powered entirely on\nAMD CPUs, GPUs and software. Initial deployments are underway in key\nregions with quarterly expansions planned over the coming years. In\naddition, we have more than 40 active engagements globally and see\nsignificant opportunities to power an increasingly larger portion of\nnational computing centers and sovereign AI initiatives.\n\n\nOn the AI software front, we made significant progress this quarter\nincreasing the performance, improving the usability and expanding the\nadoption of ROCm. We announced ROCm 7 with major upgrades across every\nlayer of the stack, delivering more than 3x higher inferencing and training\nperformance compared to our prior generation and adding support for large-\nscale training, distributed inference and lower precision data types.\n\n\nTo deepen developer engagement, we introduced nightly ROCm builds and\nexpanded access to Instinct compute infrastructure, including launching our\nfirst developer cloud that provides preconfigured containers for instant\naccess to AMD GPUs. We also expanded native support for ROCm across key\nframeworks, including vLLM and SGLang, enabling Frontier models like Llama\n4, Gemma 3 and DeepSeek-R1 to launch with day 0 AMD support. To accelerate\nenterprise adoption, we introduced ROCm Enterprise AI, a full-stack\nplatform that integrates seamlessly with existing IT infrastructure and\nincludes everything needed for an enterprise to deploy, manage and scale AI\nacross their business.\n\n\nLooking ahead, the development of our next-generation MI400 series is\nprogressing rapidly. These are the most advanced GPUs we have ever built\nwith up to 40 petaflops of FP4 AI performance and 50% more memory, memory\nbandwidth and scale-out throughput than the competition. With the MI400\nseries, we're bringing together everything we've learned across silicon,\nsoftware and systems to deliver Helios, a full-stack rack scale AI\nplatform. Helios is purpose built for the most demanding AI workloads with\neach rack connecting up to 72 GPUs that can operate as a single massive AI\naccelerator. Helios is expected to deliver up to a 10x generational\nperformance increase for the most advanced Frontier models, and we believe\nit will be the highest-performance AI system in the world when it launches.\nMI400 series development is progressing well towards our planned launch in\n2026, with significant interest in large-scale deployments from multiple\nhigh-profile customers.\n\n\nTo accelerate our development, we have invested significantly to expand our\nAI software and hardware capabilities, both organically and inorganically\nwith a number of acquisitions and strategic investments. We strengthened\nour software stack last quarter with the addition of the Brium and Lamini\nteams, building on our acquisitions of Nod.ai, Mipsology, and Silo AI.\n\n\nOn the hardware side, we added a world-class rack and data center scale\ndesign team in the second quarter with our acquisition of ZT Systems. The\nZT team is integrated seamlessly, and they are actively engaging with\nmultiple customers to accelerate deployments of our Helios solutions at\nscale. We also announced last quarter that Sanmina intends to acquire ZT's\nU.S.-based manufacturing business, becoming our lead partner for AI rack\nmanufacturing.\n\n\nTurning to the AI regulatory environment. Earlier this quarter, we were\nnotified by the Department of Commerce that it is moving forward with the\nreview of our license applications to export MI308 to China. We appreciate\nthe focus the Trump administration is placing on assuring that the U.S.\ntechnology remains central to global AI infrastructure, and we expect to\nresume MI308 shipments as licenses are approved, subject to end customer\ndemand and supply chain readiness.\n\n\nAs our licenses are still under review, we are not including any MI308\nrevenue in our third quarter guidance. Despite that, we expect Instinct\nrevenue to grow year-over-year in the third quarter, driven by the ramp of\nMI350 at multiple customers.\n\n\nIn Client and Gaming, segment revenue increased 69% year-over-year to $3.6\nbillion, driven by record client CPU sales and strong demand for our semi-\ncustom game console SoCs and Radeon GPUs. Client revenue increased 67% year-\nover-year to $2.5 billion, led by record desktop CPU sales. Demand for our\nlatest-generation Ryzen 9000 series was strong, especially for our\ndifferentiated X3D processors. We delivered record desktop channel CPU\nsales as Ryzen processors consistently topped the best-selling CPU lists at\nmajor global e-tailers throughout the quarter.\n\n\nWe also expanded our Zen 5 desktop portfolio with the launch of our latest\nThreadripper processors that feature up to 96 cores and deliver up to\ndouble the performance of the competition in many popular content creation\nand design workloads. In mobile, demand for AMD-powered notebooks was\nstrong with sellout growing by a large double-digit percentage year-over-\nyear. We drove a richer mix of higher ASP mobile parts year-over-year as we\nexpanded our share in the premium notebook segment where our Ryzen AI 300\nCPUs deliver leadership performance and value for both general purpose and\nAI workloads.\n\n\nIn commercial PCs, Ryzen adoption accelerated as OEM consumption increased\nmore than 25% year-over-year. We saw strong sell-through for AMD commercial\nnotebooks with Lenovo and HP and a significant uptick in Dell sales as they\nramp availability of their AMD commercial portfolio. We also closed new\nenterprise wins with Forbes 2000 pharma, tech, automotive, financial\nservices, aerospace and health care companies. We expect to continue\ngrowing our commercial client share based on the strength of our product\nportfolio and expanded breadth of OEM offerings. Looking more broadly, we\nremain confident we can continue growing client processor revenue ahead of\nthe market over the coming quarters, driven by increased adoption of our\ndesktop and notebook products, growing commercial momentum and a richer\nproduct mix.\n\n\nIn Gaming, revenue increased 73% year-over-year to $1.1 billion. Semi-\ncustom revenue increased by a large double-digit percentage year-over-year\nas console inventories normalized and our customers began preparing for the\nholiday season. We announced a new multiyear collaboration with Microsoft\nfor custom chips that will power the next generation of Xbox devices,\nincluding consoles, PCs and handhelds. We also deepened our collaboration\nwith Sony through Project Amethyst, a co-engineering program that will use\nmachine learning to power the next wave of immersive gaming experiences.\n\n\nIn PC gaming, demand for our latest-generation Radeon 9000 series GPUs was\nvery strong, with desktop GPU sell-through accelerating in the quarter as\ndemand outpaced supply. We launched the Radeon 9600 XT, extending the\nperformance advantages of RDNA 4 to mainstream gamers and delivering a\nsignificant uplift in gaming performance, including more than double the\nray tracing of our prior generation. As part of our end-to-end AI strategy,\nwe introduced the Radeon AI Pro R9700 GPU for local inferencing, model fine-\ntuning and other data-intensive workloads. The R9700 features more memory,\nfull ROCm support and multi-GPU scalability, enabling advanced AI\ndevelopment and deployment directly on the desktop.\n\n\nTurning to our Embedded segment. Revenue decreased 4% year-over-year to\n$824 million. Demand continues recovering gradually with sell-through in\nthe second quarter picking up as strength in most markets was offset by a\nfew pockets of softness in inventory reduction actions largely with\nindustrial customers. We expanded our Embedded portfolio with the first\nproduction shipments of Spartan UltraScale+ FPGAs that deliver leadership\nperformance and advanced security for cost-sensitive low-power\napplications.\n\n\nAdoption of our Versal adaptive SoCs continues expanding in high-end\napplications including next-generation robotaxi platforms developed by\nBosch in Europe, where Versal serves as a high-performance controller,\nenabling real-time processing, security and encryption in fully electric\nautomated vehicles. Looking ahead, we expect improving demand in the test\nand measurement, communications, and aerospace markets will drive a return\nto sequential growth in the second half of 2025.\n\n\nLonger term, design win momentum continues to build, tracking ahead of this\npoint last year and putting us on pace to pass the record $14 billion in\ndesign wins we achieved in 2024. In summary, demand is very strong across\nour product portfolio, and we are well positioned to deliver significant\ngrowth in the second half of the year, led by the steep ramp of MI350\nseries accelerators and ongoing EPYC and Ryzen share gains.\n\n\nOur server and PC CPU businesses are accelerating, driven by growing demand\nfor high-performance compute, sustained share gains, the strength of our\nproduct portfolio and expanded go-to-market investments. Our Embedded and\nGaming businesses are returning to growth and are well positioned for long-\nterm success, supported by strong design win momentum. And in AI, we are\nseeing strong adoption of our MI350 series and ROCm 7 as we deliver\nleadership performance and TCO advantages across a broader range of\nworkloads and ramp deployments with an expanded set of cloud and enterprise\ncustomers.\n\n\nLooking ahead, we see a clear path to scaling our AI business to tens of\nbillions of dollars in annual revenue. We are very excited about our next-\ngeneration MI400 series, which is another giant step forward on our road\nmap and has been designed to deliver leadership performance at the chip,\nserver and rack levels. Customer interest for the MI400 series is very\nstrong, and we are actively engaging with an expanding set of customers to\nsupport large-scale deployments in 2026.\n\n\nWe are in the early stages of an industry-wide AI transformation that will\ndrive a step function increase in compute demand across all of our markets,\npositioning us for significant revenue and earnings growth over the coming\nyears.\n\n\nNow I'd like to turn the call over to Jean to provide some additional color\non our second quarter results. Jean?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nThank you, Lisa, and good afternoon, everyone. I'll start with a review of\nour financial results and then provide our outlook for the third quarter of\nfiscal 2025. We are pleased with our strong second quarter financial\nresults. We delivered record revenue of $7.7 billion, exceeding the middle\npoint of our guidance, up 32% year-over-year, reflecting strong momentum\nacross our business. Record sales of Ryzen and EPYC processors and higher\nsemi-custom shipments more than offset the impact of the U.S. export\ncontrols, restricting MI308 sales to China.\n\n\nRevenue increased 3% sequentially due to strong growth in the Client and\nthe Gaming segment, partially offset by the Data Center revenue decrease\ndue to export controls. Gross margin was 43%, down 10 points from 53% a\nyear ago. The decrease was due to the $800 million inventory and related\ncharges associated with the export restrictions. Excluding this charge, non-\nGAAP gross margin would have been approximately 54%.\n\n\nOperating expenses were approximately $2.4 billion, an increase of 32% year-\nover-year as we continue to invest aggressively in go-to-market activities\nfor revenue growth and in R&D to capitalize on significant future AI\nexpansion opportunities. Operating income was $897 million, representing a\n12% operating margin compared to $1.3 billion or 22% a year ago. The\ndecline was primarily due to the inventory and related charges. Taxes,\ninterest expense and other totaled $126 million. For the second quarter of\n2025, diluted earnings per share were $0.48 compared to $0.69 a year ago.\nThe inventory and related charges reduced earnings per share by\napproximately $0.43.\n\n\nNow turning to our reportable segment, starting with Data Center. Data\nCenter segment revenue was $3.2 billion, up 14% year-over-year, driven by\nstrong EPYC CPU revenue and share gains across both cloud and enterprise\ncustomers. On a sequential basis, Data Center revenue decreased 12% due to\nthe impact of the export controls on MI308. The Data Center segment\noperating loss was $155 million compared to operating income of $743\nmillion a year ago or 26% of revenue. The loss was primarily due to the\ninventory and related charges.\n\n\nClient and Gaming segment revenue was $3.6 billion, up 69% year-over-year\nand 20% sequentially, driven by record client CPU sales and strong demand\nfor our PC and console gaming products. In the Client business, revenue was\na record of $2.5 billion, up 67% year-over-year, driven by record sales of\nour Ryzen desktop CPUs and a richer product mix. Gaming revenue rose to\n$1.1 billion, up 73% year-over-year, reflecting strong demand for our newly\nlaunched gaming GPUs and higher semi-custom revenue as inventory has now\nnormalized and the customers prepare for the holiday season. Client and\nGaming segment operating income was $767 million or 21% of revenue compared\nto $166 million or 8% a year ago, driven by richer Client product mix and\noperating leverage on higher revenue.\n\n\nEmbedded segment revenue was $824 million, down 4% year-over-year and flat\nsequentially as Embedded end market demand remains mixed. Embedded segment\noperating income was $275 million or 33% of revenue compared to $345\nmillion or 40% a year ago. The decline in operating income was primarily\ndue to product mix.\n\n\nBefore I review the balance sheet and cash flow, as a reminder, we closed\nthe acquisition of ZT Systems early in the second quarter. As we had\nannounced our intent to divest the ZT manufacturing business, the financial\nresults of the ZT manufacturing business are reported separately in our\nfinancial statement as discontinued operations and are excluded from our\nnon-GAAP financials. Subsequently, in May, we entered into agreement with\nSanmina Corporation to sell the ZT manufacturing business for $3 billion in\ncash and stock, inclusive of contingent payment. The transaction is\nexpected to close near the end of 2025, subject to regulatory approvals and\nthe customary closing conditions.\n\n\nTurning to the balance sheet and cash flow. During the quarter, we\ngenerated $1.5 billion in cash from operating activities of continuing\noperations, and free cash flow was a record of $1.2 billion. We returned\n$478 million to shareholders through share repurchase, resulting in $1.2\nbillion in share repurchases for the first half of 2025. In May, our Board\nof Directors approved an additional $6 billion authorization. Exiting the\nquarter, we have $9.5 billion remaining under our share repurchase program.\n\n\n\nAt the end of the quarter, cash, cash equivalents and short-term investment\nwere $5.9 billion. Our long-term debt was $3.2 billion during the quarter.\nWe paid down $950 million of commercial paper used to finance the ZT\nSystems acquisition close.\n\n\nNow turning to our third quarter 2025 outlook. Please note that our third\nquarter outlook does not include any revenue from AMD Instinct MI308\nshipment to China as our license applications are currently under review by\nU.S. government. For the third quarter of 2025, we expect revenue to be\napproximately $8.7 billion, plus or minus $300 million. The midpoint of our\nguidance represents approximately 28% year-over-year revenue growth, driven\nby strong double-digit growth in our Client and Gaming, and Data Center\nsegments.\n\n\nSequentially, we expect revenue to grow by approximately 13%, driven by\nstrong double-digit growth in the Data Center segment with the ramp of our\nAMD Instinct MI350 series GPU products; modest growth in our Client and\nGaming segment, with Client revenue increasing and the Gaming revenue to be\nflattish; and our Embedded segment revenue to return to growth. In\naddition, we expect third quarter non-GAAP gross margin to be approximately\n54%, and we expect non-GAAP operating expenses to be approximately $2.55\nbillion. We expect net interest and other expenses to be a gain of\napproximately $10 million. We expect our non-GAAP effective tax rate to be\n13%, and diluted share count is expected to be approximately 1.63 billion\nshares.\n\n\nIn closing, we executed very well in the first half of the year, delivering\nrecord revenue and building strong momentum for growth in the second half.\nThe strategic investments we are making position us to capitalize on the\nexpanding AI opportunities across all our end markets, driving sustainable\nlong-term revenue growth and earnings expansion for compelling value\ncreation.\n\n\nWith that, I'll turn it back to Matt for the Q&A session.\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor RelationsOperator, will you\nplease poll the audience for questions? Thank you.",
  "qa_text": "Operator\n\n[Operator Instructions] And the first question comes from the line of\nThomas O'Malley with Barclays.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nLisa, I want to start on the Client business. So you had previously laid\nout a second half outlook that was roughly flattish with the first half as\nyou're kind of protecting against some pull forwards. So first, do you\nthink that your Q2 results included some pull forwards and the second half\nshould still be flattish? And longer term after the Intel commentary\nregarding 18A, maybe what that means as a knee-jerk reaction just right\naway for AMD longer term in terms of share and ASPs?\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, Tom. Thanks for the question. So first of all, our Client and Gaming\nsegment and particularly our Client business just performed very well in\nthe first half of the year. I think if you look at the entire first half,\nit was up 68% year-over-year. I think if you look underneath that, what\nwe're seeing is strength in every part of our Client business, so we saw\nvery strong sales in our desktop channel area. We have a leadership product\nthere, best gaming GPUs with our X3D GPUs.\n\n\nWe've had strong Ryzen AI adoption as well in the first half of the year.\nWe see that in sell-through. And in addition, we've had strong enterprise\nsell-through as we brought that forward. So to your question of how much is\npull forward, we don't think a whole lot of that is. We actually -- when we\nlook at the sell-through patterns, the end user consumption is actually\nquite strong for Client in terms of going into the second half of the year.\n\n\n\nAs we said in our Q3 guide, the primary driver of our Q3 guide is a very\nstrong Data Center driven by MI350 ramping. We are expecting some growth in\nthe Client business, so I wouldn't say it'll be flat to the first half, but\nit will be -- we're planning for it to be a little bit less than seasonal\njust given some of the uncertainties out there. But the Client business is\nperforming extremely well for us, and we believe we are gaining share in\nall the right places.\n\n\nSo if you look at the numbers in the first quarter, and it'll show through\nin the second quarter as well, a lot of the uplift in revenue is in ASPs.\nAnd that is basically we're selling up the stack on the strength of our\nportfolio. And I think we're still quite underrepresented in the enterprise\nportion of the business. That is where we have increased our go-to-market\nresources and focus, and we're seeing nice traction there, especially with\nthe portfolios that we have from HP and Lenovo in enterprise PCs, and now\nwe're adding Dell as well as ramping here, started in the second quarter.\nWe'll ramp more in the second half of the year. So I think all of those are\ntailwinds for our Client business beyond the second half of '25 but really\ninto the next number of quarters as we think about the portfolio and the\nopportunities for us.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nSuper helpful. And then secondly, I was hopeful you could provide us a\nlittle more color on China. So the guide doesn't include MI308, but perhaps\nyou could comment on when you get approval, if the supply chain is ready,\nwhat's currently in inventory? And maybe compare what you think the\ncontribution will look like versus the $700 million in Q2 and the $800\nmillion for the second half you spoke about in April.\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, Tom. So yes, let me answer some of the questions on China. I'm sure\nthat there are some questions. Look, we're very pleased with the progress\nthat's been made with the administration over the last couple of months.\nWe've been working very closely with the administration. I think the focus\nhere on ensuring that U.S. technology gets utilized throughout the world is\nsomething that we certainly support and very much want to contribute to.\n\n\nChina is an important market for us. Given the timing of licenses, we have\na number of licenses that are under review now. We are working with the\nDepartment of Commerce to get those reviewed. We do expect that once those\nlicenses are approved, we will start MI308 shipments. In terms of the\nsupply chain, most of our inventory was not in finished goods, so it was\nwork in process, and it will take us a couple of quarters to run through\nthat. The exact timing of revenue and contribution will depend a bit on\nwhen those are -- when the licenses are actually granted. But overall, I\nthink this is a better position than we were 90 days ago. And we certainly\nview China as a market that we would like to service with MI308, and we're\nworking closely with the administration to do that.\n\n\nOperator\n\nThe next question comes from the line of Vivek Arya with Bank of America\nSecurities.\n\n\nVivek  Arya\nBofA Securities, Research Division\n\nLisa, if we look into 2026, right, that's when I think the sovereign\nopportunity could get quite meaningful for AMD. What is the right way to\nsize that? What does this JV structure mean with some of the contracts that\nyou signed? And would you consider this incremental to the kind of growth\nrate that you're seeing with your current MI business or would this be\ninstead of? So just if you could give us a way to size what is that\nincremental opportunity from sovereign customers when it comes to '26. Like\nis it dependent on MI400, right, in which case it might be more [ back half\nweighted ], et cetera? So just some ways to think about sovereign for AMD\nnext year.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, absolutely, Vivek. Thanks for the question. So look, we're really\nexcited about the overall AI opportunity for us with MI355 and the MI400\nseries as we go through the back half of this year and into 2026. I think\nit's -- there's a very large opportunity with, let's call it, hyperscalers,\nsome of the leading AI companies as well as sovereign. I think sovereign is\nadditive to that, for sure.\n\n\nFrom the standpoint of what to expect, there are also some regulatory\nthings that need to be worked through on the sovereign side. But again,\nwe're working closely with the administration as they go through the\nvarious regulatory decisions that need to be made. But from my perspective,\nI think the fact that countries want their own sovereign computing\ncapability is very, very clear. I think we see that all over the world.\n\n\nThe HUMAIN opportunity that you're referring to that we announced with the\nKingdom of Saudi Arabia, I think, is a great example of where, together\nwith their ambitions, our technology, I think you heard from Tareq that was\n-- he was at our event saying that, that would start with MI355, that we\nwould expect that, that would continue on. I think what's attractive about\nour offering is our open ecosystem, and I think that really resonates with\nthe sovereign community. But to your original question, I think it's an\nadditive opportunity, and it's one that we believe will continue to be very\nimportant for us going forward with both MI355 as well as the MI400 series.\n\n\n\nVivek  Arya\nBofA Securities, Research Division\n\nGot it. And for my follow-up, I wanted to ask about gross margins for your\nMI product. So I understand in the early days, right, it has been dilutive.\nWhat kind of sales level is required for it to start becoming additive to\nmargins? And let's say if I fast forward to Q4 and assume that your Q4\nsales are growing year-on-year roughly the same rate as Q3 sales, should we\nexpect gross margins to kind of stay at these Q3 levels? Or are there other\nplus/minus drivers we should think about in terms of gross margins as you\ngo into Q4?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes. Vivek, thank you for the question. The gross margin for our MI\nproduct, we said it's a little bit below corporate average. I think at this\npoint, our priority is really to address the larger, faster-growing revenue\nopportunities we have and provide customers a better TCO to really expand\nour presence in the marketplace. I think the way to think about our gross\nmargin, there are different dynamics, right, different customers, different\ngenerations. But also our operation team has been continuing to really\ndrive operational efficiency to improve our MI family's gross margin.\n\n\nThat has been ongoing. So it's not necessarily really tied to, okay, the\nrevenue level each quarter, but you should think about is a trend in the\nlonger term, it should improve continually going forward. Overall, the way\nI think about these gross margin dollars, right, is -- this is one of the\nfastest-growing market opportunities for any financial metrics. Gross\nmargin dollars is what we try to grab as much as we can. Hopefully, that\nhelped your question.\n\n\nOperator\n\nAnd the next question comes from the line of Timothy Arcuri with UBS.\n\n\nTimothy Michael Arcuri\nUBS Investment Bank, Research Division\n\nLisa, so my question is on Data Center GPU. You did say that June is up\nyear-over-year, so it sounds like it's maybe a little more than $1 billion.\nAnd you used words like strong ramp into the back half of the year. Can you\ngive us just any color on what that means? Can you get to, say, $7 billion\nfor the year? And can you give us some -- maybe a milepost on what you're\nassuming for Q3? Would be great.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Thanks, Tim, for the question. I think what we said in the prepared\nremarks is that we are seeing a strong ramp from Q2 into Q3. MI355, we\nactually started production in June. So we had some shipments sort of in\nthe month of June, but it really is ramping as we go through this quarter\nand the third quarter. So in terms of guideposts, we said it would grow\nyear-on-year from last year. And that, I think, is a strong ramp, and then\nwe would expect it to grow into the fourth quarter as well.\n\n\nThe demand, I should say, what we're seeing from customers is I think\nreally positive around MI355. Sort of the way I would contrast it with\nmaybe the MI300 ramp, I think MI300 started with perhaps some smaller\ndeployments. I think what we're seeing with MI355 is very competitive\nversus the B200, GB200 family of products. I think there's a strong desire\nto really use us at scale. The MI355 is very strong for inferencing. We're\nalso working with a number of customers on training. And this is also an\nopportunity for us to build into the MI400 series as we go into 2026. So\nwe're bullish on MI355 and where the AI opportunity is for us. And I think\nwe're right on track to what we expected to be as we were going through the\ndevelopment of the road map.\n\n\nTimothy Michael Arcuri\nUBS Investment Bank, Research Division\n\nAnd then, Lisa, just on that point also, you did talk about a new developer\ncloud. So obviously, you're beginning to lease back some of the capacity\nthat you're selling into the clouds and the neoclouds. Is that going to be\na material portion of the revenue you're going to recognize for MI355 in\nthe back half of the year? Can you just talk about that and maybe how to\nthink about how much demand that's going to stimulate and what the ultimate\ngoal is for that cloud?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. So there are a couple of things in that question, so let me answer. So\nthe developer cloud is simply we want to make it super easy for developers\nto get on AMD Instinct GPUs. One could say, again, if we look back at the\nMI300 family, we were very focused on the largest hyperscalers and the\nlargest customers, but there's a lot of interest in the -- in our GPUs\nacross a number of customers who just wanted easier access. And so by\nensuring that a developer cloud is there, that it has ready-to-deploy\ncontainers. You can run training and inference easily. You don't\nnecessarily have to make longer-term commitments. I think that's the\npurpose of the developer cloud.\n\n\nI don't think it adds meaningfully to revenue in the second half of the\nyear, but it certainly adds to customers getting experience with AMD. I\nthink the larger revenue opportunities for us are really with large\ncustomer adoption as they ramp to larger deployments. And we're very\nactively trying to get those deployments up and running as soon as\npossible. One of the things, just as a reminder, that the MI355 is -- given\nthat it's a similar infrastructure to MI300, we actually think it's going\nto ramp very quickly and very well for customers, and I think that's one of\nthe attractive portions of it as well.\n\n\nOperator\n\nAnd the next question comes from the line of Ross Seymore with Deutsche\nBank.\n\n\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\n\nLisa, want to go back to the Instinct side of things and the MI355 ramp. It\nlooks like the second half is going to ramp really significantly. You said\nit's going to be up year-over-year in the third quarter. I believe a\nquarter ago, you said roughly the same thing. And the MI308 is out of both\nnumbers, so that shouldn't really matter, and I guess it would be upside.\nBut I just wondered how have things changed from a quarter ago as far as\nthe MI350 family adoption, especially because you are -- you launched a\nlittle bit early. Is the growth a little bit more than you would have\nexpected a quarter ago, about the same or a little worse? Just any sort of\ncolor on that would be helpful.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, Ross, thanks for the question. I think the main thing I would say is,\nI think the adoption is a bit faster than we might have expected. Again,\nwhenever you launch a product, we want to make sure that we go through the\nfull validation and all of that with our customers. I think there's a lot\nof interest -- broad-based interest in MI355. And so I feel like, over the\nlast 90 days, I think we've had significant sort of new customer interest,\nand that's certainly positive.\n\n\nI will say -- I'm sorry, Ross. I was just going to add, our engagements are\n-- I think the other piece is I think there's also a lot of excitement\naround MI400 and what we can do with the Helios rack. And so there are a\nnumber of customers who, based on sort of the strong road map that we're\nshowing, want to get familiar and really work with us earlier in the life\ncycle, which I think is, again, positive.\n\n\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\n\nGreat. I guess as my follow-up, an earlier question, you talked about a\nlittle bit below seasonality in the second half of the year for your Client\nbusiness. It seems like there's just, I don't know, enough seasonality of\nthe framework that matters. But how are you thinking about that for the\nsecond half as a whole for Client? And then Gaming, which was just up a\nhuge amount sequentially in the second quarter, you described a little bit\nof what you're expecting there. But how do you think about seasonality for\nthe second half and its entirety in the Gaming side as well?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Let me try, and then Jean might add if you want a little bit more\ncolor. So the way to think about it is we do expect the -- some growth --\nsequential growth in clients as we go into the third quarter, I would say\nsort of single-digit type growth. We continue to see good traction for our\nproducts in that portfolio. On the Gaming side, I would call it flattish to\nQ2. And we're coming off of such a strong Q2 that I think flattish is\nactually to be expected.\n\n\nAs we go into the fourth quarter, the dynamics that we would see is we\nwould see that the console business would actually be down substantially,\nso think about it as down strong double digits. Our customers usually build\nfor the holiday season in -- sort of before that, and then that will be\ncompleted by the fourth quarter. So we would expect as the Client and\nGaming segment, that the segment would probably be down in the fourth\nquarter. So hopefully, that helps. Jean, did I -- did you want to add to\nthat?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nNo, I think you covered it.\n\n\nOperator\n\nAnd the next question comes from the line of Joshua Buchalter with TD\nCowen.\n\n\nJoshua Louis Buchalter\nTD Cowen, Research Division\n\nI wanted to ask about lead times on your -- on the Instinct family, both\nfor the MI350 family and MI400. I mean, as you move into larger cluster\nsizes, which it sounds like you're doing at least with Oracle on 350 and\nthen endeavor to do more so on 400, how much visibility and lead time do\nyou need from your customers? Because I would imagine the lead time for\nyour parts is measured in months, but on the infrastructure side, in\nparticular, for the larger-scale deployments, I mean, those things are\nmeasured in years at this point. So maybe you could speak to the visibility\nspecifically on the 400.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. Sure, Josh. So yes, I mean, our lead times are long, given all of the\nprocessing steps that we have to go through. Think about it as somewhere\nbetween 8, 9 months, that type of thing. We have a very, very strong supply\nchain. We've been preparing for these ramps of both MI350 series and MI400\nseries and that preparation is ongoing. So we feel like we have a very\nstrong supply chain there.\n\n\nIn terms of visibility with customers, we're absolutely working with\ncustomers very closely on near-term MI350 series deployments, getting those\ndeployments up as quickly as possible. Again, one of the things about the\nMI350 series that is good is that it can go into existing data centers\ngiven the -- just given the platform that it is in. So we have been\ncertainly working with our customers there.\n\n\nAnd then for the MI400 series, there are lots and lots of details in sort\nof full rack scale design implementation, and we're actively working with\nthe largest customers right now on just ensuring that our Helios rack is\nfully compatible with their data center build-outs as we go into 2026. So\nthat visibility is important. I think that co-development, co-engineering\nis important as we get into the rack scale architecture. And the ZT team\nthat we brought in has been extremely, extremely helpful in terms of both\ninternal platform build-out as well as ensuring that we're working closely\nwith our customers on their data center needs.\n\n\nJoshua Louis Buchalter\nTD Cowen, Research Division\n\nMaybe for Jean, I wanted to follow up on Vivek's question earlier on gross\nmargins. So if we add back the charges in 2Q -- and then your gross margin\nimplied in the guidance is roughly flat sequentially and that's despite\nwhat's implied to be data center GPUs up meaningfully sequentially. It\ndoesn't seem like console is falling off in the third quarter. I mean, can\nyou maybe talk to the underlying drivers of how you're able to keep the\nflat gross margins despite what sounds like still margin dilutive data\ncenter GPUs up significantly within the mix?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes, Josh, thanks for the question. Yes, we are guiding our Q3 gross margin\naround 54%. And Q2, you're right, excluding the $800 million charge, it was\nclose to 54%. I think the Gaming business actually is quite high, so the\nmix actually is unfavorable. But we do have some tailwinds we have been\nreally driving. First is we have been expanding our server business, which\nhas really nice gross margin. And on the Client business side, we are\nexpanding the commercial PC business, so that really helps us to drive the\ngross margin up.\n\n\nIn addition, we do have a really strong operational team. They are driving\nthe gross margin improvement just from an operational efficiency\nperspective across the board. So overall, our objective is to continue to\nimprove gross margin. Despite MI350 very strong ramp in Q3, we are able to\ncontinue to drive the margin up.\n\n\nOperator\n\nAnd the next question comes from the line of Joe Moore with Morgan Stanley.\n\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nYou used this language before, the kind of tens of billions opportunity\naround MI400. Can you talk about the time frame when that might occur and\nnot to pin you down too much, but -- and what would help you get to that\nlevel sooner rather than later? Should we think of that as a 2027 realistic\noutcome that you could be looking at $20 billion-plus? Just a little bit\nmore color on that tens of billions comment.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes. I mean, maybe without being specific, Joe, I can give you sort of the\nway I look at it and back to this notion of are we incrementally more\nconfident. I think we're seeing a lot of positive signs in our AI customer\nadoption, I think the strength of the MI350 series, the very positive\nfeedback that we're getting on MI400 from customers, the work that we're\ndoing in terms of ensuring that we are fully ready for large-scale\ndeployments of not just inference but training.\n\n\nI think when we get to tens of billions of dollars, we're talking about\nsignificant gigawatt-scale type deployments. And those would be important\nfor us to get there. And we're certainly, I think, engaged with all of the\nright customers that can enable that type of ramp. But I won't necessarily\nspeculate on the exact time other than to say, certainly, that would be our\nset of aspirations.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nRight. That's helpful. And then as these workloads evolve, I mean, you've\nsort of talked about inference and training and sort of different\nopportunities for AMD. Are you seeing those start to come together? It\nseems like with inference, there's -- the reasoning models are requiring\nmuch higher complexity. Is rack scale more important to the inference\nmarket than you thought it might be? Just any color around how that\ncomplexity of inference is impacting you guys.\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, I think that's absolutely true, Joe. I think with the proliferation of\nmodels, I think what we're seeing is GPUs continue to be very -- sort of\nthe computing of choice as you think about all the models that are out\nthere. And then as you go into distributed inference and some of the newer\ntechniques, we are seeing the importance of the scale-up and scale-out\narchitecture, which we are investing in.\n\n\nBut I think the overarching thing is, I think, we have a very competitive\nroad map across the next couple of generations. I think that has now gotten\nstrong customer validation. We're getting a lot of feedback from customers\non where they would like to see us continue to add more resources and add\nmore focus, and so that is very helpful. And the key is to be a full-scale\nsolution provider for these large customer deployments, and that's what\nwe're working on.\n\n\nOperator\n\nAnd the next question comes from the line of Aaron Rakers with Wells Fargo.\n\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI do have a follow-up as well. I guess the first question is when we look\nat the Data Center guide, Jean, you had alluded to double-digit sequential\ngrowth. Obviously, the MI355 series kind of ramping. I'm curious, how can\nwe conceptualize what you're expecting in the server side? And where do you\nthink your market share is today in traditional enterprise servers outside\nof cloud?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes. I think when you look at our Data Center business, we do have a strong\ndouble-digit growth, both in server and MI. Both sides are growing\nsequentially. Of course, MI ramp is the most significant one. As far as the\nserver market share, we do think we continue to drive the market share up\ncompared to Q1. It's not -- a third party has not published a report yet,\nbut we feel really good about the Q2 market share increase versus Q1.\n\n\nLisa T. Su\nChair, President & CEO\n\nAaron, if I'd just add to that, one of the things that -- it's important\nfor people to understand is in some of the cloud CapEx numbers that have\ncome out that have been quite positive, that is not only a GPU statement,\nbut there's actually significant CPU CapEx in there as well. We started to\nsee more robust forecasts going out a number of quarters on the server CPU\nside because all of that AI content really requires traditional CPUs as\nwell. And so we're very bullish on the opportunity in servers. I think the\nteam has really executed extremely well.\n\n\nI mean, if you look at our portfolio now, Turin and Genoa are very well\nadopted, broadening workloads. Enterprise adoption is also increasing. And\nso I think all of those are positive for the server opportunity in the\nsecond half of '25 as well as going into '26 and beyond.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. And then as a follow-up, I'm kind of thinking about the China, the\nMI308 opportunity. When we do see a license, I think you alluded to this\nearlier, it's going to take a little bit of time to kind of ramp and get\nthe supply chain to satisfy the demand. But I'm curious, the $800 million\nwrite-down that you had taken, is there no kind of finished inventory\nthere? Does that come back? Do you have any reversal aspects of that once\nthe license gets approved?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nLet me start first. Then Lisa can add. First, on the $800 million, majority\nof them are WIPs. We really don't have that on the shelf, a finished good\nwe can ship immediately. So we do need to take time if we get license.\n\n\nOperator\n\nAnd the next question comes from the line of C.J. Muse with Cantor\nFitzgerald.\n\n\nChristopher James Muse\nCantor Fitzgerald & Co., Research Division\n\nI guess, Lisa, was hoping you could level set us on the Instinct ramp into\n2026. How are you thinking about the timing of the handoff, 350 to 400? How\nare you thinking about Helios' contributions? And I guess very importantly\nfrom a customer contribution perspective, how you might see that evolve\nfrom traditional hyperscalers to perhaps more sovereign and neocloud with\nthe mix?\n\n\nLisa T. Su\nChair, President & CEO\n\nSure, C.J. So certainly, as second half this year, it's all about MI355\nramp into first half of next year. I think the MI400 series development is\nright on track. The development of the Helios platform is also right on\ntrack. We would expect significant revenue contribution from Helios in\n2026.\n\n\nAnd then relative to the contribution of the various things, hyperscalers,\nsort of some of the -- versus neoclouds, versus sovereign, I think it's a\nlittle early to really talk about the different pieces other than to say\nyou would expect that hyperscalers and, let's call it, neoclouds that would\nbe working for other large AI natives may be significant pieces of the\ninitial ramp and then sovereign may come a little bit later in time just\ngiven sort of the timing of when different build-outs would happen. So\nhopefully, that gives you some color, C.J.\n\n\nChristopher James Muse\nCantor Fitzgerald & Co., Research Division\n\nYes, very helpful. And then, Jean, I guess, a question for you. With the\nsale of ZT for $3 billion of cash and stock and you only have $3 billion of\ndebt outstanding, how are you thinking about the use of proceeds? Is there\nsaving for a rainy day or bolt-on acquisitions, perhaps more aggressive\nshare buyback? How are you thinking about it today?\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nYes, thanks for the question. Our business model actually generated a lot\nof free cash flow. As you see in Q2, free cash flow generation was $1.2\nbillion. So if we close the ZT sale and we'll get more cash, overall, our\ncapital allocation principle continues to be the first phase, investing,\nespecially with the tremendous AI opportunities ahead of us. And then we\nwill continue to return cash to shareholders. We did a $1.2 billion\nrepurchase in the first half of the year. We are committed to continue to\nreturn cash to shareholders through share repurchase.\n\n\nOperator\n\nOkay. The final question comes from the line of Ben Reitzes with Melius\nResearch.\n\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nI wanted to clarify a little bit on the $1 billion increase in sequential\nsales. It would seem like it's coming from GPUs primarily. I was wondering\nif you could back that. And that's with nothing in China, and if the answer\nto the prior question that GPUs are over $1 billion, that kind of puts you\nat a $2 billion run rate. And I was just wondering if that was accurate in\nterms of thinking. And then I have just a very quick follow-up.\n\n\nJean X. Hu\nExecutive VP, CFO & Treasurer\n\nBen, thanks for the question. If you look at the sequential revenue\nincrease, as I mentioned during the prepared remarks, we see Data Center a\nstrong double-digit increase, which include both GPU and CPU, but GPU\ndefinitely drives largest incremental amount increase. We also mentioned\nthe Client actually is going to increase sequentially. In addition, the\nEmbedded business will return to sequential growth. So multiple business\ncontributed to sequential increase, but the majority of the increase is\nreally driven by MI355's strong ramp.\n\n\nBenjamin Alexander Reitzes\nMelius Research LLC\n\nOkay. Great. And then if indeed that gets you pretty close to a couple\nbillion dollars, if the MI300 comes in, do you see it at the same run rate\nthat you exited and then you have the ability to get at the $800 million\nrun rate right away? Or you think it will take several quarters to ramp\nwhen you get the license?\n\n\nLisa T. Su\nChair, President & CEO\n\nYes, Ben, it will take some time to ramp, just given -- particularly today,\nI mean, we're sitting already in early August, so I don't think you would\nsee a lot of it in Q3. But certainly, as licenses would be approved, we\nwould schedule that, and it would take a little while to ramp.\n\n\nMatthew D. Ramsay\nVice President of Financial Strategy & Investor Relations\n\nAll right, operator, thank you very much. We appreciate everybody that\njoined the call today, and we'd just like to end the call now. Thank you.\n\n\nOperatorLadies and gentlemen, that does conclude today's teleconference. We\nthank you for your participation. You may disconnect your lines at this\ntime.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Advanced Micro Devices, Inc. NasdaqGS:AMD FQ2 2025 Earnings Call Transcripts Tuesday, August 5, 2025 9:00 PM GMT S&P Global Market Intelligence Estimates Presentation"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Greetings, and welcome to the AMD Second Quarter 2025 Conference Call. [Operator Instructions] As a reminder, this conference is being recorded. And it is now my pleasure to introduce to you, Matthew Ramsay, VP of Investor Relations and Financial Strategy. Thank you, sir. Please go ahead."
    },
    {
      "speaker": "Matthew D. Ramsay",
      "role": "Vice President of Financial Strategy & Investor Relations",
      "text": "Vice President of Financial Strategy & Investor Relations Thank you, and welcome to AMD's 2025 Second Quarter Financial Results Conference Call. By now, you should have had the opportunity to review a copy of our earnings press release and the accompanying slides. If you have not had the chance to review these materials, they can be found on the Investor Relations page of amd.com. We will refer primarily to non-GAAP financial measures during today's call. The full non-GAAP to GAAP reconciliations are available in today's press release and slides posted on our website. Participants in today's conference call are Dr. Lisa Su, our Chair and Chief Executive Officer; and Jean Hu, our Executive Vice President, Chief Financial Officer and Treasurer. This is a live call and will be replayed via webcast on our website. Before we begin, I would like to note that Jean Hu, Executive Vice President, Chief Financial Officer and Treasurer, will present at Citi's 2025 Global TMT Conference on Wednesday, September 3; and Forrest Norrod, Executive Vice President and General Manager of Data Center Solutions business unit, will present at the Goldman Sachs Communacopia and Technology Conference on Monday, September 8. Today's discussion contains forward-looking statements based on our current beliefs, assumptions and expectations, speaks only as of today and as such, involve risks and uncertainties that could cause actual results to differ materially from our current expectations. Please refer to the cautionary statement in our press release for more information on factors that could cause actual results to differ materially. With that, I will hand the call over to Lisa."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Thank you, Matt, and good afternoon to all those listening today. We delivered very strong second quarter results, with revenue exceeding the midpoint of guidance as higher EPYC and Ryzen processor sales more than offset headwinds from export controls that impacted Instinct sales. We set records for both EPYC and Ryzen CPU sales, reflecting the broad-based demand for our differentiated high-performance data center, PC and embedded processors. Second quarter revenue increased 32% year-over-year      to a record $7.7 billion, and we delivered over $1 billion in free cash flow. Excluding the $800 million inventory write-down related to data center AI export controls, gross margin was 54%, marking our sixth consecutive quarter of year-over-year margin expansion led by a richer product mix. Turning to the segments. Data Center segment revenue increased 14% year- over-year to $3.2 billion. We saw robust demand across our EPYC portfolio to power cloud and enterprise workloads and increasingly for emerging AI use cases. In particular, adoption of agentic AI is creating additional demand for general purpose compute infrastructure as customers quickly realize that each token generated by a GPU triggers multiple CPU-intensive tasks. Against this backdrop, fifth-gen EPYC Turin shipments ramped significantly, and we had sustained demand for our prior-generation EPYC processors. As a result, we set records for both cloud and enterprise CPU sales and delivered our 33rd consecutive quarter of year-over-year share gains. In cloud, adoption expanded with the largest hyperscalers as they deployed EPYC to power more of their mission-critical infrastructure, services and public cloud products. More than 100 new AMD-powered cloud instances launched in the quarter, including multiple Turin instances from Google and Oracle Cloud that deliver up to twice the performance of our previous generation, which were already the industry's highest-performing offerings. There are now nearly 1,200 EPYC cloud instances available globally as providers continue expanding both the breadth and regional availability of their AMD offerings. This continued expansion is accelerating enterprise adoption of EPYC in the cloud, with deployments growing significantly from the prior quarter as we closed large wins with dozens of large aerospace, streaming, financial services, retail and energy companies. EPYC adoption also grew with telecom customers as providers modernize their infrastructure for next-generation networks. For example, KDDI announced plans to deploy EPYC processors to power its 5G virtualized network. And Nokia selected EPYC for its cloud platform used by service providers to build, deploy and manage core network functions. Turning to enterprise on-prem adoption. HPE, Dell, Lenovo and Super Micro launched 28 new Turin platforms in the quarter that deliver leadership performance, efficiency and TCO across a wide range of enterprise workloads. EPYC enterprise deployments grew significantly from the prior quarter, supported by new wins with large technology, automotive, manufacturing, financial services and public sector customers. To extend our momentum with SMB and hosted IT service customers, we launched the EPYC 4005 Series that combine enterprise-grade performance and features and cost- optimized platforms purpose built for smaller scale deployments. Turning to HPC. AMD now powers more than 1/3 of the world's fastest supercomputers, including El Capitan and Frontier, which retained the #1 and #2 spots on the latest Top 500 list. We also power 12 of the top 20 systems on the Green500, highlighting the performance per watt advantages of EPYC and Instinct for large-scale deployments. Looking ahead, we remain bullish on our server CPU business, driven by durable tailwinds, including growing demand for cloud and on-prem compute, sustained share gains, and the growing investments in general purpose infrastructure required to enable AI. Turning to our Data Center AI business. Revenue declined year-over-year as U.S. export restrictions effectively eliminated MI308 sales to China, and we began transitioning to our next-generation MI350 series accelerators. We made solid progress with MI300 and MI325 in the quarter, closing new wins and expanding adoption with Tier 1 customers, next-generation AI cloud providers and end users. Today, 7 of the top 10 model builders and AI companies use Instinct, underscoring the performance and TCO advantages of our Data Center AI solutions. We launched our Instinct MI350 series with industry-leading memory bandwidth and capacity and broad adoption across hyperscalers, AI companies and OEMs. From a competitive standpoint, MI355 matches or exceeds B200 in critical training and inference workloads and delivers comparable performance to GB200 for key workloads at significantly lower cost and complexity. For upscale inferencing, MI355 delivers up to 40% more tokens per dollar, providing leadership performance and clear TCO advantages. With the MI350 series, we're also expanding our system-level capabilities to support deployments powered by AMD CPUs, GPUs and NICs. As one example, Oracle is building a 27,000-plus node AI cluster combining MI355X accelerators, fifth-gen EPYC Turin CPUs and Pollara 400 SmartNICs. We began volume production of the MI350 series ahead of schedule in June and expect a steep production ramp in the second half of the year to support large- scale production deployments with multiple customers. Our sovereign AI engagements accelerated in the quarter as governments around the world adopt AMD technology to build secure AI infrastructure and advance their economies. As one example, we announced a multibillion-dollar collaboration with HUMAIN to build AI infrastructure powered entirely on AMD CPUs, GPUs and software. Initial deployments are underway in key regions with quarterly expansions planned over the coming years. In addition, we have more than 40 active engagements globally and see significant opportunities to power an increasingly larger portion of national computing centers and sovereign AI initiatives. On the AI software front, we made significant progress this quarter increasing the performance, improving the usability and expanding the adoption of ROCm. We announced ROCm 7 with major upgrades across every layer of the stack, delivering more than 3x higher inferencing and training performance compared to our prior generation and adding support for large- scale training, distributed inference and lower precision data types. To deepen developer engagement, we introduced nightly ROCm builds and expanded access to Instinct compute infrastructure, including launching our first developer cloud that provides preconfigured containers for instant access to AMD GPUs. We also expanded native support for ROCm across key frameworks, including vLLM and SGLang, enabling Frontier models like Llama 4, Gemma 3 and DeepSeek-R1 to launch with day 0 AMD support. To accelerate enterprise adoption, we introduced ROCm Enterprise AI, a full-stack platform that integrates seamlessly with existing IT infrastructure and includes everything needed for an enterprise to deploy, manage and scale AI across their business. Looking ahead, the development of our next-generation MI400 series is progressing rapidly. These are the most advanced GPUs we have ever built with up to 40 petaflops of FP4 AI performance and 50% more memory, memory bandwidth and scale-out throughput than the competition. With the MI400 series, we're bringing together everything we've learned across silicon, software and systems to deliver Helios, a full-stack rack scale AI platform. Helios is purpose built for the most demanding AI workloads with each rack connecting up to 72 GPUs that can operate as a single massive AI accelerator. Helios is expected to deliver up to a 10x generational performance increase for the most advanced Frontier models, and we believe it will be the highest-performance AI system in the world when it launches. MI400 series development is progressing well towards our planned launch in 2026, with significant interest in large-scale deployments from multiple high-profile customers. To accelerate our development, we have invested significantly to expand our AI software and hardware capabilities, both organically and inorganically with a number of acquisitions and strategic investments. We strengthened our software stack last quarter with the addition of the Brium and Lamini teams, building on our acquisitions of Nod.ai, Mipsology, and Silo AI. On the hardware side, we added a world-class rack and data center scale design team in the second quarter with our acquisition of ZT Systems. The ZT team is integrated seamlessly, and they are actively engaging with multiple customers to accelerate deployments of our Helios solutions at scale. We also announced last quarter that Sanmina intends to acquire ZT's U.S.-based manufacturing business, becoming our lead partner for AI rack manufacturing. Turning to the AI regulatory environment. Earlier this quarter, we were notified by the Department of Commerce that it is moving forward with the review of our license applications to export MI308 to China. We appreciate the focus the Trump administration is placing on assuring that the U.S. technology remains central to global AI infrastructure, and we expect to resume MI308 shipments as licenses are approved, subject to end customer demand and supply chain readiness. As our licenses are still under review, we are not including any MI308 revenue in our third quarter guidance. Despite that, we expect Instinct revenue to grow year-over-year in the third quarter, driven by the ramp of MI350 at multiple customers. In Client and Gaming, segment revenue increased 69% year-over-year to $3.6 billion, driven by record client CPU sales and strong demand for our semi- custom game console SoCs and Radeon GPUs. Client revenue increased 67% year- over-year to $2.5 billion, led by record desktop CPU sales. Demand for our latest-generation Ryzen 9000 series was strong, especially for our differentiated X3D processors. We delivered record desktop channel CPU sales as Ryzen processors consistently topped the best-selling CPU lists at major global e-tailers throughout the quarter. We also expanded our Zen 5 desktop portfolio with the launch of our latest Threadripper processors that feature up to 96 cores and deliver up to double the performance of the competition in many popular content creation and design workloads. In mobile, demand for AMD-powered notebooks was strong with sellout growing by a large double-digit percentage year-over- year. We drove a richer mix of higher ASP mobile parts year-over-year as we expanded our share in the premium notebook segment where our Ryzen AI 300 CPUs deliver leadership performance and value for both general purpose and AI workloads. In commercial PCs, Ryzen adoption accelerated as OEM consumption increased more than 25% year-over-year. We saw strong sell-through for AMD commercial notebooks with Lenovo and HP and a significant uptick in Dell sales as they ramp availability of their AMD commercial portfolio. We also closed new enterprise wins with Forbes 2000 pharma, tech, automotive, financial services, aerospace and health care companies. We expect to continue growing our commercial client share based on the strength of our product portfolio and expanded breadth of OEM offerings. Looking more broadly, we remain confident we can continue growing client processor revenue ahead of the market over the coming quarters, driven by increased adoption of our desktop and notebook products, growing commercial momentum and a richer product mix. In Gaming, revenue increased 73% year-over-year to $1.1 billion. Semi- custom revenue increased by a large double-digit percentage year-over-year as console inventories normalized and our customers began preparing for the holiday season. We announced a new multiyear collaboration with Microsoft for custom chips that will power the next generation of Xbox devices, including consoles, PCs and handhelds. We also deepened our collaboration with Sony through Project Amethyst, a co-engineering program that will use machine learning to power the next wave of immersive gaming experiences. In PC gaming, demand for our latest-generation Radeon 9000 series GPUs was very strong, with desktop GPU sell-through accelerating in the quarter as demand outpaced supply. We launched the Radeon 9600 XT, extending the performance advantages of RDNA 4 to mainstream gamers and delivering a significant uplift in gaming performance, including more than double the ray tracing of our prior generation. As part of our end-to-end AI strategy, we introduced the Radeon AI Pro R9700 GPU for local inferencing, model fine- tuning and other data-intensive workloads. The R9700 features more memory, full ROCm support and multi-GPU scalability, enabling advanced AI development and deployment directly on the desktop. Turning to our Embedded segment. Revenue decreased 4% year-over-year to $824 million. Demand continues recovering gradually with sell-through in the second quarter picking up as strength in most markets was offset by a few pockets of softness in inventory reduction actions largely with industrial customers. We expanded our Embedded portfolio with the first production shipments of Spartan UltraScale+ FPGAs that deliver leadership performance and advanced security for cost-sensitive low-power applications. Adoption of our Versal adaptive SoCs continues expanding in high-end applications including next-generation robotaxi platforms developed by Bosch in Europe, where Versal serves as a high-performance controller, enabling real-time processing, security and encryption in fully electric automated vehicles. Looking ahead, we expect improving demand in the test and measurement, communications, and aerospace markets will drive a return to sequential growth in the second half of 2025. Longer term, design win momentum continues to build, tracking ahead of this point last year and putting us on pace to pass the record $14 billion in design wins we achieved in 2024. In summary, demand is very strong across our product portfolio, and we are well positioned to deliver significant growth in the second half of the year, led by the steep ramp of MI350 series accelerators and ongoing EPYC and Ryzen share gains. Our server and PC CPU businesses are accelerating, driven by growing demand for high-performance compute, sustained share gains, the strength of our product portfolio and expanded go-to-market investments. Our Embedded and Gaming businesses are returning to growth and are well positioned for long- term success, supported by strong design win momentum. And in AI, we are seeing strong adoption of our MI350 series and ROCm 7 as we deliver leadership performance and TCO advantages across a broader range of workloads and ramp deployments with an expanded set of cloud and enterprise customers. Looking ahead, we see a clear path to scaling our AI business to tens of billions of dollars in annual revenue. We are very excited about our next- generation MI400 series, which is another giant step forward on our road map and has been designed to deliver leadership performance at the chip, server and rack levels. Customer interest for the MI400 series is very strong, and we are actively engaging with an expanding set of customers to support large-scale deployments in 2026. We are in the early stages of an industry-wide AI transformation that will drive a step function increase in compute demand across all of our markets, positioning us for significant revenue and earnings growth over the coming years. Now I'd like to turn the call over to Jean to provide some additional color on our second quarter results. Jean?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Thank you, Lisa, and good afternoon, everyone. I'll start with a review of our financial results and then provide our outlook for the third quarter of fiscal 2025. We are pleased with our strong second quarter financial results. We delivered record revenue of $7.7 billion, exceeding the middle point of our guidance, up 32% year-over-year, reflecting strong momentum across our business. Record sales of Ryzen and EPYC processors and higher semi-custom shipments more than offset the impact of the U.S. export controls, restricting MI308 sales to China. Revenue increased 3% sequentially due to strong growth in the Client and the Gaming segment, partially offset by the Data Center revenue decrease due to export controls. Gross margin was 43%, down 10 points from 53% a year ago. The decrease was due to the $800 million inventory and related charges associated with the export restrictions. Excluding this charge, non- GAAP gross margin would have been approximately 54%. Operating expenses were approximately $2.4 billion, an increase of 32% year- over-year as we continue to invest aggressively in go-to-market activities for revenue growth and in R&D to capitalize on significant future AI expansion opportunities. Operating income was $897 million, representing a 12% operating margin compared to $1.3 billion or 22% a year ago. The decline was primarily due to the inventory and related charges. Taxes, interest expense and other totaled $126 million. For the second quarter of 2025, diluted earnings per share were $0.48 compared to $0.69 a year ago. The inventory and related charges reduced earnings per share by approximately $0.43. Now turning to our reportable segment, starting with Data Center. Data Center segment revenue was $3.2 billion, up 14% year-over-year, driven by strong EPYC CPU revenue and share gains across both cloud and enterprise customers. On a sequential basis, Data Center revenue decreased 12% due to the impact of the export controls on MI308. The Data Center segment operating loss was $155 million compared to operating income of $743 million a year ago or 26% of revenue. The loss was primarily due to the inventory and related charges. Client and Gaming segment revenue was $3.6 billion, up 69% year-over-year and 20% sequentially, driven by record client CPU sales and strong demand for our PC and console gaming products. In the Client business, revenue was a record of $2.5 billion, up 67% year-over-year, driven by record sales of our Ryzen desktop CPUs and a richer product mix. Gaming revenue rose to $1.1 billion, up 73% year-over-year, reflecting strong demand for our newly launched gaming GPUs and higher semi-custom revenue as inventory has now normalized and the customers prepare for the holiday season. Client and Gaming segment operating income was $767 million or 21% of revenue compared to $166 million or 8% a year ago, driven by richer Client product mix and operating leverage on higher revenue. Embedded segment revenue was $824 million, down 4% year-over-year and flat sequentially as Embedded end market demand remains mixed. Embedded segment operating income was $275 million or 33% of revenue compared to $345 million or 40% a year ago. The decline in operating income was primarily due to product mix. Before I review the balance sheet and cash flow, as a reminder, we closed the acquisition of ZT Systems early in the second quarter. As we had announced our intent to divest the ZT manufacturing business, the financial results of the ZT manufacturing business are reported separately in our financial statement as discontinued operations and are excluded from our non-GAAP financials. Subsequently, in May, we entered into agreement with Sanmina Corporation to sell the ZT manufacturing business for $3 billion in cash and stock, inclusive of contingent payment. The transaction is expected to close near the end of 2025, subject to regulatory approvals and the customary closing conditions. Turning to the balance sheet and cash flow. During the quarter, we generated $1.5 billion in cash from operating activities of continuing operations, and free cash flow was a record of $1.2 billion. We returned $478 million to shareholders through share repurchase, resulting in $1.2 billion in share repurchases for the first half of 2025. In May, our Board of Directors approved an additional $6 billion authorization. Exiting the quarter, we have $9.5 billion remaining under our share repurchase program. At the end of the quarter, cash, cash equivalents and short-term investment were $5.9 billion. Our long-term debt was $3.2 billion during the quarter. We paid down $950 million of commercial paper used to finance the ZT Systems acquisition close. Now turning to our third quarter 2025 outlook. Please note that our third quarter outlook does not include any revenue from AMD Instinct MI308 shipment to China as our license applications are currently under review by U.S. government. For the third quarter of 2025, we expect revenue to be approximately $8.7 billion, plus or minus $300 million. The midpoint of our guidance represents approximately 28% year-over-year revenue growth, driven by strong double-digit growth in our Client and Gaming, and Data Center segments. Sequentially, we expect revenue to grow by approximately 13%, driven by strong double-digit growth in the Data Center segment with the ramp of our AMD Instinct MI350 series GPU products; modest growth in our Client and Gaming segment, with Client revenue increasing and the Gaming revenue to be flattish; and our Embedded segment revenue to return to growth. In addition, we expect third quarter non-GAAP gross margin to be approximately 54%, and we expect non-GAAP operating expenses to be approximately $2.55 billion. We expect net interest and other expenses to be a gain of approximately $10 million. We expect our non-GAAP effective tax rate to be 13%, and diluted share count is expected to be approximately 1.63 billion shares. In closing, we executed very well in the first half of the year, delivering record revenue and building strong momentum for growth in the second half. The strategic investments we are making position us to capitalize on the expanding AI opportunities across all our end markets, driving sustainable long-term revenue growth and earnings expansion for compelling value creation. With that, I'll turn it back to Matt for the Q&A session."
    },
    {
      "speaker": "Matthew D. Ramsay",
      "role": "Vice President of Financial Strategy & Investor RelationsOperator, will you",
      "text": "Vice President of Financial Strategy & Investor RelationsOperator, will you please poll the audience for questions? Thank you. Question and Answer"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] And the first question comes from the line of Thomas O'Malley with Barclays."
    },
    {
      "speaker": "Thomas James O'Malley",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division Lisa, I want to start on the Client business. So you had previously laid out a second half outlook that was roughly flattish with the first half as you're kind of protecting against some pull forwards. So first, do you think that your Q2 results included some pull forwards and the second half should still be flattish? And longer term after the Intel commentary regarding 18A, maybe what that means as a knee-jerk reaction just right away for AMD longer term in terms of share and ASPs?"
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Sure, Tom. Thanks for the question. So first of all, our Client and Gaming segment and particularly our Client business just performed very well in the first half of the year. I think if you look at the entire first half, it was up 68% year-over-year. I think if you look underneath that, what we're seeing is strength in every part of our Client business, so we saw very strong sales in our desktop channel area. We have a leadership product there, best gaming GPUs with our X3D GPUs. We've had strong Ryzen AI adoption as well in the first half of the year. We see that in sell-through. And in addition, we've had strong enterprise sell-through as we brought that forward. So to your question of how much is pull forward, we don't think a whole lot of that is. We actually -- when we look at the sell-through patterns, the end user consumption is actually quite strong for Client in terms of going into the second half of the year. As we said in our Q3 guide, the primary driver of our Q3 guide is a very strong Data Center driven by MI350 ramping. We are expecting some growth in the Client business, so I wouldn't say it'll be flat to the first half, but it will be -- we're planning for it to be a little bit less than seasonal just given some of the uncertainties out there. But the Client business is performing extremely well for us, and we believe we are gaining share in all the right places. So if you look at the numbers in the first quarter, and it'll show through in the second quarter as well, a lot of the uplift in revenue is in ASPs. And that is basically we're selling up the stack on the strength of our portfolio. And I think we're still quite underrepresented in the enterprise portion of the business. That is where we have increased our go-to-market resources and focus, and we're seeing nice traction there, especially with the portfolios that we have from HP and Lenovo in enterprise PCs, and now we're adding Dell as well as ramping here, started in the second quarter. We'll ramp more in the second half of the year. So I think all of those are tailwinds for our Client business beyond the second half of '25 but really into the next number of quarters as we think about the portfolio and the opportunities for us."
    },
    {
      "speaker": "Thomas James O'Malley",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division Super helpful. And then secondly, I was hopeful you could provide us a little more color on China. So the guide doesn't include MI308, but perhaps you could comment on when you get approval, if the supply chain is ready, what's currently in inventory? And maybe compare what you think the contribution will look like versus the $700 million in Q2 and the $800 million for the second half you spoke about in April."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Sure, Tom. So yes, let me answer some of the questions on China. I'm sure that there are some questions. Look, we're very pleased with the progress that's been made with the administration over the last couple of months. We've been working very closely with the administration. I think the focus here on ensuring that U.S. technology gets utilized throughout the world is something that we certainly support and very much want to contribute to. China is an important market for us. Given the timing of licenses, we have a number of licenses that are under review now. We are working with the Department of Commerce to get those reviewed. We do expect that once those licenses are approved, we will start MI308 shipments. In terms of the supply chain, most of our inventory was not in finished goods, so it was work in process, and it will take us a couple of quarters to run through that. The exact timing of revenue and contribution will depend a bit on when those are -- when the licenses are actually granted. But overall, I think this is a better position than we were 90 days ago. And we certainly view China as a market that we would like to service with MI308, and we're working closely with the administration to do that."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Vivek Arya with Bank of America Securities."
    },
    {
      "speaker": "Vivek  Arya",
      "role": "BofA Securities, Research Division",
      "text": "BofA Securities, Research Division Lisa, if we look into 2026, right, that's when I think the sovereign opportunity could get quite meaningful for AMD. What is the right way to size that? What does this JV structure mean with some of the contracts that you signed? And would you consider this incremental to the kind of growth rate that you're seeing with your current MI business or would this be instead of? So just if you could give us a way to size what is that incremental opportunity from sovereign customers when it comes to '26. Like is it dependent on MI400, right, in which case it might be more [ back half weighted ], et cetera? So just some ways to think about sovereign for AMD next year."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes, absolutely, Vivek. Thanks for the question. So look, we're really excited about the overall AI opportunity for us with MI355 and the MI400 series as we go through the back half of this year and into 2026. I think it's -- there's a very large opportunity with, let's call it, hyperscalers, some of the leading AI companies as well as sovereign. I think sovereign is additive to that, for sure. From the standpoint of what to expect, there are also some regulatory things that need to be worked through on the sovereign side. But again, we're working closely with the administration as they go through the various regulatory decisions that need to be made. But from my perspective, I think the fact that countries want their own sovereign computing capability is very, very clear. I think we see that all over the world. The HUMAIN opportunity that you're referring to that we announced with the Kingdom of Saudi Arabia, I think, is a great example of where, together with their ambitions, our technology, I think you heard from Tareq that was -- he was at our event saying that, that would start with MI355, that we would expect that, that would continue on. I think what's attractive about our offering is our open ecosystem, and I think that really resonates with the sovereign community. But to your original question, I think it's an additive opportunity, and it's one that we believe will continue to be very important for us going forward with both MI355 as well as the MI400 series."
    },
    {
      "speaker": "Vivek  Arya",
      "role": "BofA Securities, Research Division",
      "text": "BofA Securities, Research Division Got it. And for my follow-up, I wanted to ask about gross margins for your MI product. So I understand in the early days, right, it has been dilutive. What kind of sales level is required for it to start becoming additive to margins? And let's say if I fast forward to Q4 and assume that your Q4 sales are growing year-on-year roughly the same rate as Q3 sales, should we expect gross margins to kind of stay at these Q3 levels? Or are there other plus/minus drivers we should think about in terms of gross margins as you go into Q4?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Yes. Vivek, thank you for the question. The gross margin for our MI product, we said it's a little bit below corporate average. I think at this point, our priority is really to address the larger, faster-growing revenue opportunities we have and provide customers a better TCO to really expand our presence in the marketplace. I think the way to think about our gross margin, there are different dynamics, right, different customers, different generations. But also our operation team has been continuing to really drive operational efficiency to improve our MI family's gross margin. That has been ongoing. So it's not necessarily really tied to, okay, the revenue level each quarter, but you should think about is a trend in the longer term, it should improve continually going forward. Overall, the way I think about these gross margin dollars, right, is -- this is one of the fastest-growing market opportunities for any financial metrics. Gross margin dollars is what we try to grab as much as we can. Hopefully, that helped your question."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Timothy Arcuri with UBS."
    },
    {
      "speaker": "Timothy Michael Arcuri",
      "role": "UBS Investment Bank, Research Division",
      "text": "UBS Investment Bank, Research Division Lisa, so my question is on Data Center GPU. You did say that June is up year-over-year, so it sounds like it's maybe a little more than $1 billion. And you used words like strong ramp into the back half of the year. Can you give us just any color on what that means? Can you get to, say, $7 billion for the year? And can you give us some -- maybe a milepost on what you're assuming for Q3? Would be great."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes. Thanks, Tim, for the question. I think what we said in the prepared remarks is that we are seeing a strong ramp from Q2 into Q3. MI355, we actually started production in June. So we had some shipments sort of in the month of June, but it really is ramping as we go through this quarter and the third quarter. So in terms of guideposts, we said it would grow year-on-year from last year. And that, I think, is a strong ramp, and then we would expect it to grow into the fourth quarter as well. The demand, I should say, what we're seeing from customers is I think really positive around MI355. Sort of the way I would contrast it with maybe the MI300 ramp, I think MI300 started with perhaps some smaller deployments. I think what we're seeing with MI355 is very competitive versus the B200, GB200 family of products. I think there's a strong desire to really use us at scale. The MI355 is very strong for inferencing. We're also working with a number of customers on training. And this is also an opportunity for us to build into the MI400 series as we go into 2026. So we're bullish on MI355 and where the AI opportunity is for us. And I think we're right on track to what we expected to be as we were going through the development of the road map."
    },
    {
      "speaker": "Timothy Michael Arcuri",
      "role": "UBS Investment Bank, Research Division",
      "text": "UBS Investment Bank, Research Division And then, Lisa, just on that point also, you did talk about a new developer cloud. So obviously, you're beginning to lease back some of the capacity that you're selling into the clouds and the neoclouds. Is that going to be a material portion of the revenue you're going to recognize for MI355 in the back half of the year? Can you just talk about that and maybe how to think about how much demand that's going to stimulate and what the ultimate goal is for that cloud?"
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes. So there are a couple of things in that question, so let me answer. So the developer cloud is simply we want to make it super easy for developers to get on AMD Instinct GPUs. One could say, again, if we look back at the MI300 family, we were very focused on the largest hyperscalers and the largest customers, but there's a lot of interest in the -- in our GPUs across a number of customers who just wanted easier access. And so by ensuring that a developer cloud is there, that it has ready-to-deploy containers. You can run training and inference easily. You don't necessarily have to make longer-term commitments. I think that's the purpose of the developer cloud. I don't think it adds meaningfully to revenue in the second half of the year, but it certainly adds to customers getting experience with AMD. I think the larger revenue opportunities for us are really with large customer adoption as they ramp to larger deployments. And we're very actively trying to get those deployments up and running as soon as possible. One of the things, just as a reminder, that the MI355 is -- given that it's a similar infrastructure to MI300, we actually think it's going to ramp very quickly and very well for customers, and I think that's one of the attractive portions of it as well."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Ross Seymore with Deutsche Bank."
    },
    {
      "speaker": "Ross Clark Seymore",
      "role": "Deutsche Bank AG, Research Division",
      "text": "Deutsche Bank AG, Research Division Lisa, want to go back to the Instinct side of things and the MI355 ramp. It looks like the second half is going to ramp really significantly. You said it's going to be up year-over-year in the third quarter. I believe a quarter ago, you said roughly the same thing. And the MI308 is out of both numbers, so that shouldn't really matter, and I guess it would be upside. But I just wondered how have things changed from a quarter ago as far as the MI350 family adoption, especially because you are -- you launched a little bit early. Is the growth a little bit more than you would have expected a quarter ago, about the same or a little worse? Just any sort of color on that would be helpful."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes, Ross, thanks for the question. I think the main thing I would say is, I think the adoption is a bit faster than we might have expected. Again, whenever you launch a product, we want to make sure that we go through the full validation and all of that with our customers. I think there's a lot of interest -- broad-based interest in MI355. And so I feel like, over the last 90 days, I think we've had significant sort of new customer interest, and that's certainly positive. I will say -- I'm sorry, Ross. I was just going to add, our engagements are -- I think the other piece is I think there's also a lot of excitement around MI400 and what we can do with the Helios rack. And so there are a number of customers who, based on sort of the strong road map that we're showing, want to get familiar and really work with us earlier in the life cycle, which I think is, again, positive."
    },
    {
      "speaker": "Ross Clark Seymore",
      "role": "Deutsche Bank AG, Research Division",
      "text": "Deutsche Bank AG, Research Division Great. I guess as my follow-up, an earlier question, you talked about a little bit below seasonality in the second half of the year for your Client business. It seems like there's just, I don't know, enough seasonality of the framework that matters. But how are you thinking about that for the second half as a whole for Client? And then Gaming, which was just up a huge amount sequentially in the second quarter, you described a little bit of what you're expecting there. But how do you think about seasonality for the second half and its entirety in the Gaming side as well?"
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes. Let me try, and then Jean might add if you want a little bit more color. So the way to think about it is we do expect the -- some growth -- sequential growth in clients as we go into the third quarter, I would say sort of single-digit type growth. We continue to see good traction for our products in that portfolio. On the Gaming side, I would call it flattish to Q2. And we're coming off of such a strong Q2 that I think flattish is actually to be expected. As we go into the fourth quarter, the dynamics that we would see is we would see that the console business would actually be down substantially, so think about it as down strong double digits. Our customers usually build for the holiday season in -- sort of before that, and then that will be completed by the fourth quarter. So we would expect as the Client and Gaming segment, that the segment would probably be down in the fourth quarter. So hopefully, that helps. Jean, did I -- did you want to add to that?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer No, I think you covered it."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Joshua Buchalter with TD Cowen."
    },
    {
      "speaker": "Joshua Louis Buchalter",
      "role": "TD Cowen, Research Division",
      "text": "TD Cowen, Research Division I wanted to ask about lead times on your -- on the Instinct family, both for the MI350 family and MI400. I mean, as you move into larger cluster sizes, which it sounds like you're doing at least with Oracle on 350 and then endeavor to do more so on 400, how much visibility and lead time do you need from your customers? Because I would imagine the lead time for your parts is measured in months, but on the infrastructure side, in particular, for the larger-scale deployments, I mean, those things are measured in years at this point. So maybe you could speak to the visibility specifically on the 400."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes. Sure, Josh. So yes, I mean, our lead times are long, given all of the processing steps that we have to go through. Think about it as somewhere between 8, 9 months, that type of thing. We have a very, very strong supply chain. We've been preparing for these ramps of both MI350 series and MI400 series and that preparation is ongoing. So we feel like we have a very strong supply chain there. In terms of visibility with customers, we're absolutely working with customers very closely on near-term MI350 series deployments, getting those deployments up as quickly as possible. Again, one of the things about the MI350 series that is good is that it can go into existing data centers given the -- just given the platform that it is in. So we have been certainly working with our customers there. And then for the MI400 series, there are lots and lots of details in sort of full rack scale design implementation, and we're actively working with the largest customers right now on just ensuring that our Helios rack is fully compatible with their data center build-outs as we go into 2026. So that visibility is important. I think that co-development, co-engineering is important as we get into the rack scale architecture. And the ZT team that we brought in has been extremely, extremely helpful in terms of both internal platform build-out as well as ensuring that we're working closely with our customers on their data center needs."
    },
    {
      "speaker": "Joshua Louis Buchalter",
      "role": "TD Cowen, Research Division",
      "text": "TD Cowen, Research Division Maybe for Jean, I wanted to follow up on Vivek's question earlier on gross margins. So if we add back the charges in 2Q -- and then your gross margin implied in the guidance is roughly flat sequentially and that's despite what's implied to be data center GPUs up meaningfully sequentially. It doesn't seem like console is falling off in the third quarter. I mean, can you maybe talk to the underlying drivers of how you're able to keep the flat gross margins despite what sounds like still margin dilutive data center GPUs up significantly within the mix?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Yes, Josh, thanks for the question. Yes, we are guiding our Q3 gross margin around 54%. And Q2, you're right, excluding the $800 million charge, it was close to 54%. I think the Gaming business actually is quite high, so the mix actually is unfavorable. But we do have some tailwinds we have been really driving. First is we have been expanding our server business, which has really nice gross margin. And on the Client business side, we are expanding the commercial PC business, so that really helps us to drive the gross margin up. In addition, we do have a really strong operational team. They are driving the gross margin improvement just from an operational efficiency perspective across the board. So overall, our objective is to continue to improve gross margin. Despite MI350 very strong ramp in Q3, we are able to continue to drive the margin up."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Joe Moore with Morgan Stanley."
    },
    {
      "speaker": "Joseph Lawrence Moore",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division You used this language before, the kind of tens of billions opportunity around MI400. Can you talk about the time frame when that might occur and not to pin you down too much, but -- and what would help you get to that level sooner rather than later? Should we think of that as a 2027 realistic outcome that you could be looking at $20 billion-plus? Just a little bit more color on that tens of billions comment."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes. I mean, maybe without being specific, Joe, I can give you sort of the way I look at it and back to this notion of are we incrementally more confident. I think we're seeing a lot of positive signs in our AI customer adoption, I think the strength of the MI350 series, the very positive feedback that we're getting on MI400 from customers, the work that we're doing in terms of ensuring that we are fully ready for large-scale deployments of not just inference but training. I think when we get to tens of billions of dollars, we're talking about significant gigawatt-scale type deployments. And those would be important for us to get there. And we're certainly, I think, engaged with all of the right customers that can enable that type of ramp. But I won't necessarily speculate on the exact time other than to say, certainly, that would be our set of aspirations."
    },
    {
      "speaker": "Joseph Lawrence Moore",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Right. That's helpful. And then as these workloads evolve, I mean, you've sort of talked about inference and training and sort of different opportunities for AMD. Are you seeing those start to come together? It seems like with inference, there's -- the reasoning models are requiring much higher complexity. Is rack scale more important to the inference market than you thought it might be? Just any color around how that complexity of inference is impacting you guys."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes, I think that's absolutely true, Joe. I think with the proliferation of models, I think what we're seeing is GPUs continue to be very -- sort of the computing of choice as you think about all the models that are out there. And then as you go into distributed inference and some of the newer techniques, we are seeing the importance of the scale-up and scale-out architecture, which we are investing in. But I think the overarching thing is, I think, we have a very competitive road map across the next couple of generations. I think that has now gotten strong customer validation. We're getting a lot of feedback from customers on where they would like to see us continue to add more resources and add more focus, and so that is very helpful. And the key is to be a full-scale solution provider for these large customer deployments, and that's what we're working on."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Aaron Rakers with Wells Fargo."
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division I do have a follow-up as well. I guess the first question is when we look at the Data Center guide, Jean, you had alluded to double-digit sequential growth. Obviously, the MI355 series kind of ramping. I'm curious, how can we conceptualize what you're expecting in the server side? And where do you think your market share is today in traditional enterprise servers outside of cloud?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Yes. I think when you look at our Data Center business, we do have a strong double-digit growth, both in server and MI. Both sides are growing sequentially. Of course, MI ramp is the most significant one. As far as the server market share, we do think we continue to drive the market share up compared to Q1. It's not -- a third party has not published a report yet, but we feel really good about the Q2 market share increase versus Q1."
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Aaron, if I'd just add to that, one of the things that -- it's important for people to understand is in some of the cloud CapEx numbers that have come out that have been quite positive, that is not only a GPU statement, but there's actually significant CPU CapEx in there as well. We started to see more robust forecasts going out a number of quarters on the server CPU side because all of that AI content really requires traditional CPUs as well. And so we're very bullish on the opportunity in servers. I think the team has really executed extremely well. I mean, if you look at our portfolio now, Turin and Genoa are very well adopted, broadening workloads. Enterprise adoption is also increasing. And so I think all of those are positive for the server opportunity in the second half of '25 as well as going into '26 and beyond."
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division Yes. And then as a follow-up, I'm kind of thinking about the China, the MI308 opportunity. When we do see a license, I think you alluded to this earlier, it's going to take a little bit of time to kind of ramp and get the supply chain to satisfy the demand. But I'm curious, the $800 million write-down that you had taken, is there no kind of finished inventory there? Does that come back? Do you have any reversal aspects of that once the license gets approved?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Let me start first. Then Lisa can add. First, on the $800 million, majority of them are WIPs. We really don't have that on the shelf, a finished good we can ship immediately. So we do need to take time if we get license."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of C.J. Muse with Cantor Fitzgerald."
    },
    {
      "speaker": "Christopher James Muse",
      "role": "Cantor Fitzgerald & Co., Research Division",
      "text": "Cantor Fitzgerald & Co., Research Division I guess, Lisa, was hoping you could level set us on the Instinct ramp into 2026. How are you thinking about the timing of the handoff, 350 to 400? How are you thinking about Helios' contributions? And I guess very importantly from a customer contribution perspective, how you might see that evolve from traditional hyperscalers to perhaps more sovereign and neocloud with the mix?"
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Sure, C.J. So certainly, as second half this year, it's all about MI355 ramp into first half of next year. I think the MI400 series development is right on track. The development of the Helios platform is also right on track. We would expect significant revenue contribution from Helios in 2026. And then relative to the contribution of the various things, hyperscalers, sort of some of the -- versus neoclouds, versus sovereign, I think it's a little early to really talk about the different pieces other than to say you would expect that hyperscalers and, let's call it, neoclouds that would be working for other large AI natives may be significant pieces of the initial ramp and then sovereign may come a little bit later in time just given sort of the timing of when different build-outs would happen. So hopefully, that gives you some color, C.J."
    },
    {
      "speaker": "Christopher James Muse",
      "role": "Cantor Fitzgerald & Co., Research Division",
      "text": "Cantor Fitzgerald & Co., Research Division Yes, very helpful. And then, Jean, I guess, a question for you. With the sale of ZT for $3 billion of cash and stock and you only have $3 billion of debt outstanding, how are you thinking about the use of proceeds? Is there saving for a rainy day or bolt-on acquisitions, perhaps more aggressive share buyback? How are you thinking about it today?"
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Yes, thanks for the question. Our business model actually generated a lot of free cash flow. As you see in Q2, free cash flow generation was $1.2 billion. So if we close the ZT sale and we'll get more cash, overall, our capital allocation principle continues to be the first phase, investing, especially with the tremendous AI opportunities ahead of us. And then we will continue to return cash to shareholders. We did a $1.2 billion repurchase in the first half of the year. We are committed to continue to return cash to shareholders through share repurchase."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Okay. The final question comes from the line of Ben Reitzes with Melius Research."
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC I wanted to clarify a little bit on the $1 billion increase in sequential sales. It would seem like it's coming from GPUs primarily. I was wondering if you could back that. And that's with nothing in China, and if the answer to the prior question that GPUs are over $1 billion, that kind of puts you at a $2 billion run rate. And I was just wondering if that was accurate in terms of thinking. And then I have just a very quick follow-up."
    },
    {
      "speaker": "Jean X. Hu",
      "role": "Executive VP, CFO & Treasurer",
      "text": "Executive VP, CFO & Treasurer Ben, thanks for the question. If you look at the sequential revenue increase, as I mentioned during the prepared remarks, we see Data Center a strong double-digit increase, which include both GPU and CPU, but GPU definitely drives largest incremental amount increase. We also mentioned the Client actually is going to increase sequentially. In addition, the Embedded business will return to sequential growth. So multiple business contributed to sequential increase, but the majority of the increase is really driven by MI355's strong ramp."
    },
    {
      "speaker": "Benjamin Alexander Reitzes",
      "role": "Melius Research LLC",
      "text": "Melius Research LLC Okay. Great. And then if indeed that gets you pretty close to a couple billion dollars, if the MI300 comes in, do you see it at the same run rate that you exited and then you have the ability to get at the $800 million run rate right away? Or you think it will take several quarters to ramp when you get the license?"
    },
    {
      "speaker": "Lisa T. Su",
      "role": "Chair, President & CEO",
      "text": "Chair, President & CEO Yes, Ben, it will take some time to ramp, just given -- particularly today, I mean, we're sitting already in early August, so I don't think you would see a lot of it in Q3. But certainly, as licenses would be approved, we would schedule that, and it would take a little while to ramp."
    },
    {
      "speaker": "Matthew D. Ramsay",
      "role": "Vice President of Financial Strategy & Investor Relations",
      "text": "Vice President of Financial Strategy & Investor Relations All right, operator, thank you very much. We appreciate everybody that joined the call today, and we'd just like to end the call now. Thank you. OperatorLadies and gentlemen, that does conclude today's teleconference. We thank you for your participation. You may disconnect your lines at this time. Copyright  2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.  2025 S&P Global Market Intelligence."
    }
  ],
  "source_file": "Advanced Micro Devices, Inc., Q2 2025 Earnings Call, Aug 05, 2025.rtf"
}