{
  "event_id": "AMZN_2026-02-05",
  "ticker": "AMZN",
  "company": "Amazon.com, Inc.",
  "quarter": 4,
  "fiscal_year": 2025,
  "call_date": "2026-02-05",
  "call_start_ts": "2026-02-05 22:00:00+00:00",
  "raw_text": "\n|[pic]                     |\n\nAmazon.com, Inc. NasdaqGS:AMZN\nFQ4 2025 Earnings Call Transcripts\nThursday, February 5, 2026 10:00 PM GMT\nS&P Global Market Intelligence Estimates\n|      |-FQ4 2025-           |-FQ1  |-FY 2025-            |-FY   |\n|      |                     |2026- |                     |2026- |\n|                              |CONSENSUS      |ACTUAL         |SURPRISE       |\n|                   |CONSENSUS          |ACTUAL             |SURPRISE           |\n|FQ1 2025           |1.36               |1.59               |[pic]16.91 %       |\n|FQ2 2025           |1.32               |1.68               |[pic]27.27 %       |\n|FQ3 2025           |1.56               |1.95               |[pic]25.00 %       |\n|FQ4 2025           |1.95               |1.95               |[pic]0.00 %        |\n\n|Table of Contents                                     |   |\n|Call Participants          |..............................................|3      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Presentation               |..............................................|4      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Question and Answer        |..............................................|11     |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|                                                                                  |\n|Call Participants                                                                 |\n|                           |                           |                           |\n|EXECUTIVES                 |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Andrew R. Jassy            |                           |                           |\n|President, CEO & Director  |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Brian T. Olsavsky          |                           |                           |\n|Senior VP & CFO            |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Dave  Fildes               |                           |                           |\n|Vice President of Investor |                           |                           |\n|Relations                  |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|ANALYSTS                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Brian Thomas Nowak         |                           |                           |\n|Morgan Stanley, Research   |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Douglas Till Anmuth        |                           |                           |\n|JPMorgan Chase & Co,       |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Eric James Sheridan        |                           |                           |\n|Goldman Sachs Group, Inc., |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Mark Stephen F. Mahaney    |                           |                           |\n|Evercore ISI Institutional |                           |                           |\n|Equities, Research Division|                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Michael Paul Morton        |                           |                           |\n|MoffettNathanson LLC       |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Ross Adam Sandler          |                           |                           |\n|Barclays Bank PLC, Research|                           |                           |\n|Division                   |                           |                           |\n|                                                                                  |\n\n\nPresentation\n\n\nOperator\n\nThank you for standing by. Good day, everyone, and welcome to the\nAmazon.com Fourth Quarter 2025 Financial Results Teleconference. [Operator\nInstructions] Today's call is being recorded.\n\n\nAnd for opening remarks, I will be turning the call over to the Vice\nPresident of Investor Relations, Mr. Dave Fildes. Thank you, sir. Please go\nahead.\n\n\nDave  Fildes\nVice President of Investor Relations\n\nHello, and welcome to our Q4 2025 financial results conference call.\nJoining us today to answer your questions is Andy Jassy, our CEO; and Brian\nOlsavsky, our CFO.\n\n\nAs you listen to today's conference call, we encourage you to have our\npress release in front of you, which includes our financial results as well\nas metrics and commentary on the quarter. Please note, unless otherwise\nstated, all comparisons in this call will be against our results for the\ncomparable period of 2024. Our comments and responses to your questions\nreflect management's views as of today, February 5, 2026, only, and will\ninclude forward-looking statements. Actual results may differ materially.\nAdditional information about factors that could potentially impact our\nfinancial results is included in today's press release and our filings with\nthe SEC, including our most recent annual report on Form 10-K and\nsubsequent filings.\n\n\nDuring this call, we may discuss certain non-GAAP financial measures. In\nour press release, slides accompanying this webcast and our filings with\nthe SEC, each of which is posted on our IR website, you will find\nadditional disclosures regarding these non-GAAP measures, including\nreconciliations of these measures with comparable GAAP measures.\n\n\nOur guidance incorporates the order trends that we've seen to date and what\nwe believe today to be appropriate assumptions. Our results are inherently\nunpredictable and may be materially affected by many factors, including\nfluctuations in foreign exchange rates and energy prices, changes in global\neconomic and geopolitical conditions, tariff and trade policies, resource\nand supply volatility, including for memory chips and customer demand and\nspending, including the impact of recessionary fears, inflation, interest\nrates, regional labor market constraints, world events, the rate of growth\nof the Internet, online commerce, cloud services and new and emerging\ntechnologies and the various factors detailed in our filings with the SEC.\nOur guidance assumes, among other things, that we don't conclude any\nadditional business acquisitions, restructurings or legal settlements. It's\nnot possible to accurately predict demand for our goods and services, and\ntherefore, our actual results could differ materially from our guidance.\n\n\nAnd now I'll turn the call over to Andy.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nThanks, Dave. We're reporting $213.4 billion in revenue, up 12% year-over-\nyear, excluding the impact from foreign exchange rates. Operating income\nwas $25 billion and trailing 12-month free cash flow was $11.2 billion.\n\n\nWe're seeing strong growth and with the incremental opportunities available\nto us in areas like AI, chips, low earth orbit satellites, quick commerce\nand serving more consumers' everyday essentials needs, we have a chance to\nbuild an even more meaningful business in Amazon in the coming years with\nstrong return on invested capital, and we're investing to do so.\n\n\nWe're already seeing strong demand in these areas even in these early\ninnings. I'll start with AWS. AWS growth continued to accelerate to 24%,\nthe fastest we've seen in 13 quarters, up $2.6 billion quarter-over-quarter\nand nearly $7 billion year-over-year. AWS is now a $142 billion annualized\nrun rate business, and our chips business, inclusive of Graviton and\nTrainium is now over $10 billion in annual revenue run rate, growing triple-\ndigit percentages year-over-year. As a reminder, it's very different having\n24% year-over-year growth on a $142 billion annualized run rate than to\nhave a higher percentage growth on a meaningfully smaller base, which is\nthe case with our competitors. We continue to add more incremental revenue\nand capacity than others and extend our leadership position.\n\n\nWe're continuing to see strong growth in core non-AI workloads as\nenterprises return to focusing on moving infrastructure from on-premises to\nthe cloud, along with AWS having the broadest functionality, strongest\nsecurity and operational performance and most vibrant partner ecosystem.\nAWS continues to earn most of the big enterprise and government transitions\nto cloud.\n\n\nSince our last call, we announced new agreements with OpenAI, Visa, the\nNBA, BlackRock, Perplexity, Lyft, United Airlines, DoorDash, Salesforce,\nU.S. Air Force, Adobe, Thomson Reuters, AT&T, S&P Global, National Bank of\nCanada, the London Stock Exchange Group, Choice Hotels, Accenture, Indeed,\nHSBC, CrowdStrike, and more. More of the top 500 U.S. start-ups use AWS as\ntheir primary cloud provider than the next two providers combined.\n\n\nWe're adding significant EC2 core computing capacity each day, and the\nmajority of that new compute is using our custom CPU silicon, Graviton.\nGraviton is up to 40% more price performance than leading x86 processors\nand is used expansively by over 90% of AWS' top 1,000 customers. Graviton\nitself is a multibillion-dollar annualized run rate business, growing more\nthan 50% year-over-year. We consistently see customers wanting to run their\nAI workloads where the rest of their applications and data are.\n\n\nWe're also seeing that as customers run large AI workloads on AWS, they're\nadding to their core AWS footprint as well. But the biggest reason that AWS\ncontinues to gain AI share is our uniquely broad top to bottom AI stack\nfunctionality. In AI, we're doing what we've always done in AWS, solving\ncustomer challenges.\n\n\nLet me give you some examples. The first challenge is having a strong\nfoundation model to generate inferences or predictions. Customers are\nrealizing as they get further into AI that they need choice as different\nmodels are better on different dimensions. In fact, most sophisticated AI\napplications leverage multiple models, whether customers want frontier\nmodels like Anthropic's Claude or open models like Mistral or Llama,\nFrontier Intelligence with lower cost and latency like Amazon Nova or video\nand audio models like TwelveLabs or Nova Sonic. Amazon Bedrock makes it\neasy to use these models to run inference securely, scalably and\nperformantly. Bedrock is now a multibillion-dollar annualized run rate\nbusiness and customer spend grew 60% quarter-over-quarter.\n\n\nThe second challenge is how to hone the model for your application.\nCustomers sometimes think if they have a good model, they will have a good\nAI application. It's not really true. It takes a lot of work to post train\nand fine-tune a model for your application. Our SageMaker AI service, along\nwith fine-tuning tools in Bedrock make this much easier for customers.\n\n\nA third challenge is how to have a custom version of a foundation model\nthat best leverages the company's secret sauce, their own data. To date,\ncompanies have tried to shape models with their own data late in the\nprocess, usually with fine-tuning or post-training. There's a debate in the\nindustry about this, but we believe that enterprises will want models\ntrained on their own data at an early stage of pretraining if possible. So\ntheir models have the best possible foundation for what matters most to\neach enterprise on which to learn and evolve. It's a little like teaching a\nchild of foreign language early in their life. That becomes part of their\nlearning foundation moving forward, and it makes it easier to pick up other\nlanguages later in their life.\n\n\nTo solve for this need, we just launched Nova Forge, which give customers\nearly checkpoints on our Amazon Nova models, allows them to securely mix\ntheir own proprietary data with the models data in the pretraining stage\nand enables their own uniquely customized versions of Nova, what we call\nNovellas, trained with their data early in the process. This will be very\nuseful for companies as they build their own agents on top of the model.\nThere is nothing else out there like this today and a potential game\nchanger for companies.\n\n\nAnother challenge is cost. I've said this many times, but if we want AI to\nbe used as expansively as companies want, we have to make the cost of\ninference lower. A significant impediment today is the cost of AI chips.\nCustomers are starving for better price performance. And typically, and\nunderstandably, the dominant early leaders aren't in a hurry to make that\nhappen. They have other priorities. It's why we've built our own custom\nsilicon and Trainium, and it's really taken off. We've landed over 1.4\nmillion Trainium2  chips, our fastest ramping chip launch ever. Trainium2\nis 30% to 40% more price performance than comparable GPUs and is a\nmultibillion-dollar annualized revenue run rate business with 100,000-plus\ncompanies using it as Trainium is the majority underpinning of Bedrock\nusage today. We recently launched Trainium2, which is up to 40% more price\nperformance than Trainium2. We're seeing very strong demand for Trainium3\nand expect nearly all of our Trainium3 supply of chips to be committed by\nmid-2026. And though we're still building Trainium4, we're seeing very\nstrong interest already.\n\n\nLooking ahead, the primary way companies will get value from AI is with\nagents, some their own, some from others, and there are several customer\nchallenges that we're well positioned to solve. It's harder to build agents\nthan it should be. For that, we've built Strands, a service enabling agents\nto be created from any model. Once agents are built, enterprises are\napprehensive about deploying to production because these agents need to\nsecurely and scalably connect to compute, data, tools, memory, identity,\npolicy governance, performance monitoring and other elements. This is a new\nand hard problem where a solution has not existed until we launched Bedrock\nAgentCore. Customers are quite excited about AgentCore, and it's unlocking\ndeployments.\n\n\nCustomers also want to leverage others' useful agents, and we've built\nseveral, including Kiro for coding, Amazon Quick for knowledge workers to\nleverage their own data and analytics, AWS Transform for software migration\nand Amazon Connect for call center operations. We continue adding new\ncapabilities and usage continues to grow quickly. For example, the number\nof developers using Kiro grew more than 150% quarter-over-quarter.\n\n\nIn addition to agents that customers direct, customers are also becoming\nexcited about agents that require less human interaction. They can be fully\nautonomous, run persistently for hours or days, scale out quickly and\nremember context. At this past AWS re:Invent, we launched Frontier Agents\nto do that. Kiro autonomous agents for coding tasks, AWS DevOps agents for\ndetecting and resolving operational issues and AWS security agents for\nproactively securing applications throughout the development life cycle,\nand they're already making a big difference for customers.\n\n\nWe expect to invest about $200 billion in capital expenditures across\nAmazon, but predominantly in AWS because we have very high demand,\ncustomers really want AWS for core and AI workloads, and we're monetizing\ncapacity as fast as we can install it. We have deep experience\nunderstanding demand signals in the AWS business and then turning that\ncapacity into strong return on invested capital. We're confident this will\nbe the case here as well.\n\n\nI'll now turn to stores. We continue to expand selection, including more\nthan 400 new beauty brands in the U.S. in 2025, like Bobbi Brown Cosmetics,\nCharlotte Tilbury and Laura Mercier and new fashion brands like Away\nLuggage, Converse, Diesel, Michael Kors, Nike and The North Face. Our ultra-\nlow-priced offering, Amazon Haul, grew selection to over 1 million items\nunder $10 and expanded to serve customers in more than 25 countries and\nregions.\n\n\nWe continue to see strong customer response to Everyday Essentials and\ngrocery. In 2025, Everyday Essentials grew nearly twice as fast as all\nother categories in the U.S., representing one out of every three units\nsold in our store, and we've become a go-to grocery destination for over\n150 million Americans, mostly through online shopping and Whole Foods. With\nover $150 billion in gross sales, Amazon is clearly a large grocer at this\npoint. Customers in thousands of U.S. cities and towns can now get\nperishables delivered same day alongside millions of other items and\ncustomers who use that service shop more than twice as often as customers\nwho don't. We plan to expand to many more communities in 2026, and we also\nplan to open more than 100 new Whole Foods Market stores over the next few\nyears as we work to make grocery shopping easier, faster and more\naffordable for customers.\n\n\nWe remain committed to staying sharp on price and continue to meet or beat\nother retailers' prices. A recent study from Profitero showed that Amazon\nis America's lowest priced retailer for the ninth straight year, 14% lower\non average than other major online retailers. We again achieved our fastest\never delivery speeds for Prime members around the world in 2025. In the\nU.S., we delivered nearly 70% more items same day than the year before. We\nalso continue increasing speed for rural customers with nearly 2x more\naverage monthly customers in rural areas receiving same-day delivery year-\nover-year.\n\n\nSame-day is our fastest-growing delivery offering and nearly 100 million\ncustomers used it last year in the U.S. And the team is continuing to\ninnovate. We've launched Amazon now in India, Mexico and the UAE, ultrafast\ndelivery on thousands of items in about 30 minutes or less, and we're\ntesting it in several communities in the U.S. and U.K. It's early, but\ncustomers are loving it. For example, in India, customer response exceeded\nour most optimistic expectations, and we're seeing Prime members triple\ntheir shopping frequency once they start using it.\n\n\nExpanding our same-day delivery coverage also leads to meaningfully later\ncutoff times for orders, which is a big deal for customers. For example, on\nChristmas Eve, customers in about 4,000 U.S. cities could order items up\nuntil midday and get them that same day. Another example is our recently\nlaunched feature add to Delivery, which enables Prime members in the U.S.\nto add items to their upcoming Amazon deliveries with just one tap without\ngoing through checkout again or paying additional shipping fees.\n\n\nJust six months after launch, ad to delivery already makes up about 10% of\nall Prime volume fulfilled through the Amazon network each week. While this\nseems simple on the surface, this feature is supported by a lot of\ninvention where we need to figure out in real time and with incredibly low\nlatency, what items among Amazon's hundreds of millions of products are\navailable to add to a customer's upcoming deliveries, surface them, find a\nway to include in their packages and deliver within the same customer\npromise.\n\n\nThe stores team is also continuing to innovate and deliver for customers\nwith AI. Our Agentic AI shopping assistant, Rufus, has rapidly expanded.\nRufus can research products, track prices and auto buy, purchasing a\nproduct in our store when it reaches your set price. It can also now shop\ntens of millions of items in other online stores and make purchases for\ncustomers using our Agentic Buy for Me feature. Last year, more than 300\nmillion customers used Rufus. In addition, customers use Lens, our AI-\npowered visual search tool to find products with a phone's camera, a\nscreenshot or a barcode, and they did it 45% more year-over-year.\n\n\nMoving on to Amazon Ads. We're pleased with the continued strong growth\nacross our full funnel offerings, generating $21.3 billion of revenue in\nthe quarter and growing 22% year-over-year. Sponsored products advertising\nin our store continues to be our largest ads offering and the combination\nof trillions of shopping, browsing and streaming signals with advanced AI\nand machine learning led us to deliver highly relevant and useful ads for\ncustomers. We saw continued growth in Prime Video ads, which is now\navailable in 16 countries and is contributing meaningfully to our revenue\ngrowth. Prime Video has an average ad-supported audience of 315 million\nviewers globally, up from 200 million in early 2024.\n\n\nOur ads team is also innovating with AI. We recently announced our ads\nagent, which lets brands use AI to create and optimize campaigns at scale,\nimplement effective campaign targeting and quickly create actionable\ninsights. And our creative agent lets advertisers research, brainstorm and\ngenerate full funnel ad campaigns from concept to completion using\nconversational guidance in Amazon's retail data, transforming what was a\nweek-long process into just hours.\n\n\nWe're also continuing to invent and see momentum in several other areas,\nand I'll mention just a few. Starting with live sports on Prime. The fourth\nseason of Thursday Night Football broke more records. It was our most\nwatched season ever, averaging more than 15 million viewers, a 16% year-\nover-year increase and a third consecutive year of double-digit growth. And\nthe Packers versus Bears wild card game was the most streamed NFL game in\nhistory with 31.6 million viewers, clearing the prior mark by more than 4\nmillion.\n\n\nWe just made Alexa+ available to all customers in the U.S., free for Prime\nmembers and $19.99 a month for non-Prime members. Alexa+ continues to get\neven better and more capable, and we've added new ways to interact with\nAlexa, including a new chat experience at alexa.com, a redesigned mobile\napp and new integrations with third-party devices like Samsung TVs and BMW\ncars. We've also added new features like the ability to answer a ring\ndoorbell on a customer's behalf and more ways to shop or manage a home. And\nfinally, the team is making rapid progress on Amazon Leo, which will bring\nconnectivity to consumers, enterprises and governments in places where they\ndon't have broadband connectivity. Our enterprise-grade customer terminal,\nLeo Ultra, is the fastest satellite Internet antenna ever built, delivering\nsimultaneous download speeds of up to 1 gigabit per second and upload\nspeeds of up to 400 megabits per second. Leo will offer enterprise-grade\nperformance and advanced encryption with secure private networking that\nbypasses public Internet connecting directly to AWS. We've launched 180\nsatellites, have more than 20 launches planned in 2026, more than 30 in\n2027 and expect to launch commercially in 2026.\n\n\nWe have dozens of commercial agreements already signed, including with\nAT&T, DIRECTV Latin America, JetBlue and Australia's national broadband\nnetwork and have many more on the way. It's been an action-packed year of\ninnovation and progress, and we've hit the ground running in 2026.\n\n\nWith that, I'll turn it over to Brian for a financial update.\n\n\nBrian T. Olsavsky\nSenior VP & CFO\n\nThanks, Andy. Starting with our top line financial results. Worldwide\nrevenue was $213.4 billion, a 12% increase year-over-year, excluding the\n150 basis point favorable impact of foreign exchange. In Q4, we reported\nworldwide operating income of $25 billion.\n\n\nThis operating income includes three special charges, which reduced\noperating income by $2.4 billion. The first charge of $1.1 billion is for\nthe resolution of tax disputes associated with our stores business in Italy\nand the settlement of a lawsuit. This charge primarily impacts our\nInternational segment and is largely recorded in the fulfillment and other\noperating expense line items. Second charge of $730 million is for the\nestimated severance costs. This charge impacts all three of our segments\nand is recorded primarily in the fulfillment, sales and marketing and\ntechnology and infrastructure expense line items. The third charge of $610\nmillion is for asset impairments, primarily related to physical stores.\nThis charge primarily impacts the North America segment and is recorded in\nthe other operating expense line.\n\n\nMoving on to our segment results. In the North America segment, fourth\nquarter revenue was $127.1 billion, an increase of 10% year-over-year.\nInternational segment revenue was $50.7 billion, an increase of 11% year-\nover-year, excluding the impact of foreign exchange. Worldwide paid units\ngrew 12% year-over-year, which was our highest quarterly growth rate in\n2025.\n\n\nThe fourth quarter marked a strong finish to the year as we delivered to\ncustomers during the peak holiday season. Our sharp pricing, vast selection\nand record fast delivery speeds resonated with customers. They appreciate\nthe convenience of receiving their items quickly from gifts for family and\nfriends to everyday essentials and perishable groceries. Our millions of\nglobal third-party sellers continue to be an important contributor to our\nbroad selection. In Q4, Worldwide third-party seller unit mix was 61%.\n\n\nWe continue to invest in tools and services, including a comprehensive\nsuite of AI tools that help our selling partners manage and grow their\nbusinesses.\n\n\nShifting to profitability. North America segment operating income was $11.5\nbillion with an operating margin of 9%, up from an 8% margin in Q4 of 2024.\nInternational segment operating income was $1 billion with an operating\nmargin of 2.1%. Excluding the impact of special charges mentioned earlier,\nInternational segment operating margins also expanded year-over-year.\n\n\nWe're pleased with the fulfillment network performance throughout the peak\nseason. We made strong progress improving the cost structure of our network\nover the past few years. In the U.S., our regionalized network is operating\nat scale, and we continue to make refinements. This regionalization has\nimproved local inventory placement, leading to faster delivery at lower\ncosts.\n\n\nLast year, U.S. Prime members received over 8 billion items the same or\nnext day, up more than 30% year-over-year, with groceries and everyday\nessentials making up half of the total items. For the third year in a row,\nglobally, in 2025, we achieved both our fastest ever delivery speeds for\nPrime members while also reducing our cost to serve. By leveraging our\nexisting U.S. network, we can now deliver perishable groceries to customers\nin more than 2,300 cities and towns, all with same-day delivery. We saw\nsignificant adoption of this service throughout the year. When customers\nengage with our perishable offering, they demonstrate notably higher\nmonthly spend compared to those who do not shop the category. We also see\nthat customers shopping perishable groceries add 3x more items to their\nsame-day delivery orders. Looking ahead, we see further opportunity to\nenhance productivity in our global fulfillment network while delivering at\nfaster speeds for customers. We will continue optimizing inventory\nplacement to drive down distance travel, reduce touches per package and\nimprove package consolidation as well as launch robotics and automation to\nincrease efficiency and elevate the customer experience.\n\n\nShifting to advertising. Advertising revenue grew 22% in the fourth\nquarter, and we added over $12 billion of incremental revenue in 2025 alone\nas our full funnel advertising approach of connecting brands with customers\nis resonating simplifying the advertiser experience to enable brands to\nbetter reach customers wherever they are.\n\n\nMoving next to our AWS segment. Revenue was $35.6 billion and growth\naccelerated to 24% year-over-year. We added $2.6 billion in quarter-over-\nquarter revenue and AWS now has an annualized revenue run rate of $142\nbillion. This acceleration was driven by both core and AI services as\ncustomers continue to modernize their infrastructure and migrate workloads\nto the cloud.\n\n\nOur AI offerings continue to resonate with customers, including our agentic\ncapabilities. This growth was helped in part by the more than 1 gigawatt of\ncapacity we added in Q4. In 2025, AWS added more data center capacity than\nany other company in the world. AWS operating income was $12.5 billion.\nWe're seeing strong top line growth while remaining focused on driving\nefficiencies across the business. This includes investing in software and\nprocess improvements to optimize server capacity, developing a more\nefficient network using our lower-cost custom networking gear and advancing\ncustom silicon. At the same time, we continue to rapidly develop products\nand services on behalf of customers. As we've long said, we expect AWS\noperating margins to fluctuate over time, driven in part by the level of\ninvestments we're making at any point in time.\n\n\nTurning to cash flows. Our full year operating cash flow increased to\n$139.5 billion in 2025, up 20% year-over-year due primarily to improved\noperating income and changes in working capital.\n\n\nNow turning to our Q1 financial guidance. Q1 net sales are expected to be\nbetween $173.5 billion and $178.5 billion. This guidance anticipates a\nfavorable impact of approximately 180 basis points from foreign exchange\nrates. As a reminder, global currencies can fluctuate during the quarter.\nQ1 operating income is expected to be between $16.5 billion and $21.5\nbillion.\n\n\nA few things to mention on the operating income guidance. Within the North\nAmerica segment, we do expect a year-over-year cost increase of\napproximately $1 billion related to Amazon Leo. We have more than 20\nlaunches planned in 2026 and more than 30 in 2027, which means we're\nspending more on launching satellites each year. Select enterprise\ncustomers are testing Amazon Leo services now, and we expect a wider\ncommercial rollout later this year. As a reminder, today, we do expense\nmost of these Leo costs as incurred. We expect that later in the year, many\nof these costs such as satellite manufacturing and launch services will be\ncapitalized.\n\n\nWithin the International segment, we're continuing to invest more in our\nstores business to enhance the customer experience and to encourage retail\ndemand to move online more quickly. This includes bringing faster delivery\noptions, including Amazon Now, our service, which delivers to customers in\n30 minutes or less.\n\n\nWe're also working hard to stay sharp on pricing and seller fees. And there\nare countries where we've had to be more aggressive to meet or beat\ncompetitors' prices. We like these investments because they will delight\ncustomers, grow our business, and we believe they will generate long-term\npositive return on invested capital.\n\n\nAs we enter 2026, I'm energized by our team's strong execution. I want to\nthank everyone across the company for their hard work on behalf of our\ncustomers. We remain focused on driving an even better customer experience,\nwhich is the only reliable way to create lasting value for our\nshareholders.\nWith that, let's move on to your questions.\n\n\nQuestion and Answer\n\n\nOperator\n\n[Operator Instructions] Our first question comes from the line of Mark\nMahaney with Evercore ISI.\n\n\nMark Stephen F. Mahaney\nEvercore ISI Institutional Equities, Research Division\n\nI think, Brian, let me throw this to you or maybe to Andy. On the strong\nlong-term return on invested capital, I think that's the debate in the\nmarket today. So could you give us a little bit more insight into how you\nthink investors will be able to see that, either talk about the duration of\nthe CapEx cycle that you're going through now or what we should see in\nterms of profitability levels?\n\n\nAnd maybe also talk about like other de minimis or minimum free cash flow\ngeneration levels that you don't want to go below as you go through this\nCapEx cycle. Just help us get to that -- get to your level of confidence in\nhaving a strong long-term return on that invested capital.\n\n\nBrian T. Olsavsky\nSenior VP & CFO\n\nYes. Sure, Mark. Thank you. I'll start from the financial side. So on the\ninvestments we're making, as Andy said earlier, we are putting into service\nwith customers all capacity that we're getting and it's immediately useful.\nAnd we're also seeing a long arc of additional revenue that we see from\nother customers and backlog and commitments that people are anxious to make\nwith us, especially for AI services. So you can see that's working its way\ninto our P&L, both through CapEx and also through our operating margin in\nAWS. AWS is 35% operating margin through Q4, up 40 basis points year-over-\nyear.\n\n\nAs we talked about before, that is going to fluctuate over time. It\ncertainly has a headwind from the investments in AI and the depreciation on\nthat CapEx. But we also work very hard to offset that with efficiencies and\ncost reductions. So we will see how that develops over time. So -- but yes,\nwe see strong return on invested capital. We see strong demand for these\nservices, and we continue to like the investments in this area.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nI would add to that. If you look at the capital we're spending and intend\nto spend this year, it's predominantly in AWS. And some of it is for our\ncore workloads, which are non-AI workloads because they're growing at a\nfaster rate than we anticipated. But most of it is in AI. And we just have\na lot of growth and a lot of demand. And when you're growing 24% year-over-\nyear with an annualized revenue run rate of $142 billion, you're growing a\nlot. And what we're continuing to see is as fast as we install this\ncapacity, this AI capacity, we are monetizing it. And so it's just a very\nunusual opportunity.\n\n\nAs I've shared a lot of times, I passionately believe that every customer\nexperience that we know of today is going to be reinvented with AI, there\nare going to be a whole bunch of customer experiences that none of us ever\nimagined that are going to become the norms of how we all operate every day\nand what we use.\n\n\nAnd I think the other thing is that if you really want to use AI in an\nexpansive way, you need your data in the cloud and you need your\napplications in the cloud. Those are all big tailwinds pushing people\ntowards the cloud. So we're going to invest aggressively here, and we're\ngoing to invest to be the leader in this space as we have been for the last\nnumber of years. We have, I think, a fair bit of experience over the years\nin AWS of forecasting demand signals and doing it in such a way that we\ndon't have a lot of wasted capacity and that we also have enough capacity\nto serve the demand that's there.\n\n\nAnd I think we've also proven with AWS over the years in how we build data\ncenters and how we run them and how we invent in there, if you think about\nour chips and our hardware and our networking gear and how we've invented\nin power that this isn't some sort of quixotic top line grab, we have\nconfidence that we -- that these investments will yield strong returns on\ninvested capital. We've done that with our core AWS business. I think that\nwill very much be true here as well.\n\n\nAnd I think some of the things that you will see over time in the AI space\nis you're going to keep seeing all of the inference services, which is\ngoing to be the majority of the long-term AI workloads is going to be\ninference. You're going to see the inference keep getting optimized. You're\ngoing to see higher utilization on those services. You'll see prices\nnormalize over a period of time.\n\n\nAnd then I think the companies that have not just the excellence in\ninfrastructure, but also the components that give them -- give customers\nbetter price performance and give those companies themselves better\neconomics are going to have advantaged financials. And I think if you look,\nwe're already off to a really good start having Trainium underneath the\nmajority of our Bedrock service. And that's not just giving customers\nbetter prices, but it also gives us better economics. And so we see that\nfollowing the same sorts of patterns we saw in the early days of our core\nAWS investment. I'm very confident we're going to have strong return on\ninvested capital here.\n\n\nOperator\n\nAnd the next question comes from the line of Doug Anmuth with JPMorgan.\n\n\nDouglas Till Anmuth\nJPMorgan Chase & Co, Research Division\n\nCan you just talk about how Project Rainier is running with Anthropic after\nits first full quarter? And I think in the release, it talks about 500,000\nchips, but a few months ago, you talked about getting to 1 million as well.\nSo if you could clarify that.\n\n\nAnd then maybe just to follow up on Mark's question. Are there any\nfinancial guardrails or governors in place that we should think about\naround the spend just in terms of operating income growth or positive free\ncash flow?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. I'll start with the Trainium piece. We are very excited about the\ngrowth that we see in Trainium and the future that we have there. I think\nif you look at what's happened in the early innings of AI over the first\nfew years, you see a lot of usage, but customers are really thirsty for\nbetter price performance. And Trainium has 30% to 40% better price\nperformance than comparable GPU. So it's very compelling to customers. You\nmentioned Project Rainier, Anthropic is building their next -- they're\ntraining their next cloud model on top of Trainium2. And that's what\nProject Rainier is. So we talked about 500,000 chips there. You'll see that\ncontinuing to increase. They're also using a fair bit of Trainium2 for\nother workloads and their own APIs beyond just Project Rainier. But\nTrainium is a multibillion dollar annualized run rate business at this\npoint, and it's fully subscribed.\n\n\nAnd what you're also seeing is Trainium3, which is the next version of\nTrainium, which we just started shipping, that's 40% more price performance\nthan Trainium2. And we have -- there is a very substantial amount of\ninterest there. We expect that nearly all of that supply will be committed\nby somewhere around the middle of this year. And we're just in the process\nof building Trainium4. There's very substantial interest in Trainium4,\nwhich is coming in 2027. And we're already having conversations about\nTrainium5. So there is a lot of interest in Trainium at this point.\n\n\nAnd I think when you -- I think people know about our chips capability and\nour chips business, but I'm not sure folks realize how strong a chips\ncompany we've become over the last 10 years. If you look at what we've done\nwith Trainium, if you look at what we've done with Graviton, which is our\nCPU chip, which is about 40% better price performance than comparable x86\nprocessors, 90% of the top 1,000 AWS customers are using Graviton very\nexpansively. If you combine Trainium and Graviton, it's well over a $10\nbillion annualized run rate business, and it's still very early there.\n\n\nSo I'm very optimistic about what we're seeing. The Project Rainier has\ngone very well. I think Anthropic is quite pleased with it. We've learned a\nlot in the process as well, but it's early days with what's possible here.\nThis is a big business that's getting bigger and has a lot of potential.\n\n\nAnd then I just -- I'd briefly comment on your second question that we are\nas I mentioned, this is what -- I think this is an extraordinarily unusual\nopportunity to forever change the size of AWS and Amazon as a whole. I\nthink it also is an extraordinary opportunity for companies to change all\ntheir customer experiences and for start-ups to be able to build brand-new\nexperiences and businesses that would have taken much longer to try to\naccomplish before that they can do right now. And so we see this as an\nunusual opportunity, and we are going to invest aggressively here to be the\nleaders because like we've been in the last number of years and like I\nthink we will be moving forward.\n\n\nOperator\n\nThe next question comes from the line of Ross Sandler with Barclays.\n\n\nRoss Adam Sandler\nBarclays Bank PLC, Research Division\n\nGreat. Andy, you mentioned a few calls back how the AI market was currently\na bit top heavy with a lot of the spend kind of clustering around a few of\nthe AI native labs. So how is that changing as you look out into '26? And\nspecifically, how do you think you might extend your relationship with a\ncompany like OpenAI to maybe help Amazon's AI efforts, both on the retail\nside and the AWS side?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. The way I would describe what we see right now in the AI space is it's\nreally kind of a barbelled market demand where on one end, you have the AI\nlabs who are spending gobs and gobs of compute right now, along with what I\nwould consider a couple of runaway applications. And then at the other side\nof the barbell, you've got a lot of enterprises who are getting value out\nof AI in doing productivity and cost avoidance types of workloads. These\nare things like customer service or business process automation or some of\nthe fraud pieces. And then in that middle of the barbell are all the\nenterprise production workloads. And I would say that the enterprises are\nin various stages at this point of evaluating how to move those, working on\nmoving those and then putting them into production. But I think that middle\npart of the barbell very well may end up being the largest and the most\ndurable. And I would put in the middle of that barbell, too, by the way, I\nwould put just the altogether brand-new businesses and applications that\ncompanies build that right from the get-go run in production on top of AI.\n\n\nAnd so I think that to me, when I look at this and what's happening, it's\nkind of unbelievable if you look at the demand of what you're seeing\nalready with AI, but the lion's share of that demand is still yet to come\nin the middle of that barbell. And that will come over time. It will come\nas you have more and more companies with AI talent as more and more people\nget educated with the AI background. as inference continues to get less\nexpensive, and that's a big piece of what we're trying to do with Trainium\nand our hardware strategy. And as companies start to have success in moving\nthose workloads to -- further and further success in moving those workloads\nto run on top of AI. So I think there's -- it's just a huge opportunity.\nIt's still in the relative early stages, even though it's growing at a very\n-- like an unprecedented clip as we've talked about.\n\n\nAnd then I think how do we see our relationships extending with other\ncompanies like OpenAI, I would tell you that this movement in what's\nhappening in AI is -- it's very broad. It's going to be a lot of companies.\nIt is a lot of companies already. There's a number of AI labs, but almost\nevery company you talk to, almost every conversation we have on the AWS\nside, starts with AI. And so we have very significant relationships with a\nlot of different companies. I think we announced an agreement with OpenAI\nin November. We're excited about that agreement. It's a big one. We have a\nlot of respect for the company, and we hope to continue to extend our\npartnership over time. But this AI movement is not going to be a couple of\ncompanies. It's going to be thousands of companies over time.\n\n\nOperator\n\nThe next question comes from the line of Michael Morton with\nMoffettNathanson.\n\n\nMichael Paul Morton\nMoffettNathanson LLC\n\nThis one is on the retail business. Andy, you've talked about how you're\npassionate this is going to change experiences across the board. And you've\nshared some encouraging data points on Rufus. And we're seeing all of the\nother Internet platforms roll out Agentic protocols. I would love to see\nhow you think this plays out for the retail business and the on-site ads\nportion of the retail business is what seems like it could be a compression\nin the funnel as consumers get better answers over time. Anything there\nwould be great.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nI'm very optimistic about the customer experience that will ultimately be\nwhat customers use for Agentic shopping. And I think it's good for\ncustomers. I think it's going to make it easier for them. It's a big piece\nof why we've invested as significantly as we have in our own shopping\nassistant in Rufus. And if you haven't checked out Rufus recently, I really\nencourage you to do so. It's gotten much, much better and keeps getting\nbetter every month. And we have about -- we have 300 million customers who\nused Rufus in 2025. Customers who use Rufus are about 60% more likely to\ncomplete a purchase. And so you just -- you're seeing a lot of usage of it\nand a lot of growth, and I think it's very useful.\n\n\nAnd I think at the same time, we will have relationships with third-party\nhorizontal agents that can enable shopping as well. We have to collectively\nfigure out a better customer experience. It's still -- these horizontal\nagents don't have any of your shopping history. They get a lot of the\nproduct details wrong, they get a lot of the pricing wrong. And so we have\nto try to find a customer experience together that's better and a value\nexchange that makes sense for both parties. But I'm very hopeful that we'll\nget there over time. We continue to have a number of conversations.\n\n\nAnd then I think you're going to have to look at as time goes on, which\ntypes of -- which shopping agents are consumers going to use. And it kind\nof reminds me in some ways of the early days of kind of all the search\nengines that were referring traffic to retailers. And it's still a\nrelatively small portion of the overall traffic and sales. But of that\nfraction, you have to ask how many consumers are going to prefer using a\nhorizontal agent where it's kind of a middle person between the retailer\nand the consumer versus wanting to use a great agent from that retailer\nthat has all its shopping history and that has all the data right there and\nmakes it easy if you're just spearfishing for something to shop for it\nright there or if you want to do discovery, you can do it there, and it's\ngot the best data on shopping.\n\n\nI think a lot of customers are ultimately going to choose to use a great\nshopping agent from that retailer. Because if you think about what\nconsumers really want in retail in a retailer, they want really broad\nselection. They want low prices. They want really fast delivery. And then\nthey want a retailer that they can trust and that takes care of them. And I\nthink horizontal agents are pretty good at aggregating selection, but\nretailers are much better at doing all 4 of those items. And so I'm very\noptimistic that people will use our shopping agent. It's off to a great\nstart. I also expect that we'll work with other third-party agents over\ntime as we work on the issues I mentioned earlier.\n\n\nOperator\n\nThe next question comes from the line of Brian Nowak with Morgan Stanley.\n\n\nBrian Thomas Nowak\nMorgan Stanley, Research Division\n\nAndy, I want to ask you one about the global retail business this year. I\nknow there's a lot of areas of investment in it that you're talking about\nto sort of make -- improve the service, make it more durable over the long\nterm, et cetera. But I'm assuming there are also sources of efficiency you\nexpect to see this year. So can you sort of help us understand both sides\nof the ledger on retail this year? Where are some of the areas where you\nsee the potential for sources of efficiency and cost to serve savings? And\nthen where should we be thinking about the areas of investment to sort of\ndrive more durable growth, robotics, et cetera? How does that sort of break\ndown?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. So I would say on the side of continuing to invest to keep growing the\nretail business, the kind of core drivers of demand continue to be the\nsame. We're going to work really hard to expand selection. And you've seen\nwhat we've done over the last several years. The expansion of selection has\nbeen broad. And you'll see it on both ends of the spectrum. We have a lot\nmore of those luxury brands that have built presences in Amazon had success\nand found that we could manage their brand presentation in the right way,\nand they've been very happy. I mean you only have to look at L'Oreal as an\nexample, too, of just how fast that business is growing and how happy our\npartners have been. And at the same time, we are working really hard to\ncontinue to expand the amount of everyday essentials that we offer our\ncustomers.\n\n\nAnd the growth in Everyday Essentials in our business is really remarkable,\nas I mentioned in my opening comments. And one out of three units now that\nwe move our Everyday Essentials. And what we find there is that the more\nthe customers can rely on us for Everyday Essentials and the lower ASP\nitems, they just choose to do more of their downstream shopping with us in\nevery way. We're just more front of mind.\n\n\nAnd so I think a big piece of why we have captured more and more of those\neveryday essentials, and you see it also in our grocery business with\nperishables, too, is just our speed of delivery improvements over the last\nthree years has been really marked. I mean it's customers -- it's the one\nthing I get stopped on the street most often about, which is I just can't\nbelieve how quickly from when I order something, I get it to my door and\nhow reliable you are.\n\n\nI think along that speed of delivery piece, it's also quite interesting\nwhat's happening with quick commerce, and we have this offering called\nAmazon -- now that we've largely started outside the U.S. in India and the\nUAE and Mexico that gets thousands of items to customers within 30 minutes.\nAnd it really is -- it's quite interesting how quickly that is growing. And\nI think that it's just another one of those things like Everyday Essentials\nthat when you're able to order more and more from Amazon, you just think of\nAmazon first if it's a great experience that we're offering for whatever\nyou're looking for. But in our -- if you look in India, which is the place\nwe've rolled out quick commerce the fastest, customers who try quick\ncommerce are shopping with triple the frequency than they did before they\ntried us in quick commerce.\n\n\nSo, those are all areas, I think, are pretty excited that we're expanding.\nYou'll see us continue to expand what we're doing on the perishable side,\ntoo, which we're quite excited about. And we are able to deliver\nperishables same day in thousands of cities around the world now. And the\ncities in which we have those perishables available, 9 of the 10 top items\nthat are ordered in that geography are perishables. And so we're just\nhaving a lot of success with that, too. And people buy perishables from us\nafter they buy perishables, they're shopping with us twice as frequently.\nSo a lot of good things to like there.\n\n\nAnd then on the efficiencies, we are -- I mean, we always have a very long\nlist of these that we're working on, Brian. And it's true today as well.\nLike if you look -- even -- I mentioned -- I talked a lot about\nregionalization in our fulfillment network, particularly in the U.S. over\nthe last couple of years. And I said we weren't done honing that, and\nthat's true. It's just -- we don't talk about it every time. But if you\nlook at what we've done there, we've extended the number of regions. It was\n8. It's now 10. We've extended regionalization to what we do with our\ninbound delivery to be much more efficient in being able to get more items\ncloser to customers more quickly.\n\n\nWe have made a lot of -- we're doing a lot of work, and we've made a huge\namount of progress in being able to get more units into each box. And as\nwe're able to get more units into each box, it obviously saves shipments\nand we drive better operating income when we do that. And we've made very\nsignificant progress there, but have a lot more planned. It's part of -- by\nthe way, that improvement is part of what helps us do things like I was\ntalking about earlier and adding to a delivery in near real time.\n\n\nAnd then robotics, as you mentioned, is another big one for us. We have\nover 1 million robots today in our fulfillment network. They take care of\nall sorts of functions, but still a fraction of what I think we're going to\nbe able to enable over time, which will allow our -- we'll always have a\nlot of people that we employ in our fulfillment network, but they'll leave\nto the robotics things that are more repetitive. So it's better\nproductivity for the business, more safe for our teammates and there's real\ncost efficiencies in that as well. So a lot on both sides of the ledger as\nalways.\n\n\nOperator\n\nAnd our final question comes from the line of Eric Sheridan with Goldman\nSachs.\n\n\nEric James Sheridan\nGoldman Sachs Group, Inc., Research Division\n\nMaybe a few parts just on AWS. Can you speak to the current state of your\nrevenue backlog as of Q4 and also discuss a little bit about what you see\nboth for internal use cases and external client needs with respect to any\nimbalance between supply and demand around AI efforts and how you think\nabout closing the gap on those as more capacity comes online through 2026?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nThat's a lot of parts. I'll start with the first one, which is on backlog,\nour backlog is $244 billion. That's up 40% year-over-year. I think it's up\n22% quarter-over-quarter. We have -- and we have a lot of deals that are in\nthe pipeline. There's just -- as I mentioned earlier, there is a lot of\ndemand for AWS right now. in the AI space and also in the core AWS space.\n\n\nYour second question was internal and external use cases. and then the\nimpact around supply and demand. The vast majority of our -- the capital\nthat we spend and the capacity that we have is consumed by external\ncustomers. We have -- Amazon has always been a very large AWS customer, a\nvery helpful AWS customer because they're very demanding, and they use the\nservices very expansively and stretch the limits as we launch things. So\nthey've always been a very important big customer, but always a very small\nfraction of the total, and that's true today in AI as well as the overall\nAWS business.\n\n\nInternally, we have all sorts of ways that we are using AI. We have over\n1,000 AI applications that we've either deployed or in the process of\nbuilding, and they range from our shopping assistant in Rufus that we were\njust talking about to Alexa+, which is a really large-scale generative AI\napplication to applications in our fulfillment network that allow us to\nhave more accurate forecasting predictions to how we do customer service\nand our customer service chatbot to how we are making it much easier for\nbrands to create advertisements and to optimize all their campaigns across\nthe full funnel of advertising options we have to -- in live sports, if you\nwatch Thursday Night Football, you can see defensive alerts, which predict\nwhich player is going to blitz or pocket health. I mean we -- in every one\nof our businesses, you see a very broad use of AI to improve the customer\nexperience. And in many cases, just to completely reinvent what was\npossible before. I mean it's pretty neat to use something like Lens where\nyou may see something you want to buy, you can just take a picture of it in\nthe app and it finds the item on the detail page you can buy in one click.\nIt's kind of magic.\n\n\nAnd externally, I would say it's kind of what I said earlier. You have AI\nlabs consuming lots and lots of capacity. both for training as well as for\nthe inference and the research across what they're doing with their\ndifferent applications and models. We see enterprises all sorts of\nworkloads, customer service automation, business process automation, fraud,\ncompletely reinventing their applications, agentic coding applications,\nlegal applications. Suno is a really cool example of an AWS customer that's\nkind of reinvented how you can write music and build music. So really\nacross the board.\n\n\nAnd I just think on the supply and demand, what I would tell you is we're\ngrowing 24% year-over-year on a $142 billion annualized run rate business.\nSo we're growing at really an unprecedented rate yet, I think every\nprovider would tell you, including us that we could actually grow faster if\nwe had all the supply that we could take. And so we are being incredibly\nscrappy around that.\n\n\nIf you look in the last 12 months, we added 3.9 gigawatts of power. Just\nfor perspective, that's twice what we had in 2022 when we were an $80\nbillion annual run rate business. We expect to double it again by the end\nof '27. We added 1.2 gigawatts of power in Q4, just quarter-over-quarter.\nSo it's -- so we are -- our team is being aggressive and scrappy and\ninventive in adding capacity as fast as we can. We'll add a lot more in '26\nand '27 and '28 for that matter. And -- and we're very optimistic we can\ncontinue to grow in the ballpark of what we have.\n\n\nDave  Fildes\nVice President of Investor RelationsThanks for joining us on the call today\nand for your questions. A replay will be available on our Investor\nRelations website for at least three months. We appreciate your interest in\nAmazon, and we look forward to talking with you again next quarter.\nCopyright  2026 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2026 S&P Global Market Intelligence.\n\n",
  "presentation_text": "Operator\n\nThank you for standing by. Good day, everyone, and welcome to the\nAmazon.com Fourth Quarter 2025 Financial Results Teleconference. [Operator\nInstructions] Today's call is being recorded.\n\n\nAnd for opening remarks, I will be turning the call over to the Vice\nPresident of Investor Relations, Mr. Dave Fildes. Thank you, sir. Please go\nahead.\n\n\nDave  Fildes\nVice President of Investor Relations\n\nHello, and welcome to our Q4 2025 financial results conference call.\nJoining us today to answer your questions is Andy Jassy, our CEO; and Brian\nOlsavsky, our CFO.\n\n\nAs you listen to today's conference call, we encourage you to have our\npress release in front of you, which includes our financial results as well\nas metrics and commentary on the quarter. Please note, unless otherwise\nstated, all comparisons in this call will be against our results for the\ncomparable period of 2024. Our comments and responses to your questions\nreflect management's views as of today, February 5, 2026, only, and will\ninclude forward-looking statements. Actual results may differ materially.\nAdditional information about factors that could potentially impact our\nfinancial results is included in today's press release and our filings with\nthe SEC, including our most recent annual report on Form 10-K and\nsubsequent filings.\n\n\nDuring this call, we may discuss certain non-GAAP financial measures. In\nour press release, slides accompanying this webcast and our filings with\nthe SEC, each of which is posted on our IR website, you will find\nadditional disclosures regarding these non-GAAP measures, including\nreconciliations of these measures with comparable GAAP measures.\n\n\nOur guidance incorporates the order trends that we've seen to date and what\nwe believe today to be appropriate assumptions. Our results are inherently\nunpredictable and may be materially affected by many factors, including\nfluctuations in foreign exchange rates and energy prices, changes in global\neconomic and geopolitical conditions, tariff and trade policies, resource\nand supply volatility, including for memory chips and customer demand and\nspending, including the impact of recessionary fears, inflation, interest\nrates, regional labor market constraints, world events, the rate of growth\nof the Internet, online commerce, cloud services and new and emerging\ntechnologies and the various factors detailed in our filings with the SEC.\nOur guidance assumes, among other things, that we don't conclude any\nadditional business acquisitions, restructurings or legal settlements. It's\nnot possible to accurately predict demand for our goods and services, and\ntherefore, our actual results could differ materially from our guidance.\n\n\nAnd now I'll turn the call over to Andy.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nThanks, Dave. We're reporting $213.4 billion in revenue, up 12% year-over-\nyear, excluding the impact from foreign exchange rates. Operating income\nwas $25 billion and trailing 12-month free cash flow was $11.2 billion.\n\n\nWe're seeing strong growth and with the incremental opportunities available\nto us in areas like AI, chips, low earth orbit satellites, quick commerce\nand serving more consumers' everyday essentials needs, we have a chance to\nbuild an even more meaningful business in Amazon in the coming years with\nstrong return on invested capital, and we're investing to do so.\n\n\nWe're already seeing strong demand in these areas even in these early\ninnings. I'll start with AWS. AWS growth continued to accelerate to 24%,\nthe fastest we've seen in 13 quarters, up $2.6 billion quarter-over-quarter\nand nearly $7 billion year-over-year. AWS is now a $142 billion annualized\nrun rate business, and our chips business, inclusive of Graviton and\nTrainium is now over $10 billion in annual revenue run rate, growing triple-\ndigit percentages year-over-year. As a reminder, it's very different having\n24% year-over-year growth on a $142 billion annualized run rate than to\nhave a higher percentage growth on a meaningfully smaller base, which is\nthe case with our competitors. We continue to add more incremental revenue\nand capacity than others and extend our leadership position.\n\n\nWe're continuing to see strong growth in core non-AI workloads as\nenterprises return to focusing on moving infrastructure from on-premises to\nthe cloud, along with AWS having the broadest functionality, strongest\nsecurity and operational performance and most vibrant partner ecosystem.\nAWS continues to earn most of the big enterprise and government transitions\nto cloud.\n\n\nSince our last call, we announced new agreements with OpenAI, Visa, the\nNBA, BlackRock, Perplexity, Lyft, United Airlines, DoorDash, Salesforce,\nU.S. Air Force, Adobe, Thomson Reuters, AT&T, S&P Global, National Bank of\nCanada, the London Stock Exchange Group, Choice Hotels, Accenture, Indeed,\nHSBC, CrowdStrike, and more. More of the top 500 U.S. start-ups use AWS as\ntheir primary cloud provider than the next two providers combined.\n\n\nWe're adding significant EC2 core computing capacity each day, and the\nmajority of that new compute is using our custom CPU silicon, Graviton.\nGraviton is up to 40% more price performance than leading x86 processors\nand is used expansively by over 90% of AWS' top 1,000 customers. Graviton\nitself is a multibillion-dollar annualized run rate business, growing more\nthan 50% year-over-year. We consistently see customers wanting to run their\nAI workloads where the rest of their applications and data are.\n\n\nWe're also seeing that as customers run large AI workloads on AWS, they're\nadding to their core AWS footprint as well. But the biggest reason that AWS\ncontinues to gain AI share is our uniquely broad top to bottom AI stack\nfunctionality. In AI, we're doing what we've always done in AWS, solving\ncustomer challenges.\n\n\nLet me give you some examples. The first challenge is having a strong\nfoundation model to generate inferences or predictions. Customers are\nrealizing as they get further into AI that they need choice as different\nmodels are better on different dimensions. In fact, most sophisticated AI\napplications leverage multiple models, whether customers want frontier\nmodels like Anthropic's Claude or open models like Mistral or Llama,\nFrontier Intelligence with lower cost and latency like Amazon Nova or video\nand audio models like TwelveLabs or Nova Sonic. Amazon Bedrock makes it\neasy to use these models to run inference securely, scalably and\nperformantly. Bedrock is now a multibillion-dollar annualized run rate\nbusiness and customer spend grew 60% quarter-over-quarter.\n\n\nThe second challenge is how to hone the model for your application.\nCustomers sometimes think if they have a good model, they will have a good\nAI application. It's not really true. It takes a lot of work to post train\nand fine-tune a model for your application. Our SageMaker AI service, along\nwith fine-tuning tools in Bedrock make this much easier for customers.\n\n\nA third challenge is how to have a custom version of a foundation model\nthat best leverages the company's secret sauce, their own data. To date,\ncompanies have tried to shape models with their own data late in the\nprocess, usually with fine-tuning or post-training. There's a debate in the\nindustry about this, but we believe that enterprises will want models\ntrained on their own data at an early stage of pretraining if possible. So\ntheir models have the best possible foundation for what matters most to\neach enterprise on which to learn and evolve. It's a little like teaching a\nchild of foreign language early in their life. That becomes part of their\nlearning foundation moving forward, and it makes it easier to pick up other\nlanguages later in their life.\n\n\nTo solve for this need, we just launched Nova Forge, which give customers\nearly checkpoints on our Amazon Nova models, allows them to securely mix\ntheir own proprietary data with the models data in the pretraining stage\nand enables their own uniquely customized versions of Nova, what we call\nNovellas, trained with their data early in the process. This will be very\nuseful for companies as they build their own agents on top of the model.\nThere is nothing else out there like this today and a potential game\nchanger for companies.\n\n\nAnother challenge is cost. I've said this many times, but if we want AI to\nbe used as expansively as companies want, we have to make the cost of\ninference lower. A significant impediment today is the cost of AI chips.\nCustomers are starving for better price performance. And typically, and\nunderstandably, the dominant early leaders aren't in a hurry to make that\nhappen. They have other priorities. It's why we've built our own custom\nsilicon and Trainium, and it's really taken off. We've landed over 1.4\nmillion Trainium2  chips, our fastest ramping chip launch ever. Trainium2\nis 30% to 40% more price performance than comparable GPUs and is a\nmultibillion-dollar annualized revenue run rate business with 100,000-plus\ncompanies using it as Trainium is the majority underpinning of Bedrock\nusage today. We recently launched Trainium2, which is up to 40% more price\nperformance than Trainium2. We're seeing very strong demand for Trainium3\nand expect nearly all of our Trainium3 supply of chips to be committed by\nmid-2026. And though we're still building Trainium4, we're seeing very\nstrong interest already.\n\n\nLooking ahead, the primary way companies will get value from AI is with\nagents, some their own, some from others, and there are several customer\nchallenges that we're well positioned to solve. It's harder to build agents\nthan it should be. For that, we've built Strands, a service enabling agents\nto be created from any model. Once agents are built, enterprises are\napprehensive about deploying to production because these agents need to\nsecurely and scalably connect to compute, data, tools, memory, identity,\npolicy governance, performance monitoring and other elements. This is a new\nand hard problem where a solution has not existed until we launched Bedrock\nAgentCore. Customers are quite excited about AgentCore, and it's unlocking\ndeployments.\n\n\nCustomers also want to leverage others' useful agents, and we've built\nseveral, including Kiro for coding, Amazon Quick for knowledge workers to\nleverage their own data and analytics, AWS Transform for software migration\nand Amazon Connect for call center operations. We continue adding new\ncapabilities and usage continues to grow quickly. For example, the number\nof developers using Kiro grew more than 150% quarter-over-quarter.\n\n\nIn addition to agents that customers direct, customers are also becoming\nexcited about agents that require less human interaction. They can be fully\nautonomous, run persistently for hours or days, scale out quickly and\nremember context. At this past AWS re:Invent, we launched Frontier Agents\nto do that. Kiro autonomous agents for coding tasks, AWS DevOps agents for\ndetecting and resolving operational issues and AWS security agents for\nproactively securing applications throughout the development life cycle,\nand they're already making a big difference for customers.\n\n\nWe expect to invest about $200 billion in capital expenditures across\nAmazon, but predominantly in AWS because we have very high demand,\ncustomers really want AWS for core and AI workloads, and we're monetizing\ncapacity as fast as we can install it. We have deep experience\nunderstanding demand signals in the AWS business and then turning that\ncapacity into strong return on invested capital. We're confident this will\nbe the case here as well.\n\n\nI'll now turn to stores. We continue to expand selection, including more\nthan 400 new beauty brands in the U.S. in 2025, like Bobbi Brown Cosmetics,\nCharlotte Tilbury and Laura Mercier and new fashion brands like Away\nLuggage, Converse, Diesel, Michael Kors, Nike and The North Face. Our ultra-\nlow-priced offering, Amazon Haul, grew selection to over 1 million items\nunder $10 and expanded to serve customers in more than 25 countries and\nregions.\n\n\nWe continue to see strong customer response to Everyday Essentials and\ngrocery. In 2025, Everyday Essentials grew nearly twice as fast as all\nother categories in the U.S., representing one out of every three units\nsold in our store, and we've become a go-to grocery destination for over\n150 million Americans, mostly through online shopping and Whole Foods. With\nover $150 billion in gross sales, Amazon is clearly a large grocer at this\npoint. Customers in thousands of U.S. cities and towns can now get\nperishables delivered same day alongside millions of other items and\ncustomers who use that service shop more than twice as often as customers\nwho don't. We plan to expand to many more communities in 2026, and we also\nplan to open more than 100 new Whole Foods Market stores over the next few\nyears as we work to make grocery shopping easier, faster and more\naffordable for customers.\n\n\nWe remain committed to staying sharp on price and continue to meet or beat\nother retailers' prices. A recent study from Profitero showed that Amazon\nis America's lowest priced retailer for the ninth straight year, 14% lower\non average than other major online retailers. We again achieved our fastest\never delivery speeds for Prime members around the world in 2025. In the\nU.S., we delivered nearly 70% more items same day than the year before. We\nalso continue increasing speed for rural customers with nearly 2x more\naverage monthly customers in rural areas receiving same-day delivery year-\nover-year.\n\n\nSame-day is our fastest-growing delivery offering and nearly 100 million\ncustomers used it last year in the U.S. And the team is continuing to\ninnovate. We've launched Amazon now in India, Mexico and the UAE, ultrafast\ndelivery on thousands of items in about 30 minutes or less, and we're\ntesting it in several communities in the U.S. and U.K. It's early, but\ncustomers are loving it. For example, in India, customer response exceeded\nour most optimistic expectations, and we're seeing Prime members triple\ntheir shopping frequency once they start using it.\n\n\nExpanding our same-day delivery coverage also leads to meaningfully later\ncutoff times for orders, which is a big deal for customers. For example, on\nChristmas Eve, customers in about 4,000 U.S. cities could order items up\nuntil midday and get them that same day. Another example is our recently\nlaunched feature add to Delivery, which enables Prime members in the U.S.\nto add items to their upcoming Amazon deliveries with just one tap without\ngoing through checkout again or paying additional shipping fees.\n\n\nJust six months after launch, ad to delivery already makes up about 10% of\nall Prime volume fulfilled through the Amazon network each week. While this\nseems simple on the surface, this feature is supported by a lot of\ninvention where we need to figure out in real time and with incredibly low\nlatency, what items among Amazon's hundreds of millions of products are\navailable to add to a customer's upcoming deliveries, surface them, find a\nway to include in their packages and deliver within the same customer\npromise.\n\n\nThe stores team is also continuing to innovate and deliver for customers\nwith AI. Our Agentic AI shopping assistant, Rufus, has rapidly expanded.\nRufus can research products, track prices and auto buy, purchasing a\nproduct in our store when it reaches your set price. It can also now shop\ntens of millions of items in other online stores and make purchases for\ncustomers using our Agentic Buy for Me feature. Last year, more than 300\nmillion customers used Rufus. In addition, customers use Lens, our AI-\npowered visual search tool to find products with a phone's camera, a\nscreenshot or a barcode, and they did it 45% more year-over-year.\n\n\nMoving on to Amazon Ads. We're pleased with the continued strong growth\nacross our full funnel offerings, generating $21.3 billion of revenue in\nthe quarter and growing 22% year-over-year. Sponsored products advertising\nin our store continues to be our largest ads offering and the combination\nof trillions of shopping, browsing and streaming signals with advanced AI\nand machine learning led us to deliver highly relevant and useful ads for\ncustomers. We saw continued growth in Prime Video ads, which is now\navailable in 16 countries and is contributing meaningfully to our revenue\ngrowth. Prime Video has an average ad-supported audience of 315 million\nviewers globally, up from 200 million in early 2024.\n\n\nOur ads team is also innovating with AI. We recently announced our ads\nagent, which lets brands use AI to create and optimize campaigns at scale,\nimplement effective campaign targeting and quickly create actionable\ninsights. And our creative agent lets advertisers research, brainstorm and\ngenerate full funnel ad campaigns from concept to completion using\nconversational guidance in Amazon's retail data, transforming what was a\nweek-long process into just hours.\n\n\nWe're also continuing to invent and see momentum in several other areas,\nand I'll mention just a few. Starting with live sports on Prime. The fourth\nseason of Thursday Night Football broke more records. It was our most\nwatched season ever, averaging more than 15 million viewers, a 16% year-\nover-year increase and a third consecutive year of double-digit growth. And\nthe Packers versus Bears wild card game was the most streamed NFL game in\nhistory with 31.6 million viewers, clearing the prior mark by more than 4\nmillion.\n\n\nWe just made Alexa+ available to all customers in the U.S., free for Prime\nmembers and $19.99 a month for non-Prime members. Alexa+ continues to get\neven better and more capable, and we've added new ways to interact with\nAlexa, including a new chat experience at alexa.com, a redesigned mobile\napp and new integrations with third-party devices like Samsung TVs and BMW\ncars. We've also added new features like the ability to answer a ring\ndoorbell on a customer's behalf and more ways to shop or manage a home. And\nfinally, the team is making rapid progress on Amazon Leo, which will bring\nconnectivity to consumers, enterprises and governments in places where they\ndon't have broadband connectivity. Our enterprise-grade customer terminal,\nLeo Ultra, is the fastest satellite Internet antenna ever built, delivering\nsimultaneous download speeds of up to 1 gigabit per second and upload\nspeeds of up to 400 megabits per second. Leo will offer enterprise-grade\nperformance and advanced encryption with secure private networking that\nbypasses public Internet connecting directly to AWS. We've launched 180\nsatellites, have more than 20 launches planned in 2026, more than 30 in\n2027 and expect to launch commercially in 2026.\n\n\nWe have dozens of commercial agreements already signed, including with\nAT&T, DIRECTV Latin America, JetBlue and Australia's national broadband\nnetwork and have many more on the way. It's been an action-packed year of\ninnovation and progress, and we've hit the ground running in 2026.\n\n\nWith that, I'll turn it over to Brian for a financial update.\n\n\nBrian T. Olsavsky\nSenior VP & CFO\n\nThanks, Andy. Starting with our top line financial results. Worldwide\nrevenue was $213.4 billion, a 12% increase year-over-year, excluding the\n150 basis point favorable impact of foreign exchange. In Q4, we reported\nworldwide operating income of $25 billion.\n\n\nThis operating income includes three special charges, which reduced\noperating income by $2.4 billion. The first charge of $1.1 billion is for\nthe resolution of tax disputes associated with our stores business in Italy\nand the settlement of a lawsuit. This charge primarily impacts our\nInternational segment and is largely recorded in the fulfillment and other\noperating expense line items. Second charge of $730 million is for the\nestimated severance costs. This charge impacts all three of our segments\nand is recorded primarily in the fulfillment, sales and marketing and\ntechnology and infrastructure expense line items. The third charge of $610\nmillion is for asset impairments, primarily related to physical stores.\nThis charge primarily impacts the North America segment and is recorded in\nthe other operating expense line.\n\n\nMoving on to our segment results. In the North America segment, fourth\nquarter revenue was $127.1 billion, an increase of 10% year-over-year.\nInternational segment revenue was $50.7 billion, an increase of 11% year-\nover-year, excluding the impact of foreign exchange. Worldwide paid units\ngrew 12% year-over-year, which was our highest quarterly growth rate in\n2025.\n\n\nThe fourth quarter marked a strong finish to the year as we delivered to\ncustomers during the peak holiday season. Our sharp pricing, vast selection\nand record fast delivery speeds resonated with customers. They appreciate\nthe convenience of receiving their items quickly from gifts for family and\nfriends to everyday essentials and perishable groceries. Our millions of\nglobal third-party sellers continue to be an important contributor to our\nbroad selection. In Q4, Worldwide third-party seller unit mix was 61%.\n\n\nWe continue to invest in tools and services, including a comprehensive\nsuite of AI tools that help our selling partners manage and grow their\nbusinesses.\n\n\nShifting to profitability. North America segment operating income was $11.5\nbillion with an operating margin of 9%, up from an 8% margin in Q4 of 2024.\nInternational segment operating income was $1 billion with an operating\nmargin of 2.1%. Excluding the impact of special charges mentioned earlier,\nInternational segment operating margins also expanded year-over-year.\n\n\nWe're pleased with the fulfillment network performance throughout the peak\nseason. We made strong progress improving the cost structure of our network\nover the past few years. In the U.S., our regionalized network is operating\nat scale, and we continue to make refinements. This regionalization has\nimproved local inventory placement, leading to faster delivery at lower\ncosts.\n\n\nLast year, U.S. Prime members received over 8 billion items the same or\nnext day, up more than 30% year-over-year, with groceries and everyday\nessentials making up half of the total items. For the third year in a row,\nglobally, in 2025, we achieved both our fastest ever delivery speeds for\nPrime members while also reducing our cost to serve. By leveraging our\nexisting U.S. network, we can now deliver perishable groceries to customers\nin more than 2,300 cities and towns, all with same-day delivery. We saw\nsignificant adoption of this service throughout the year. When customers\nengage with our perishable offering, they demonstrate notably higher\nmonthly spend compared to those who do not shop the category. We also see\nthat customers shopping perishable groceries add 3x more items to their\nsame-day delivery orders. Looking ahead, we see further opportunity to\nenhance productivity in our global fulfillment network while delivering at\nfaster speeds for customers. We will continue optimizing inventory\nplacement to drive down distance travel, reduce touches per package and\nimprove package consolidation as well as launch robotics and automation to\nincrease efficiency and elevate the customer experience.\n\n\nShifting to advertising. Advertising revenue grew 22% in the fourth\nquarter, and we added over $12 billion of incremental revenue in 2025 alone\nas our full funnel advertising approach of connecting brands with customers\nis resonating simplifying the advertiser experience to enable brands to\nbetter reach customers wherever they are.\n\n\nMoving next to our AWS segment. Revenue was $35.6 billion and growth\naccelerated to 24% year-over-year. We added $2.6 billion in quarter-over-\nquarter revenue and AWS now has an annualized revenue run rate of $142\nbillion. This acceleration was driven by both core and AI services as\ncustomers continue to modernize their infrastructure and migrate workloads\nto the cloud.\n\n\nOur AI offerings continue to resonate with customers, including our agentic\ncapabilities. This growth was helped in part by the more than 1 gigawatt of\ncapacity we added in Q4. In 2025, AWS added more data center capacity than\nany other company in the world. AWS operating income was $12.5 billion.\nWe're seeing strong top line growth while remaining focused on driving\nefficiencies across the business. This includes investing in software and\nprocess improvements to optimize server capacity, developing a more\nefficient network using our lower-cost custom networking gear and advancing\ncustom silicon. At the same time, we continue to rapidly develop products\nand services on behalf of customers. As we've long said, we expect AWS\noperating margins to fluctuate over time, driven in part by the level of\ninvestments we're making at any point in time.\n\n\nTurning to cash flows. Our full year operating cash flow increased to\n$139.5 billion in 2025, up 20% year-over-year due primarily to improved\noperating income and changes in working capital.\n\n\nNow turning to our Q1 financial guidance. Q1 net sales are expected to be\nbetween $173.5 billion and $178.5 billion. This guidance anticipates a\nfavorable impact of approximately 180 basis points from foreign exchange\nrates. As a reminder, global currencies can fluctuate during the quarter.\nQ1 operating income is expected to be between $16.5 billion and $21.5\nbillion.\n\n\nA few things to mention on the operating income guidance. Within the North\nAmerica segment, we do expect a year-over-year cost increase of\napproximately $1 billion related to Amazon Leo. We have more than 20\nlaunches planned in 2026 and more than 30 in 2027, which means we're\nspending more on launching satellites each year. Select enterprise\ncustomers are testing Amazon Leo services now, and we expect a wider\ncommercial rollout later this year. As a reminder, today, we do expense\nmost of these Leo costs as incurred. We expect that later in the year, many\nof these costs such as satellite manufacturing and launch services will be\ncapitalized.\n\n\nWithin the International segment, we're continuing to invest more in our\nstores business to enhance the customer experience and to encourage retail\ndemand to move online more quickly. This includes bringing faster delivery\noptions, including Amazon Now, our service, which delivers to customers in\n30 minutes or less.\n\n\nWe're also working hard to stay sharp on pricing and seller fees. And there\nare countries where we've had to be more aggressive to meet or beat\ncompetitors' prices. We like these investments because they will delight\ncustomers, grow our business, and we believe they will generate long-term\npositive return on invested capital.\n\n\nAs we enter 2026, I'm energized by our team's strong execution. I want to\nthank everyone across the company for their hard work on behalf of our\ncustomers. We remain focused on driving an even better customer experience,\nwhich is the only reliable way to create lasting value for our\nshareholders.\nWith that, let's move on to your questions.",
  "qa_text": "Operator\n\n[Operator Instructions] Our first question comes from the line of Mark\nMahaney with Evercore ISI.\n\n\nMark Stephen F. Mahaney\nEvercore ISI Institutional Equities, Research Division\n\nI think, Brian, let me throw this to you or maybe to Andy. On the strong\nlong-term return on invested capital, I think that's the debate in the\nmarket today. So could you give us a little bit more insight into how you\nthink investors will be able to see that, either talk about the duration of\nthe CapEx cycle that you're going through now or what we should see in\nterms of profitability levels?\n\n\nAnd maybe also talk about like other de minimis or minimum free cash flow\ngeneration levels that you don't want to go below as you go through this\nCapEx cycle. Just help us get to that -- get to your level of confidence in\nhaving a strong long-term return on that invested capital.\n\n\nBrian T. Olsavsky\nSenior VP & CFO\n\nYes. Sure, Mark. Thank you. I'll start from the financial side. So on the\ninvestments we're making, as Andy said earlier, we are putting into service\nwith customers all capacity that we're getting and it's immediately useful.\nAnd we're also seeing a long arc of additional revenue that we see from\nother customers and backlog and commitments that people are anxious to make\nwith us, especially for AI services. So you can see that's working its way\ninto our P&L, both through CapEx and also through our operating margin in\nAWS. AWS is 35% operating margin through Q4, up 40 basis points year-over-\nyear.\n\n\nAs we talked about before, that is going to fluctuate over time. It\ncertainly has a headwind from the investments in AI and the depreciation on\nthat CapEx. But we also work very hard to offset that with efficiencies and\ncost reductions. So we will see how that develops over time. So -- but yes,\nwe see strong return on invested capital. We see strong demand for these\nservices, and we continue to like the investments in this area.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nI would add to that. If you look at the capital we're spending and intend\nto spend this year, it's predominantly in AWS. And some of it is for our\ncore workloads, which are non-AI workloads because they're growing at a\nfaster rate than we anticipated. But most of it is in AI. And we just have\na lot of growth and a lot of demand. And when you're growing 24% year-over-\nyear with an annualized revenue run rate of $142 billion, you're growing a\nlot. And what we're continuing to see is as fast as we install this\ncapacity, this AI capacity, we are monetizing it. And so it's just a very\nunusual opportunity.\n\n\nAs I've shared a lot of times, I passionately believe that every customer\nexperience that we know of today is going to be reinvented with AI, there\nare going to be a whole bunch of customer experiences that none of us ever\nimagined that are going to become the norms of how we all operate every day\nand what we use.\n\n\nAnd I think the other thing is that if you really want to use AI in an\nexpansive way, you need your data in the cloud and you need your\napplications in the cloud. Those are all big tailwinds pushing people\ntowards the cloud. So we're going to invest aggressively here, and we're\ngoing to invest to be the leader in this space as we have been for the last\nnumber of years. We have, I think, a fair bit of experience over the years\nin AWS of forecasting demand signals and doing it in such a way that we\ndon't have a lot of wasted capacity and that we also have enough capacity\nto serve the demand that's there.\n\n\nAnd I think we've also proven with AWS over the years in how we build data\ncenters and how we run them and how we invent in there, if you think about\nour chips and our hardware and our networking gear and how we've invented\nin power that this isn't some sort of quixotic top line grab, we have\nconfidence that we -- that these investments will yield strong returns on\ninvested capital. We've done that with our core AWS business. I think that\nwill very much be true here as well.\n\n\nAnd I think some of the things that you will see over time in the AI space\nis you're going to keep seeing all of the inference services, which is\ngoing to be the majority of the long-term AI workloads is going to be\ninference. You're going to see the inference keep getting optimized. You're\ngoing to see higher utilization on those services. You'll see prices\nnormalize over a period of time.\n\n\nAnd then I think the companies that have not just the excellence in\ninfrastructure, but also the components that give them -- give customers\nbetter price performance and give those companies themselves better\neconomics are going to have advantaged financials. And I think if you look,\nwe're already off to a really good start having Trainium underneath the\nmajority of our Bedrock service. And that's not just giving customers\nbetter prices, but it also gives us better economics. And so we see that\nfollowing the same sorts of patterns we saw in the early days of our core\nAWS investment. I'm very confident we're going to have strong return on\ninvested capital here.\n\n\nOperator\n\nAnd the next question comes from the line of Doug Anmuth with JPMorgan.\n\n\nDouglas Till Anmuth\nJPMorgan Chase & Co, Research Division\n\nCan you just talk about how Project Rainier is running with Anthropic after\nits first full quarter? And I think in the release, it talks about 500,000\nchips, but a few months ago, you talked about getting to 1 million as well.\nSo if you could clarify that.\n\n\nAnd then maybe just to follow up on Mark's question. Are there any\nfinancial guardrails or governors in place that we should think about\naround the spend just in terms of operating income growth or positive free\ncash flow?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. I'll start with the Trainium piece. We are very excited about the\ngrowth that we see in Trainium and the future that we have there. I think\nif you look at what's happened in the early innings of AI over the first\nfew years, you see a lot of usage, but customers are really thirsty for\nbetter price performance. And Trainium has 30% to 40% better price\nperformance than comparable GPU. So it's very compelling to customers. You\nmentioned Project Rainier, Anthropic is building their next -- they're\ntraining their next cloud model on top of Trainium2. And that's what\nProject Rainier is. So we talked about 500,000 chips there. You'll see that\ncontinuing to increase. They're also using a fair bit of Trainium2 for\nother workloads and their own APIs beyond just Project Rainier. But\nTrainium is a multibillion dollar annualized run rate business at this\npoint, and it's fully subscribed.\n\n\nAnd what you're also seeing is Trainium3, which is the next version of\nTrainium, which we just started shipping, that's 40% more price performance\nthan Trainium2. And we have -- there is a very substantial amount of\ninterest there. We expect that nearly all of that supply will be committed\nby somewhere around the middle of this year. And we're just in the process\nof building Trainium4. There's very substantial interest in Trainium4,\nwhich is coming in 2027. And we're already having conversations about\nTrainium5. So there is a lot of interest in Trainium at this point.\n\n\nAnd I think when you -- I think people know about our chips capability and\nour chips business, but I'm not sure folks realize how strong a chips\ncompany we've become over the last 10 years. If you look at what we've done\nwith Trainium, if you look at what we've done with Graviton, which is our\nCPU chip, which is about 40% better price performance than comparable x86\nprocessors, 90% of the top 1,000 AWS customers are using Graviton very\nexpansively. If you combine Trainium and Graviton, it's well over a $10\nbillion annualized run rate business, and it's still very early there.\n\n\nSo I'm very optimistic about what we're seeing. The Project Rainier has\ngone very well. I think Anthropic is quite pleased with it. We've learned a\nlot in the process as well, but it's early days with what's possible here.\nThis is a big business that's getting bigger and has a lot of potential.\n\n\nAnd then I just -- I'd briefly comment on your second question that we are\nas I mentioned, this is what -- I think this is an extraordinarily unusual\nopportunity to forever change the size of AWS and Amazon as a whole. I\nthink it also is an extraordinary opportunity for companies to change all\ntheir customer experiences and for start-ups to be able to build brand-new\nexperiences and businesses that would have taken much longer to try to\naccomplish before that they can do right now. And so we see this as an\nunusual opportunity, and we are going to invest aggressively here to be the\nleaders because like we've been in the last number of years and like I\nthink we will be moving forward.\n\n\nOperator\n\nThe next question comes from the line of Ross Sandler with Barclays.\n\n\nRoss Adam Sandler\nBarclays Bank PLC, Research Division\n\nGreat. Andy, you mentioned a few calls back how the AI market was currently\na bit top heavy with a lot of the spend kind of clustering around a few of\nthe AI native labs. So how is that changing as you look out into '26? And\nspecifically, how do you think you might extend your relationship with a\ncompany like OpenAI to maybe help Amazon's AI efforts, both on the retail\nside and the AWS side?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. The way I would describe what we see right now in the AI space is it's\nreally kind of a barbelled market demand where on one end, you have the AI\nlabs who are spending gobs and gobs of compute right now, along with what I\nwould consider a couple of runaway applications. And then at the other side\nof the barbell, you've got a lot of enterprises who are getting value out\nof AI in doing productivity and cost avoidance types of workloads. These\nare things like customer service or business process automation or some of\nthe fraud pieces. And then in that middle of the barbell are all the\nenterprise production workloads. And I would say that the enterprises are\nin various stages at this point of evaluating how to move those, working on\nmoving those and then putting them into production. But I think that middle\npart of the barbell very well may end up being the largest and the most\ndurable. And I would put in the middle of that barbell, too, by the way, I\nwould put just the altogether brand-new businesses and applications that\ncompanies build that right from the get-go run in production on top of AI.\n\n\nAnd so I think that to me, when I look at this and what's happening, it's\nkind of unbelievable if you look at the demand of what you're seeing\nalready with AI, but the lion's share of that demand is still yet to come\nin the middle of that barbell. And that will come over time. It will come\nas you have more and more companies with AI talent as more and more people\nget educated with the AI background. as inference continues to get less\nexpensive, and that's a big piece of what we're trying to do with Trainium\nand our hardware strategy. And as companies start to have success in moving\nthose workloads to -- further and further success in moving those workloads\nto run on top of AI. So I think there's -- it's just a huge opportunity.\nIt's still in the relative early stages, even though it's growing at a very\n-- like an unprecedented clip as we've talked about.\n\n\nAnd then I think how do we see our relationships extending with other\ncompanies like OpenAI, I would tell you that this movement in what's\nhappening in AI is -- it's very broad. It's going to be a lot of companies.\nIt is a lot of companies already. There's a number of AI labs, but almost\nevery company you talk to, almost every conversation we have on the AWS\nside, starts with AI. And so we have very significant relationships with a\nlot of different companies. I think we announced an agreement with OpenAI\nin November. We're excited about that agreement. It's a big one. We have a\nlot of respect for the company, and we hope to continue to extend our\npartnership over time. But this AI movement is not going to be a couple of\ncompanies. It's going to be thousands of companies over time.\n\n\nOperator\n\nThe next question comes from the line of Michael Morton with\nMoffettNathanson.\n\n\nMichael Paul Morton\nMoffettNathanson LLC\n\nThis one is on the retail business. Andy, you've talked about how you're\npassionate this is going to change experiences across the board. And you've\nshared some encouraging data points on Rufus. And we're seeing all of the\nother Internet platforms roll out Agentic protocols. I would love to see\nhow you think this plays out for the retail business and the on-site ads\nportion of the retail business is what seems like it could be a compression\nin the funnel as consumers get better answers over time. Anything there\nwould be great.\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nI'm very optimistic about the customer experience that will ultimately be\nwhat customers use for Agentic shopping. And I think it's good for\ncustomers. I think it's going to make it easier for them. It's a big piece\nof why we've invested as significantly as we have in our own shopping\nassistant in Rufus. And if you haven't checked out Rufus recently, I really\nencourage you to do so. It's gotten much, much better and keeps getting\nbetter every month. And we have about -- we have 300 million customers who\nused Rufus in 2025. Customers who use Rufus are about 60% more likely to\ncomplete a purchase. And so you just -- you're seeing a lot of usage of it\nand a lot of growth, and I think it's very useful.\n\n\nAnd I think at the same time, we will have relationships with third-party\nhorizontal agents that can enable shopping as well. We have to collectively\nfigure out a better customer experience. It's still -- these horizontal\nagents don't have any of your shopping history. They get a lot of the\nproduct details wrong, they get a lot of the pricing wrong. And so we have\nto try to find a customer experience together that's better and a value\nexchange that makes sense for both parties. But I'm very hopeful that we'll\nget there over time. We continue to have a number of conversations.\n\n\nAnd then I think you're going to have to look at as time goes on, which\ntypes of -- which shopping agents are consumers going to use. And it kind\nof reminds me in some ways of the early days of kind of all the search\nengines that were referring traffic to retailers. And it's still a\nrelatively small portion of the overall traffic and sales. But of that\nfraction, you have to ask how many consumers are going to prefer using a\nhorizontal agent where it's kind of a middle person between the retailer\nand the consumer versus wanting to use a great agent from that retailer\nthat has all its shopping history and that has all the data right there and\nmakes it easy if you're just spearfishing for something to shop for it\nright there or if you want to do discovery, you can do it there, and it's\ngot the best data on shopping.\n\n\nI think a lot of customers are ultimately going to choose to use a great\nshopping agent from that retailer. Because if you think about what\nconsumers really want in retail in a retailer, they want really broad\nselection. They want low prices. They want really fast delivery. And then\nthey want a retailer that they can trust and that takes care of them. And I\nthink horizontal agents are pretty good at aggregating selection, but\nretailers are much better at doing all 4 of those items. And so I'm very\noptimistic that people will use our shopping agent. It's off to a great\nstart. I also expect that we'll work with other third-party agents over\ntime as we work on the issues I mentioned earlier.\n\n\nOperator\n\nThe next question comes from the line of Brian Nowak with Morgan Stanley.\n\n\nBrian Thomas Nowak\nMorgan Stanley, Research Division\n\nAndy, I want to ask you one about the global retail business this year. I\nknow there's a lot of areas of investment in it that you're talking about\nto sort of make -- improve the service, make it more durable over the long\nterm, et cetera. But I'm assuming there are also sources of efficiency you\nexpect to see this year. So can you sort of help us understand both sides\nof the ledger on retail this year? Where are some of the areas where you\nsee the potential for sources of efficiency and cost to serve savings? And\nthen where should we be thinking about the areas of investment to sort of\ndrive more durable growth, robotics, et cetera? How does that sort of break\ndown?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nYes. So I would say on the side of continuing to invest to keep growing the\nretail business, the kind of core drivers of demand continue to be the\nsame. We're going to work really hard to expand selection. And you've seen\nwhat we've done over the last several years. The expansion of selection has\nbeen broad. And you'll see it on both ends of the spectrum. We have a lot\nmore of those luxury brands that have built presences in Amazon had success\nand found that we could manage their brand presentation in the right way,\nand they've been very happy. I mean you only have to look at L'Oreal as an\nexample, too, of just how fast that business is growing and how happy our\npartners have been. And at the same time, we are working really hard to\ncontinue to expand the amount of everyday essentials that we offer our\ncustomers.\n\n\nAnd the growth in Everyday Essentials in our business is really remarkable,\nas I mentioned in my opening comments. And one out of three units now that\nwe move our Everyday Essentials. And what we find there is that the more\nthe customers can rely on us for Everyday Essentials and the lower ASP\nitems, they just choose to do more of their downstream shopping with us in\nevery way. We're just more front of mind.\n\n\nAnd so I think a big piece of why we have captured more and more of those\neveryday essentials, and you see it also in our grocery business with\nperishables, too, is just our speed of delivery improvements over the last\nthree years has been really marked. I mean it's customers -- it's the one\nthing I get stopped on the street most often about, which is I just can't\nbelieve how quickly from when I order something, I get it to my door and\nhow reliable you are.\n\n\nI think along that speed of delivery piece, it's also quite interesting\nwhat's happening with quick commerce, and we have this offering called\nAmazon -- now that we've largely started outside the U.S. in India and the\nUAE and Mexico that gets thousands of items to customers within 30 minutes.\nAnd it really is -- it's quite interesting how quickly that is growing. And\nI think that it's just another one of those things like Everyday Essentials\nthat when you're able to order more and more from Amazon, you just think of\nAmazon first if it's a great experience that we're offering for whatever\nyou're looking for. But in our -- if you look in India, which is the place\nwe've rolled out quick commerce the fastest, customers who try quick\ncommerce are shopping with triple the frequency than they did before they\ntried us in quick commerce.\n\n\nSo, those are all areas, I think, are pretty excited that we're expanding.\nYou'll see us continue to expand what we're doing on the perishable side,\ntoo, which we're quite excited about. And we are able to deliver\nperishables same day in thousands of cities around the world now. And the\ncities in which we have those perishables available, 9 of the 10 top items\nthat are ordered in that geography are perishables. And so we're just\nhaving a lot of success with that, too. And people buy perishables from us\nafter they buy perishables, they're shopping with us twice as frequently.\nSo a lot of good things to like there.\n\n\nAnd then on the efficiencies, we are -- I mean, we always have a very long\nlist of these that we're working on, Brian. And it's true today as well.\nLike if you look -- even -- I mentioned -- I talked a lot about\nregionalization in our fulfillment network, particularly in the U.S. over\nthe last couple of years. And I said we weren't done honing that, and\nthat's true. It's just -- we don't talk about it every time. But if you\nlook at what we've done there, we've extended the number of regions. It was\n8. It's now 10. We've extended regionalization to what we do with our\ninbound delivery to be much more efficient in being able to get more items\ncloser to customers more quickly.\n\n\nWe have made a lot of -- we're doing a lot of work, and we've made a huge\namount of progress in being able to get more units into each box. And as\nwe're able to get more units into each box, it obviously saves shipments\nand we drive better operating income when we do that. And we've made very\nsignificant progress there, but have a lot more planned. It's part of -- by\nthe way, that improvement is part of what helps us do things like I was\ntalking about earlier and adding to a delivery in near real time.\n\n\nAnd then robotics, as you mentioned, is another big one for us. We have\nover 1 million robots today in our fulfillment network. They take care of\nall sorts of functions, but still a fraction of what I think we're going to\nbe able to enable over time, which will allow our -- we'll always have a\nlot of people that we employ in our fulfillment network, but they'll leave\nto the robotics things that are more repetitive. So it's better\nproductivity for the business, more safe for our teammates and there's real\ncost efficiencies in that as well. So a lot on both sides of the ledger as\nalways.\n\n\nOperator\n\nAnd our final question comes from the line of Eric Sheridan with Goldman\nSachs.\n\n\nEric James Sheridan\nGoldman Sachs Group, Inc., Research Division\n\nMaybe a few parts just on AWS. Can you speak to the current state of your\nrevenue backlog as of Q4 and also discuss a little bit about what you see\nboth for internal use cases and external client needs with respect to any\nimbalance between supply and demand around AI efforts and how you think\nabout closing the gap on those as more capacity comes online through 2026?\n\n\nAndrew R. Jassy\nPresident, CEO & Director\n\nThat's a lot of parts. I'll start with the first one, which is on backlog,\nour backlog is $244 billion. That's up 40% year-over-year. I think it's up\n22% quarter-over-quarter. We have -- and we have a lot of deals that are in\nthe pipeline. There's just -- as I mentioned earlier, there is a lot of\ndemand for AWS right now. in the AI space and also in the core AWS space.\n\n\nYour second question was internal and external use cases. and then the\nimpact around supply and demand. The vast majority of our -- the capital\nthat we spend and the capacity that we have is consumed by external\ncustomers. We have -- Amazon has always been a very large AWS customer, a\nvery helpful AWS customer because they're very demanding, and they use the\nservices very expansively and stretch the limits as we launch things. So\nthey've always been a very important big customer, but always a very small\nfraction of the total, and that's true today in AI as well as the overall\nAWS business.\n\n\nInternally, we have all sorts of ways that we are using AI. We have over\n1,000 AI applications that we've either deployed or in the process of\nbuilding, and they range from our shopping assistant in Rufus that we were\njust talking about to Alexa+, which is a really large-scale generative AI\napplication to applications in our fulfillment network that allow us to\nhave more accurate forecasting predictions to how we do customer service\nand our customer service chatbot to how we are making it much easier for\nbrands to create advertisements and to optimize all their campaigns across\nthe full funnel of advertising options we have to -- in live sports, if you\nwatch Thursday Night Football, you can see defensive alerts, which predict\nwhich player is going to blitz or pocket health. I mean we -- in every one\nof our businesses, you see a very broad use of AI to improve the customer\nexperience. And in many cases, just to completely reinvent what was\npossible before. I mean it's pretty neat to use something like Lens where\nyou may see something you want to buy, you can just take a picture of it in\nthe app and it finds the item on the detail page you can buy in one click.\nIt's kind of magic.\n\n\nAnd externally, I would say it's kind of what I said earlier. You have AI\nlabs consuming lots and lots of capacity. both for training as well as for\nthe inference and the research across what they're doing with their\ndifferent applications and models. We see enterprises all sorts of\nworkloads, customer service automation, business process automation, fraud,\ncompletely reinventing their applications, agentic coding applications,\nlegal applications. Suno is a really cool example of an AWS customer that's\nkind of reinvented how you can write music and build music. So really\nacross the board.\n\n\nAnd I just think on the supply and demand, what I would tell you is we're\ngrowing 24% year-over-year on a $142 billion annualized run rate business.\nSo we're growing at really an unprecedented rate yet, I think every\nprovider would tell you, including us that we could actually grow faster if\nwe had all the supply that we could take. And so we are being incredibly\nscrappy around that.\n\n\nIf you look in the last 12 months, we added 3.9 gigawatts of power. Just\nfor perspective, that's twice what we had in 2022 when we were an $80\nbillion annual run rate business. We expect to double it again by the end\nof '27. We added 1.2 gigawatts of power in Q4, just quarter-over-quarter.\nSo it's -- so we are -- our team is being aggressive and scrappy and\ninventive in adding capacity as fast as we can. We'll add a lot more in '26\nand '27 and '28 for that matter. And -- and we're very optimistic we can\ncontinue to grow in the ballpark of what we have.\n\n\nDave  Fildes\nVice President of Investor RelationsThanks for joining us on the call today\nand for your questions. A replay will be available on our Investor\nRelations website for at least three months. We appreciate your interest in\nAmazon, and we look forward to talking with you again next quarter.\nCopyright  2026 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2026 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Amazon.com, Inc. NasdaqGS:AMZN FQ4 2025 Earnings Call Transcripts Thursday, February 5, 2026 10:00 PM GMT S&P Global Market Intelligence Estimates Presentation"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Thank you for standing by. Good day, everyone, and welcome to the Amazon.com Fourth Quarter 2025 Financial Results Teleconference. [Operator Instructions] Today's call is being recorded. And for opening remarks, I will be turning the call over to the Vice President of Investor Relations, Mr. Dave Fildes. Thank you, sir. Please go ahead."
    },
    {
      "speaker": "Dave  Fildes",
      "role": "Vice President of Investor Relations",
      "text": "Vice President of Investor Relations Hello, and welcome to our Q4 2025 financial results conference call. Joining us today to answer your questions is Andy Jassy, our CEO; and Brian Olsavsky, our CFO. As you listen to today's conference call, we encourage you to have our press release in front of you, which includes our financial results as well as metrics and commentary on the quarter. Please note, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2024. Our comments and responses to your questions reflect management's views as of today, February 5, 2026, only, and will include forward-looking statements. Actual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings. During this call, we may discuss certain non-GAAP financial measures. In our press release, slides accompanying this webcast and our filings with the SEC, each of which is posted on our IR website, you will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Our guidance incorporates the order trends that we've seen to date and what we believe today to be appropriate assumptions. Our results are inherently unpredictable and may be materially affected by many factors, including fluctuations in foreign exchange rates and energy prices, changes in global economic and geopolitical conditions, tariff and trade policies, resource and supply volatility, including for memory chips and customer demand and spending, including the impact of recessionary fears, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the Internet, online commerce, cloud services and new and emerging technologies and the various factors detailed in our filings with the SEC. Our guidance assumes, among other things, that we don't conclude any additional business acquisitions, restructurings or legal settlements. It's not possible to accurately predict demand for our goods and services, and therefore, our actual results could differ materially from our guidance. And now I'll turn the call over to Andy."
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director Thanks, Dave. We're reporting $213.4 billion in revenue, up 12% year-over- year, excluding the impact from foreign exchange rates. Operating income was $25 billion and trailing 12-month free cash flow was $11.2 billion. We're seeing strong growth and with the incremental opportunities available to us in areas like AI, chips, low earth orbit satellites, quick commerce and serving more consumers' everyday essentials needs, we have a chance to build an even more meaningful business in Amazon in the coming years with strong return on invested capital, and we're investing to do so. We're already seeing strong demand in these areas even in these early innings. I'll start with AWS. AWS growth continued to accelerate to 24%, the fastest we've seen in 13 quarters, up $2.6 billion quarter-over-quarter and nearly $7 billion year-over-year. AWS is now a $142 billion annualized run rate business, and our chips business, inclusive of Graviton and Trainium is now over $10 billion in annual revenue run rate, growing triple- digit percentages year-over-year. As a reminder, it's very different having 24% year-over-year growth on a $142 billion annualized run rate than to have a higher percentage growth on a meaningfully smaller base, which is the case with our competitors. We continue to add more incremental revenue and capacity than others and extend our leadership position. We're continuing to see strong growth in core non-AI workloads as enterprises return to focusing on moving infrastructure from on-premises to the cloud, along with AWS having the broadest functionality, strongest security and operational performance and most vibrant partner ecosystem. AWS continues to earn most of the big enterprise and government transitions to cloud. Since our last call, we announced new agreements with OpenAI, Visa, the NBA, BlackRock, Perplexity, Lyft, United Airlines, DoorDash, Salesforce, U.S. Air Force, Adobe, Thomson Reuters, AT&T, S&P Global, National Bank of Canada, the London Stock Exchange Group, Choice Hotels, Accenture, Indeed, HSBC, CrowdStrike, and more. More of the top 500 U.S. start-ups use AWS as their primary cloud provider than the next two providers combined. We're adding significant EC2 core computing capacity each day, and the majority of that new compute is using our custom CPU silicon, Graviton. Graviton is up to 40% more price performance than leading x86 processors and is used expansively by over 90% of AWS' top 1,000 customers. Graviton itself is a multibillion-dollar annualized run rate business, growing more than 50% year-over-year. We consistently see customers wanting to run their AI workloads where the rest of their applications and data are. We're also seeing that as customers run large AI workloads on AWS, they're adding to their core AWS footprint as well. But the biggest reason that AWS continues to gain AI share is our uniquely broad top to bottom AI stack functionality. In AI, we're doing what we've always done in AWS, solving customer challenges. Let me give you some examples. The first challenge is having a strong foundation model to generate inferences or predictions. Customers are realizing as they get further into AI that they need choice as different models are better on different dimensions. In fact, most sophisticated AI applications leverage multiple models, whether customers want frontier models like Anthropic's Claude or open models like Mistral or Llama, Frontier Intelligence with lower cost and latency like Amazon Nova or video and audio models like TwelveLabs or Nova Sonic. Amazon Bedrock makes it easy to use these models to run inference securely, scalably and performantly. Bedrock is now a multibillion-dollar annualized run rate business and customer spend grew 60% quarter-over-quarter. The second challenge is how to hone the model for your application. Customers sometimes think if they have a good model, they will have a good AI application. It's not really true. It takes a lot of work to post train and fine-tune a model for your application. Our SageMaker AI service, along with fine-tuning tools in Bedrock make this much easier for customers. A third challenge is how to have a custom version of a foundation model that best leverages the company's secret sauce, their own data. To date, companies have tried to shape models with their own data late in the process, usually with fine-tuning or post-training. There's a debate in the industry about this, but we believe that enterprises will want models trained on their own data at an early stage of pretraining if possible. So their models have the best possible foundation for what matters most to each enterprise on which to learn and evolve. It's a little like teaching a child of foreign language early in their life. That becomes part of their learning foundation moving forward, and it makes it easier to pick up other languages later in their life. To solve for this need, we just launched Nova Forge, which give customers early checkpoints on our Amazon Nova models, allows them to securely mix their own proprietary data with the models data in the pretraining stage and enables their own uniquely customized versions of Nova, what we call Novellas, trained with their data early in the process. This will be very useful for companies as they build their own agents on top of the model. There is nothing else out there like this today and a potential game changer for companies. Another challenge is cost. I've said this many times, but if we want AI to be used as expansively as companies want, we have to make the cost of inference lower. A significant impediment today is the cost of AI chips. Customers are starving for better price performance. And typically, and understandably, the dominant early leaders aren't in a hurry to make that happen. They have other priorities. It's why we've built our own custom silicon and Trainium, and it's really taken off. We've landed over 1.4 million Trainium2  chips, our fastest ramping chip launch ever. Trainium2 is 30% to 40% more price performance than comparable GPUs and is a multibillion-dollar annualized revenue run rate business with 100,000-plus companies using it as Trainium is the majority underpinning of Bedrock usage today. We recently launched Trainium2, which is up to 40% more price performance than Trainium2. We're seeing very strong demand for Trainium3 and expect nearly all of our Trainium3 supply of chips to be committed by mid-2026. And though we're still building Trainium4, we're seeing very strong interest already. Looking ahead, the primary way companies will get value from AI is with agents, some their own, some from others, and there are several customer challenges that we're well positioned to solve. It's harder to build agents than it should be. For that, we've built Strands, a service enabling agents to be created from any model. Once agents are built, enterprises are apprehensive about deploying to production because these agents need to securely and scalably connect to compute, data, tools, memory, identity, policy governance, performance monitoring and other elements. This is a new and hard problem where a solution has not existed until we launched Bedrock AgentCore. Customers are quite excited about AgentCore, and it's unlocking deployments. Customers also want to leverage others' useful agents, and we've built several, including Kiro for coding, Amazon Quick for knowledge workers to leverage their own data and analytics, AWS Transform for software migration and Amazon Connect for call center operations. We continue adding new capabilities and usage continues to grow quickly. For example, the number of developers using Kiro grew more than 150% quarter-over-quarter. In addition to agents that customers direct, customers are also becoming excited about agents that require less human interaction. They can be fully autonomous, run persistently for hours or days, scale out quickly and remember context. At this past AWS re:Invent, we launched Frontier Agents to do that. Kiro autonomous agents for coding tasks, AWS DevOps agents for detecting and resolving operational issues and AWS security agents for proactively securing applications throughout the development life cycle, and they're already making a big difference for customers. We expect to invest about $200 billion in capital expenditures across Amazon, but predominantly in AWS because we have very high demand, customers really want AWS for core and AI workloads, and we're monetizing capacity as fast as we can install it. We have deep experience understanding demand signals in the AWS business and then turning that capacity into strong return on invested capital. We're confident this will be the case here as well. I'll now turn to stores. We continue to expand selection, including more than 400 new beauty brands in the U.S. in 2025, like Bobbi Brown Cosmetics, Charlotte Tilbury and Laura Mercier and new fashion brands like Away Luggage, Converse, Diesel, Michael Kors, Nike and The North Face. Our ultra- low-priced offering, Amazon Haul, grew selection to over 1 million items under $10 and expanded to serve customers in more than 25 countries and regions. We continue to see strong customer response to Everyday Essentials and grocery. In 2025, Everyday Essentials grew nearly twice as fast as all other categories in the U.S., representing one out of every three units sold in our store, and we've become a go-to grocery destination for over 150 million Americans, mostly through online shopping and Whole Foods. With over $150 billion in gross sales, Amazon is clearly a large grocer at this point. Customers in thousands of U.S. cities and towns can now get perishables delivered same day alongside millions of other items and customers who use that service shop more than twice as often as customers who don't. We plan to expand to many more communities in 2026, and we also plan to open more than 100 new Whole Foods Market stores over the next few years as we work to make grocery shopping easier, faster and more affordable for customers. We remain committed to staying sharp on price and continue to meet or beat other retailers' prices. A recent study from Profitero showed that Amazon is America's lowest priced retailer for the ninth straight year, 14% lower on average than other major online retailers. We again achieved our fastest ever delivery speeds for Prime members around the world in 2025. In the U.S., we delivered nearly 70% more items same day than the year before. We also continue increasing speed for rural customers with nearly 2x more average monthly customers in rural areas receiving same-day delivery year- over-year. Same-day is our fastest-growing delivery offering and nearly 100 million customers used it last year in the U.S. And the team is continuing to innovate. We've launched Amazon now in India, Mexico and the UAE, ultrafast delivery on thousands of items in about 30 minutes or less, and we're testing it in several communities in the U.S. and U.K. It's early, but customers are loving it. For example, in India, customer response exceeded our most optimistic expectations, and we're seeing Prime members triple their shopping frequency once they start using it. Expanding our same-day delivery coverage also leads to meaningfully later cutoff times for orders, which is a big deal for customers. For example, on Christmas Eve, customers in about 4,000 U.S. cities could order items up until midday and get them that same day. Another example is our recently launched feature add to Delivery, which enables Prime members in the U.S. to add items to their upcoming Amazon deliveries with just one tap without going through checkout again or paying additional shipping fees. Just six months after launch, ad to delivery already makes up about 10% of all Prime volume fulfilled through the Amazon network each week. While this seems simple on the surface, this feature is supported by a lot of invention where we need to figure out in real time and with incredibly low latency, what items among Amazon's hundreds of millions of products are available to add to a customer's upcoming deliveries, surface them, find a way to include in their packages and deliver within the same customer promise. The stores team is also continuing to innovate and deliver for customers with AI. Our Agentic AI shopping assistant, Rufus, has rapidly expanded. Rufus can research products, track prices and auto buy, purchasing a product in our store when it reaches your set price. It can also now shop tens of millions of items in other online stores and make purchases for customers using our Agentic Buy for Me feature. Last year, more than 300 million customers used Rufus. In addition, customers use Lens, our AI- powered visual search tool to find products with a phone's camera, a screenshot or a barcode, and they did it 45% more year-over-year. Moving on to Amazon Ads. We're pleased with the continued strong growth across our full funnel offerings, generating $21.3 billion of revenue in the quarter and growing 22% year-over-year. Sponsored products advertising in our store continues to be our largest ads offering and the combination of trillions of shopping, browsing and streaming signals with advanced AI and machine learning led us to deliver highly relevant and useful ads for customers. We saw continued growth in Prime Video ads, which is now available in 16 countries and is contributing meaningfully to our revenue growth. Prime Video has an average ad-supported audience of 315 million viewers globally, up from 200 million in early 2024. Our ads team is also innovating with AI. We recently announced our ads agent, which lets brands use AI to create and optimize campaigns at scale, implement effective campaign targeting and quickly create actionable insights. And our creative agent lets advertisers research, brainstorm and generate full funnel ad campaigns from concept to completion using conversational guidance in Amazon's retail data, transforming what was a week-long process into just hours. We're also continuing to invent and see momentum in several other areas, and I'll mention just a few. Starting with live sports on Prime. The fourth season of Thursday Night Football broke more records. It was our most watched season ever, averaging more than 15 million viewers, a 16% year- over-year increase and a third consecutive year of double-digit growth. And the Packers versus Bears wild card game was the most streamed NFL game in history with 31.6 million viewers, clearing the prior mark by more than 4 million. We just made Alexa+ available to all customers in the U.S., free for Prime members and $19.99 a month for non-Prime members. Alexa+ continues to get even better and more capable, and we've added new ways to interact with Alexa, including a new chat experience at alexa.com, a redesigned mobile app and new integrations with third-party devices like Samsung TVs and BMW cars. We've also added new features like the ability to answer a ring doorbell on a customer's behalf and more ways to shop or manage a home. And finally, the team is making rapid progress on Amazon Leo, which will bring connectivity to consumers, enterprises and governments in places where they don't have broadband connectivity. Our enterprise-grade customer terminal, Leo Ultra, is the fastest satellite Internet antenna ever built, delivering simultaneous download speeds of up to 1 gigabit per second and upload speeds of up to 400 megabits per second. Leo will offer enterprise-grade performance and advanced encryption with secure private networking that bypasses public Internet connecting directly to AWS. We've launched 180 satellites, have more than 20 launches planned in 2026, more than 30 in 2027 and expect to launch commercially in 2026. We have dozens of commercial agreements already signed, including with AT&T, DIRECTV Latin America, JetBlue and Australia's national broadband network and have many more on the way. It's been an action-packed year of innovation and progress, and we've hit the ground running in 2026. With that, I'll turn it over to Brian for a financial update."
    },
    {
      "speaker": "Brian T. Olsavsky",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Thanks, Andy. Starting with our top line financial results. Worldwide revenue was $213.4 billion, a 12% increase year-over-year, excluding the 150 basis point favorable impact of foreign exchange. In Q4, we reported worldwide operating income of $25 billion. This operating income includes three special charges, which reduced operating income by $2.4 billion. The first charge of $1.1 billion is for the resolution of tax disputes associated with our stores business in Italy and the settlement of a lawsuit. This charge primarily impacts our International segment and is largely recorded in the fulfillment and other operating expense line items. Second charge of $730 million is for the estimated severance costs. This charge impacts all three of our segments and is recorded primarily in the fulfillment, sales and marketing and technology and infrastructure expense line items. The third charge of $610 million is for asset impairments, primarily related to physical stores. This charge primarily impacts the North America segment and is recorded in the other operating expense line. Moving on to our segment results. In the North America segment, fourth quarter revenue was $127.1 billion, an increase of 10% year-over-year. International segment revenue was $50.7 billion, an increase of 11% year- over-year, excluding the impact of foreign exchange. Worldwide paid units grew 12% year-over-year, which was our highest quarterly growth rate in 2025. The fourth quarter marked a strong finish to the year as we delivered to customers during the peak holiday season. Our sharp pricing, vast selection and record fast delivery speeds resonated with customers. They appreciate the convenience of receiving their items quickly from gifts for family and friends to everyday essentials and perishable groceries. Our millions of global third-party sellers continue to be an important contributor to our broad selection. In Q4, Worldwide third-party seller unit mix was 61%. We continue to invest in tools and services, including a comprehensive suite of AI tools that help our selling partners manage and grow their businesses. Shifting to profitability. North America segment operating income was $11.5 billion with an operating margin of 9%, up from an 8% margin in Q4 of 2024. International segment operating income was $1 billion with an operating margin of 2.1%. Excluding the impact of special charges mentioned earlier, International segment operating margins also expanded year-over-year. We're pleased with the fulfillment network performance throughout the peak season. We made strong progress improving the cost structure of our network over the past few years. In the U.S., our regionalized network is operating at scale, and we continue to make refinements. This regionalization has improved local inventory placement, leading to faster delivery at lower costs. Last year, U.S. Prime members received over 8 billion items the same or next day, up more than 30% year-over-year, with groceries and everyday essentials making up half of the total items. For the third year in a row, globally, in 2025, we achieved both our fastest ever delivery speeds for Prime members while also reducing our cost to serve. By leveraging our existing U.S. network, we can now deliver perishable groceries to customers in more than 2,300 cities and towns, all with same-day delivery. We saw significant adoption of this service throughout the year. When customers engage with our perishable offering, they demonstrate notably higher monthly spend compared to those who do not shop the category. We also see that customers shopping perishable groceries add 3x more items to their same-day delivery orders. Looking ahead, we see further opportunity to enhance productivity in our global fulfillment network while delivering at faster speeds for customers. We will continue optimizing inventory placement to drive down distance travel, reduce touches per package and improve package consolidation as well as launch robotics and automation to increase efficiency and elevate the customer experience. Shifting to advertising. Advertising revenue grew 22% in the fourth quarter, and we added over $12 billion of incremental revenue in 2025 alone as our full funnel advertising approach of connecting brands with customers is resonating simplifying the advertiser experience to enable brands to better reach customers wherever they are. Moving next to our AWS segment. Revenue was $35.6 billion and growth accelerated to 24% year-over-year. We added $2.6 billion in quarter-over- quarter revenue and AWS now has an annualized revenue run rate of $142 billion. This acceleration was driven by both core and AI services as customers continue to modernize their infrastructure and migrate workloads to the cloud. Our AI offerings continue to resonate with customers, including our agentic capabilities. This growth was helped in part by the more than 1 gigawatt of capacity we added in Q4. In 2025, AWS added more data center capacity than any other company in the world. AWS operating income was $12.5 billion. We're seeing strong top line growth while remaining focused on driving efficiencies across the business. This includes investing in software and process improvements to optimize server capacity, developing a more efficient network using our lower-cost custom networking gear and advancing custom silicon. At the same time, we continue to rapidly develop products and services on behalf of customers. As we've long said, we expect AWS operating margins to fluctuate over time, driven in part by the level of investments we're making at any point in time. Turning to cash flows. Our full year operating cash flow increased to $139.5 billion in 2025, up 20% year-over-year due primarily to improved operating income and changes in working capital. Now turning to our Q1 financial guidance. Q1 net sales are expected to be between $173.5 billion and $178.5 billion. This guidance anticipates a favorable impact of approximately 180 basis points from foreign exchange rates. As a reminder, global currencies can fluctuate during the quarter. Q1 operating income is expected to be between $16.5 billion and $21.5 billion. A few things to mention on the operating income guidance. Within the North America segment, we do expect a year-over-year cost increase of approximately $1 billion related to Amazon Leo. We have more than 20 launches planned in 2026 and more than 30 in 2027, which means we're spending more on launching satellites each year. Select enterprise customers are testing Amazon Leo services now, and we expect a wider commercial rollout later this year. As a reminder, today, we do expense most of these Leo costs as incurred. We expect that later in the year, many of these costs such as satellite manufacturing and launch services will be capitalized. Within the International segment, we're continuing to invest more in our stores business to enhance the customer experience and to encourage retail demand to move online more quickly. This includes bringing faster delivery options, including Amazon Now, our service, which delivers to customers in 30 minutes or less. We're also working hard to stay sharp on pricing and seller fees. And there are countries where we've had to be more aggressive to meet or beat competitors' prices. We like these investments because they will delight customers, grow our business, and we believe they will generate long-term positive return on invested capital. As we enter 2026, I'm energized by our team's strong execution. I want to thank everyone across the company for their hard work on behalf of our customers. We remain focused on driving an even better customer experience, which is the only reliable way to create lasting value for our shareholders. With that, let's move on to your questions. Question and Answer"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] Our first question comes from the line of Mark Mahaney with Evercore ISI."
    },
    {
      "speaker": "Mark Stephen F. Mahaney",
      "role": "Evercore ISI Institutional Equities, Research Division",
      "text": "Evercore ISI Institutional Equities, Research Division I think, Brian, let me throw this to you or maybe to Andy. On the strong long-term return on invested capital, I think that's the debate in the market today. So could you give us a little bit more insight into how you think investors will be able to see that, either talk about the duration of the CapEx cycle that you're going through now or what we should see in terms of profitability levels? And maybe also talk about like other de minimis or minimum free cash flow generation levels that you don't want to go below as you go through this CapEx cycle. Just help us get to that -- get to your level of confidence in having a strong long-term return on that invested capital."
    },
    {
      "speaker": "Brian T. Olsavsky",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Yes. Sure, Mark. Thank you. I'll start from the financial side. So on the investments we're making, as Andy said earlier, we are putting into service with customers all capacity that we're getting and it's immediately useful. And we're also seeing a long arc of additional revenue that we see from other customers and backlog and commitments that people are anxious to make with us, especially for AI services. So you can see that's working its way into our P&L, both through CapEx and also through our operating margin in AWS. AWS is 35% operating margin through Q4, up 40 basis points year-over- year. As we talked about before, that is going to fluctuate over time. It certainly has a headwind from the investments in AI and the depreciation on that CapEx. But we also work very hard to offset that with efficiencies and cost reductions. So we will see how that develops over time. So -- but yes, we see strong return on invested capital. We see strong demand for these services, and we continue to like the investments in this area."
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director I would add to that. If you look at the capital we're spending and intend to spend this year, it's predominantly in AWS. And some of it is for our core workloads, which are non-AI workloads because they're growing at a faster rate than we anticipated. But most of it is in AI. And we just have a lot of growth and a lot of demand. And when you're growing 24% year-over- year with an annualized revenue run rate of $142 billion, you're growing a lot. And what we're continuing to see is as fast as we install this capacity, this AI capacity, we are monetizing it. And so it's just a very unusual opportunity. As I've shared a lot of times, I passionately believe that every customer experience that we know of today is going to be reinvented with AI, there are going to be a whole bunch of customer experiences that none of us ever imagined that are going to become the norms of how we all operate every day and what we use. And I think the other thing is that if you really want to use AI in an expansive way, you need your data in the cloud and you need your applications in the cloud. Those are all big tailwinds pushing people towards the cloud. So we're going to invest aggressively here, and we're going to invest to be the leader in this space as we have been for the last number of years. We have, I think, a fair bit of experience over the years in AWS of forecasting demand signals and doing it in such a way that we don't have a lot of wasted capacity and that we also have enough capacity to serve the demand that's there. And I think we've also proven with AWS over the years in how we build data centers and how we run them and how we invent in there, if you think about our chips and our hardware and our networking gear and how we've invented in power that this isn't some sort of quixotic top line grab, we have confidence that we -- that these investments will yield strong returns on invested capital. We've done that with our core AWS business. I think that will very much be true here as well. And I think some of the things that you will see over time in the AI space is you're going to keep seeing all of the inference services, which is going to be the majority of the long-term AI workloads is going to be inference. You're going to see the inference keep getting optimized. You're going to see higher utilization on those services. You'll see prices normalize over a period of time. And then I think the companies that have not just the excellence in infrastructure, but also the components that give them -- give customers better price performance and give those companies themselves better economics are going to have advantaged financials. And I think if you look, we're already off to a really good start having Trainium underneath the majority of our Bedrock service. And that's not just giving customers better prices, but it also gives us better economics. And so we see that following the same sorts of patterns we saw in the early days of our core AWS investment. I'm very confident we're going to have strong return on invested capital here."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And the next question comes from the line of Doug Anmuth with JPMorgan."
    },
    {
      "speaker": "Douglas Till Anmuth",
      "role": "JPMorgan Chase & Co, Research Division",
      "text": "JPMorgan Chase & Co, Research Division Can you just talk about how Project Rainier is running with Anthropic after its first full quarter? And I think in the release, it talks about 500,000 chips, but a few months ago, you talked about getting to 1 million as well. So if you could clarify that. And then maybe just to follow up on Mark's question. Are there any financial guardrails or governors in place that we should think about around the spend just in terms of operating income growth or positive free cash flow?"
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director Yes. I'll start with the Trainium piece. We are very excited about the growth that we see in Trainium and the future that we have there. I think if you look at what's happened in the early innings of AI over the first few years, you see a lot of usage, but customers are really thirsty for better price performance. And Trainium has 30% to 40% better price performance than comparable GPU. So it's very compelling to customers. You mentioned Project Rainier, Anthropic is building their next -- they're training their next cloud model on top of Trainium2. And that's what Project Rainier is. So we talked about 500,000 chips there. You'll see that continuing to increase. They're also using a fair bit of Trainium2 for other workloads and their own APIs beyond just Project Rainier. But Trainium is a multibillion dollar annualized run rate business at this point, and it's fully subscribed. And what you're also seeing is Trainium3, which is the next version of Trainium, which we just started shipping, that's 40% more price performance than Trainium2. And we have -- there is a very substantial amount of interest there. We expect that nearly all of that supply will be committed by somewhere around the middle of this year. And we're just in the process of building Trainium4. There's very substantial interest in Trainium4, which is coming in 2027. And we're already having conversations about Trainium5. So there is a lot of interest in Trainium at this point. And I think when you -- I think people know about our chips capability and our chips business, but I'm not sure folks realize how strong a chips company we've become over the last 10 years. If you look at what we've done with Trainium, if you look at what we've done with Graviton, which is our CPU chip, which is about 40% better price performance than comparable x86 processors, 90% of the top 1,000 AWS customers are using Graviton very expansively. If you combine Trainium and Graviton, it's well over a $10 billion annualized run rate business, and it's still very early there. So I'm very optimistic about what we're seeing. The Project Rainier has gone very well. I think Anthropic is quite pleased with it. We've learned a lot in the process as well, but it's early days with what's possible here. This is a big business that's getting bigger and has a lot of potential. And then I just -- I'd briefly comment on your second question that we are as I mentioned, this is what -- I think this is an extraordinarily unusual opportunity to forever change the size of AWS and Amazon as a whole. I think it also is an extraordinary opportunity for companies to change all their customer experiences and for start-ups to be able to build brand-new experiences and businesses that would have taken much longer to try to accomplish before that they can do right now. And so we see this as an unusual opportunity, and we are going to invest aggressively here to be the leaders because like we've been in the last number of years and like I think we will be moving forward."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Ross Sandler with Barclays."
    },
    {
      "speaker": "Ross Adam Sandler",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division Great. Andy, you mentioned a few calls back how the AI market was currently a bit top heavy with a lot of the spend kind of clustering around a few of the AI native labs. So how is that changing as you look out into '26? And specifically, how do you think you might extend your relationship with a company like OpenAI to maybe help Amazon's AI efforts, both on the retail side and the AWS side?"
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director Yes. The way I would describe what we see right now in the AI space is it's really kind of a barbelled market demand where on one end, you have the AI labs who are spending gobs and gobs of compute right now, along with what I would consider a couple of runaway applications. And then at the other side of the barbell, you've got a lot of enterprises who are getting value out of AI in doing productivity and cost avoidance types of workloads. These are things like customer service or business process automation or some of the fraud pieces. And then in that middle of the barbell are all the enterprise production workloads. And I would say that the enterprises are in various stages at this point of evaluating how to move those, working on moving those and then putting them into production. But I think that middle part of the barbell very well may end up being the largest and the most durable. And I would put in the middle of that barbell, too, by the way, I would put just the altogether brand-new businesses and applications that companies build that right from the get-go run in production on top of AI. And so I think that to me, when I look at this and what's happening, it's kind of unbelievable if you look at the demand of what you're seeing already with AI, but the lion's share of that demand is still yet to come in the middle of that barbell. And that will come over time. It will come as you have more and more companies with AI talent as more and more people get educated with the AI background. as inference continues to get less expensive, and that's a big piece of what we're trying to do with Trainium and our hardware strategy. And as companies start to have success in moving those workloads to -- further and further success in moving those workloads to run on top of AI. So I think there's -- it's just a huge opportunity. It's still in the relative early stages, even though it's growing at a very -- like an unprecedented clip as we've talked about. And then I think how do we see our relationships extending with other companies like OpenAI, I would tell you that this movement in what's happening in AI is -- it's very broad. It's going to be a lot of companies. It is a lot of companies already. There's a number of AI labs, but almost every company you talk to, almost every conversation we have on the AWS side, starts with AI. And so we have very significant relationships with a lot of different companies. I think we announced an agreement with OpenAI in November. We're excited about that agreement. It's a big one. We have a lot of respect for the company, and we hope to continue to extend our partnership over time. But this AI movement is not going to be a couple of companies. It's going to be thousands of companies over time."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Michael Morton with MoffettNathanson. Michael Paul Morton MoffettNathanson LLC This one is on the retail business. Andy, you've talked about how you're passionate this is going to change experiences across the board. And you've shared some encouraging data points on Rufus. And we're seeing all of the other Internet platforms roll out Agentic protocols. I would love to see how you think this plays out for the retail business and the on-site ads portion of the retail business is what seems like it could be a compression in the funnel as consumers get better answers over time. Anything there would be great."
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director I'm very optimistic about the customer experience that will ultimately be what customers use for Agentic shopping. And I think it's good for customers. I think it's going to make it easier for them. It's a big piece of why we've invested as significantly as we have in our own shopping assistant in Rufus. And if you haven't checked out Rufus recently, I really encourage you to do so. It's gotten much, much better and keeps getting better every month. And we have about -- we have 300 million customers who used Rufus in 2025. Customers who use Rufus are about 60% more likely to complete a purchase. And so you just -- you're seeing a lot of usage of it and a lot of growth, and I think it's very useful. And I think at the same time, we will have relationships with third-party horizontal agents that can enable shopping as well. We have to collectively figure out a better customer experience. It's still -- these horizontal agents don't have any of your shopping history. They get a lot of the product details wrong, they get a lot of the pricing wrong. And so we have to try to find a customer experience together that's better and a value exchange that makes sense for both parties. But I'm very hopeful that we'll get there over time. We continue to have a number of conversations. And then I think you're going to have to look at as time goes on, which types of -- which shopping agents are consumers going to use. And it kind of reminds me in some ways of the early days of kind of all the search engines that were referring traffic to retailers. And it's still a relatively small portion of the overall traffic and sales. But of that fraction, you have to ask how many consumers are going to prefer using a horizontal agent where it's kind of a middle person between the retailer and the consumer versus wanting to use a great agent from that retailer that has all its shopping history and that has all the data right there and makes it easy if you're just spearfishing for something to shop for it right there or if you want to do discovery, you can do it there, and it's got the best data on shopping. I think a lot of customers are ultimately going to choose to use a great shopping agent from that retailer. Because if you think about what consumers really want in retail in a retailer, they want really broad selection. They want low prices. They want really fast delivery. And then they want a retailer that they can trust and that takes care of them. And I think horizontal agents are pretty good at aggregating selection, but retailers are much better at doing all 4 of those items. And so I'm very optimistic that people will use our shopping agent. It's off to a great start. I also expect that we'll work with other third-party agents over time as we work on the issues I mentioned earlier."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "The next question comes from the line of Brian Nowak with Morgan Stanley."
    },
    {
      "speaker": "Brian Thomas Nowak",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Andy, I want to ask you one about the global retail business this year. I know there's a lot of areas of investment in it that you're talking about to sort of make -- improve the service, make it more durable over the long term, et cetera. But I'm assuming there are also sources of efficiency you expect to see this year. So can you sort of help us understand both sides of the ledger on retail this year? Where are some of the areas where you see the potential for sources of efficiency and cost to serve savings? And then where should we be thinking about the areas of investment to sort of drive more durable growth, robotics, et cetera? How does that sort of break down?"
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director Yes. So I would say on the side of continuing to invest to keep growing the retail business, the kind of core drivers of demand continue to be the same. We're going to work really hard to expand selection. And you've seen what we've done over the last several years. The expansion of selection has been broad. And you'll see it on both ends of the spectrum. We have a lot more of those luxury brands that have built presences in Amazon had success and found that we could manage their brand presentation in the right way, and they've been very happy. I mean you only have to look at L'Oreal as an example, too, of just how fast that business is growing and how happy our partners have been. And at the same time, we are working really hard to continue to expand the amount of everyday essentials that we offer our customers. And the growth in Everyday Essentials in our business is really remarkable, as I mentioned in my opening comments. And one out of three units now that we move our Everyday Essentials. And what we find there is that the more the customers can rely on us for Everyday Essentials and the lower ASP items, they just choose to do more of their downstream shopping with us in every way. We're just more front of mind. And so I think a big piece of why we have captured more and more of those everyday essentials, and you see it also in our grocery business with perishables, too, is just our speed of delivery improvements over the last three years has been really marked. I mean it's customers -- it's the one thing I get stopped on the street most often about, which is I just can't believe how quickly from when I order something, I get it to my door and how reliable you are. I think along that speed of delivery piece, it's also quite interesting what's happening with quick commerce, and we have this offering called Amazon -- now that we've largely started outside the U.S. in India and the UAE and Mexico that gets thousands of items to customers within 30 minutes. And it really is -- it's quite interesting how quickly that is growing. And I think that it's just another one of those things like Everyday Essentials that when you're able to order more and more from Amazon, you just think of Amazon first if it's a great experience that we're offering for whatever you're looking for. But in our -- if you look in India, which is the place we've rolled out quick commerce the fastest, customers who try quick commerce are shopping with triple the frequency than they did before they tried us in quick commerce. So, those are all areas, I think, are pretty excited that we're expanding. You'll see us continue to expand what we're doing on the perishable side, too, which we're quite excited about. And we are able to deliver perishables same day in thousands of cities around the world now. And the cities in which we have those perishables available, 9 of the 10 top items that are ordered in that geography are perishables. And so we're just having a lot of success with that, too. And people buy perishables from us after they buy perishables, they're shopping with us twice as frequently. So a lot of good things to like there. And then on the efficiencies, we are -- I mean, we always have a very long list of these that we're working on, Brian. And it's true today as well. Like if you look -- even -- I mentioned -- I talked a lot about regionalization in our fulfillment network, particularly in the U.S. over the last couple of years. And I said we weren't done honing that, and that's true. It's just -- we don't talk about it every time. But if you look at what we've done there, we've extended the number of regions. It was 8. It's now 10. We've extended regionalization to what we do with our inbound delivery to be much more efficient in being able to get more items closer to customers more quickly. We have made a lot of -- we're doing a lot of work, and we've made a huge amount of progress in being able to get more units into each box. And as we're able to get more units into each box, it obviously saves shipments and we drive better operating income when we do that. And we've made very significant progress there, but have a lot more planned. It's part of -- by the way, that improvement is part of what helps us do things like I was talking about earlier and adding to a delivery in near real time. And then robotics, as you mentioned, is another big one for us. We have over 1 million robots today in our fulfillment network. They take care of all sorts of functions, but still a fraction of what I think we're going to be able to enable over time, which will allow our -- we'll always have a lot of people that we employ in our fulfillment network, but they'll leave to the robotics things that are more repetitive. So it's better productivity for the business, more safe for our teammates and there's real cost efficiencies in that as well. So a lot on both sides of the ledger as always."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And our final question comes from the line of Eric Sheridan with Goldman Sachs."
    },
    {
      "speaker": "Eric James Sheridan",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division Maybe a few parts just on AWS. Can you speak to the current state of your revenue backlog as of Q4 and also discuss a little bit about what you see both for internal use cases and external client needs with respect to any imbalance between supply and demand around AI efforts and how you think about closing the gap on those as more capacity comes online through 2026?"
    },
    {
      "speaker": "Andrew R. Jassy",
      "role": "President, CEO & Director",
      "text": "President, CEO & Director That's a lot of parts. I'll start with the first one, which is on backlog, our backlog is $244 billion. That's up 40% year-over-year. I think it's up 22% quarter-over-quarter. We have -- and we have a lot of deals that are in the pipeline. There's just -- as I mentioned earlier, there is a lot of demand for AWS right now. in the AI space and also in the core AWS space. Your second question was internal and external use cases. and then the impact around supply and demand. The vast majority of our -- the capital that we spend and the capacity that we have is consumed by external customers. We have -- Amazon has always been a very large AWS customer, a very helpful AWS customer because they're very demanding, and they use the services very expansively and stretch the limits as we launch things. So they've always been a very important big customer, but always a very small fraction of the total, and that's true today in AI as well as the overall AWS business. Internally, we have all sorts of ways that we are using AI. We have over 1,000 AI applications that we've either deployed or in the process of building, and they range from our shopping assistant in Rufus that we were just talking about to Alexa+, which is a really large-scale generative AI application to applications in our fulfillment network that allow us to have more accurate forecasting predictions to how we do customer service and our customer service chatbot to how we are making it much easier for brands to create advertisements and to optimize all their campaigns across the full funnel of advertising options we have to -- in live sports, if you watch Thursday Night Football, you can see defensive alerts, which predict which player is going to blitz or pocket health. I mean we -- in every one of our businesses, you see a very broad use of AI to improve the customer experience. And in many cases, just to completely reinvent what was possible before. I mean it's pretty neat to use something like Lens where you may see something you want to buy, you can just take a picture of it in the app and it finds the item on the detail page you can buy in one click. It's kind of magic. And externally, I would say it's kind of what I said earlier. You have AI labs consuming lots and lots of capacity. both for training as well as for the inference and the research across what they're doing with their different applications and models. We see enterprises all sorts of workloads, customer service automation, business process automation, fraud, completely reinventing their applications, agentic coding applications, legal applications. Suno is a really cool example of an AWS customer that's kind of reinvented how you can write music and build music. So really across the board. And I just think on the supply and demand, what I would tell you is we're growing 24% year-over-year on a $142 billion annualized run rate business. So we're growing at really an unprecedented rate yet, I think every provider would tell you, including us that we could actually grow faster if we had all the supply that we could take. And so we are being incredibly scrappy around that. If you look in the last 12 months, we added 3.9 gigawatts of power. Just for perspective, that's twice what we had in 2022 when we were an $80 billion annual run rate business. We expect to double it again by the end of '27. We added 1.2 gigawatts of power in Q4, just quarter-over-quarter. So it's -- so we are -- our team is being aggressive and scrappy and inventive in adding capacity as fast as we can. We'll add a lot more in '26 and '27 and '28 for that matter. And -- and we're very optimistic we can continue to grow in the ballpark of what we have."
    },
    {
      "speaker": "Dave  Fildes",
      "role": "Vice President of Investor RelationsThanks for joining us on the call today",
      "text": "Vice President of Investor RelationsThanks for joining us on the call today and for your questions. A replay will be available on our Investor Relations website for at least three months. We appreciate your interest in Amazon, and we look forward to talking with you again next quarter. Copyright  2026 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.  2026 S&P Global Market Intelligence."
    }
  ],
  "source_file": "Amazon.com, Inc., Q4 2025 Earnings Call, Feb 05, 2026.rtf"
}