{
  "event_id": "GOOGL_2025-04-24",
  "ticker": "GOOGL",
  "company": "Alphabet Inc.",
  "quarter": 1,
  "fiscal_year": 2025,
  "call_date": "2025-04-24",
  "call_start_ts": "2025-04-24 20:30:00+00:00",
  "raw_text": "\n|[pic]                     |\n\nAlphabet Inc. NasdaqGS:GOOGL\nFQ1 2025 Earnings Call Transcripts\nThursday, April 24, 2025 8:30 PM GMT\nS&P Global Market Intelligence Estimates\n|      |-FQ1 2025-           |-FQ2  |-FY   |-FY   |\n|      |                     |2025- |2025- |2026- |\n|                              |CONSENSUS      |ACTUAL         |SURPRISE       |\n|                   |CONSENSUS          |ACTUAL             |SURPRISE           |\n|FQ2 2024           |1.84               |1.89               |[pic]2.72 %        |\n|FQ3 2024           |1.85               |2.12               |[pic]14.59 %       |\n|FQ4 2024           |2.13               |2.15               |[pic]0.94 %        |\n|FQ1 2025           |2.01               |2.81               |[pic]39.80 %       |\n\n|Table of Contents                                     |   |\n|Call Participants          |..............................................|3      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Presentation               |..............................................|4      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Question and Answer        |..............................................|11     |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|                                                                                  |\n|Call Participants                                                                 |\n|                           |                           |                           |\n|EXECUTIVES                 |                           |                           |\n|                           |Ross Adam Sandler          |                           |\n|                           |Barclays Bank PLC, Research|                           |\n|Anat  Ashkenazi            |Division                   |                           |\n|Senior VP & CFO            |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|James Friedland            |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Philipp  Schindler         |                           |                           |\n|Senior Vice President &    |                           |                           |\n|Chief Business Officer of  |                           |                           |\n|Google                     |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Sundar  Pichai             |                           |                           |\n|CEO & Director             |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|ANALYSTS                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Brian Thomas Nowak         |                           |                           |\n|Morgan Stanley, Research   |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Douglas Till Anmuth        |                           |                           |\n|JPMorgan Chase & Co,       |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Eric James Sheridan        |                           |                           |\n|Goldman Sachs Group, Inc., |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Kenneth James Gawrelski    |                           |                           |\n|Wells Fargo Securities,    |                           |                           |\n|LLC, Research Division     |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Mark Elliott Shmulik       |                           |                           |\n|Sanford C. Bernstein & Co.,|                           |                           |\n|LLC., Research Division    |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Mark Stephen F. Mahaney    |                           |                           |\n|Evercore ISI Institutional |                           |                           |\n|Equities, Research Division|                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Ronald Victor Josey        |                           |                           |\n|Citigroup Inc., Research   |                           |                           |\n|Division                   |                           |                           |\n|                                                                                  |\n\n\nPresentation\n\n\nOperator\n\nWelcome, everyone. Thank you for standing by for the Alphabet First Quarter\n2025 Earnings Conference Call. [Operator Instructions]\n\n\nI would now like to hand the conference over to your speaker today, Jim\nFriedland, Senior Director of Investor Relations. Please go ahead.\n\n\nJames Friedland\n\nThank you. Good afternoon, everyone, and welcome to Alphabet's First\nQuarter 2025 Earnings Conference Call. With us today are Sundar Pichai,\nPhilipp Schindler and Anat Ashkenazi.\n\n\nNow I'll quickly cover the safe harbor. Some of the statements that we make\ntoday regarding our business, operations and financial performance may be\nconsidered forward-looking. Such statements are based on current\nexpectations and assumptions that are subject to a number of risks and\nuncertainties. Actual results could differ materially. Please refer to our\nForms 10-K and 10-Q, including the risk factors. We undertake no obligation\nto update any forward-looking statement.\n\n\nDuring this call, we will present both GAAP and non-GAAP financial\nmeasures. A reconciliation of non-GAAP to GAAP measures is included in\ntoday's earnings press release, which is distributed and available to the\npublic through our Investor Relations website located at abc.xyz/investor.\nOur comments will be on year-over-year comparisons unless we state\notherwise.\n\n\nAnd now I'll turn the call over to Sundar.\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Jim. Good afternoon, everyone. We are pleased with our strong\nresults this quarter. We continue to see healthy growth and momentum across\nthe business, including AI powering new features.\n\n\nIn Search, we saw continued double-digit revenue growth. AI Overviews is\ngoing very well with over 1.5 billion users per month, and we are excited\nby the early positive reaction to AI Mode. There's a lot more to come\nahead.\n\n\nIn subscriptions, we surpassed 270 million [ subscriptions ] with YouTube\nand Google One as key drivers. And Cloud grew rapidly with significant\ndemand for our solutions, and you saw our leadership in AI at Cloud Next\nacross infrastructure, agents and more.\n\n\nOur differentiated full stack approach to AI continues to be central to our\ngrowth. This quarter was super exciting as we rolled out Gemini 2.5, our\nmost intelligent AI model, which is achieving breakthroughs in performance,\nand it's widely recognized as the best model in the industry. That's an\nextraordinary foundation for our future innovation, and we are focused on\nbringing this to people and customers everywhere.\n\n\nLooking ahead to I/O, Brandcast and Google Marketing Live, I can't wait for\nour teams to showcase the innovations they've been working on.\n\n\nTurning to our AI progress this quarter, which continues to enable\nsignificant growth opportunities. The elements of the AI stack I've\npreviously mentioned are AI infrastructure; world-class research, including\nmodels and tooling; and our products and platforms.\n\n\nStarting with AI infrastructure, our long-term investments in our global\nnetwork have positioned us well. Google's network is robust and resilient,\nsupported by over 2 million miles of fiber and 33 subsea cables.\nComplementing this, we offer the industry's widest range of TPUs and GPUs\nand continue to invest in next-generation capabilities.\n\n\nIronwood, our seventh-generation TPU and most powerful to date, is the\nfirst designed specifically for inference at scale. It delivers more than\n10x improvement in compute power or a recent high-performance TPU while\nbeing nearly twice as power efficient. Our strong relationship with NVIDIA\ncontinues to be a key advantage for us and our customers. We were the first\ncloud provider to offer NVIDIA's groundbreaking B200 and GB200 Blackwell\nGPUs, and we'll be offering their next-generation Vera Rubin GPUs.\n\n\nSecond, this infrastructure powers our world-class research, including our\nindustry-leading models. We released Gemini 2.5 Pro last month, receiving\nextremely positive feedback from both developers and consumers. 2.5 Pro is\nstate-of-the-art on a wide range of benchmarks and debuted at #1 on the\nchatbot arena by a significant margin. 2.5 Pro achieved big leaps in\nreasoning, coding, science and math capabilities, opening up new\npossibilities for developers and customers. Active users in AI studio and\nGemini API have grown over 200% since the beginning of the year.\n\n\nAnd last week, we introduced 2.5 Flash, which enables developers to\noptimize quality and cost. Our latest image and video generation models,\nImagen 3 and Veo 2, are rolling out broadly and are powering incredible\ncreativity.\n\n\nTurning to open models. We launched Gemma 3 last month, delivering state-of-\nthe-art performance for its size. Gemma models have been downloaded more\nthan 140 million times.\n\n\nLastly, we are developing AI models in new areas where there's enormous\nopportunity, for example, our new Gemini Robotics models. And in health, we\nlaunched AI co-scientist, a multi-agent AI research system, while AlphaFold\nhas now been used by over 2.5 million researchers.\n\n\nThird, turning to products and platforms. All 15 of our products with 0.5\nbillion users now use Gemini models. Android and Pixel are 2 examples of\nhow we are putting the best AI in people's hands, making it super easy to\nuse AI for a wide range of tasks, just by using their camera, voice or\ntaking a screen shot.\n\n\nWe are upgrading Google Assistant on mobile devices to Gemini. And later\nthis year, we'll upgrade tablets, cars and devices that connect to your\nphones such as headphones and watches. The Pixel 9a launched very strong\nreviews, providing the best of Google's AI offerings like Gemini Live and\nAI-powered camera features. And Gemini Live camera and screen sharing is\nnow rolling out to all Android devices, including Pixel and Samsung S25.\n\n\nNow moving on to key highlights from across Search, Cloud, YouTube and\nWaymo. First, Search. AI is one of the most revolutionary technologies for\nenabling and expanding our information mission. And for Search, we see it\ngrowing the number and types of questions we can answer. We are already\nseeing this with AI Overviews, which now has more than 1.5 billion users\nevery month. Nearly a year after we launched AI Overviews in the U.S., we\ncontinue to see that usage growth is increasing as people learn that Search\nis more useful for more of their queries. So we are leaning in heavily\nhere, continuing to roll the feature out in new countries to more users and\nto more queries.\n\n\nBuilding on the positive feedback for AI Overviews, in March, we released\nAI Mode, an experiment in labs. It expands what AI Overviews can do with\nmore advanced reasoning, thinking and multimodal capabilities to help with\nquestions that need further exploration and comparisons. On average, AI\nMode queries are twice as long as traditional search queries. We're getting\nreally positive feedback from early users about its design, fast response\ntime and ability to understand complex, nuanced questions.\n\n\nWe also continue to see significant growth in multimodal queries. Circle to\nSearch is now available on more than 250 million devices with usage\nincreasing nearly 40% this quarter. And monthly visual searches with Lens\nhave increased by 5 billion since October.\n\n\nMoving on to Cloud. At Cloud Next, we announced major innovations, and over\n500 companies shared the business results they are achieving by working\nwith us. We provide leading cost, performance and reliability for AI\ntraining and inference. This enables us to deliver the best value for AI\nleaders, like Anyscale and Contextual AI, as well as global brands like\nVerizon. And for highly sensitive data and regulatory requirements, Google-\ndistributed Cloud and our sovereign AI make Gemini available on premises or\nin country.\n\n\nOur Vertex AI platform makes over 200 foundation models available, helping\ncustomers like Lowe's integrate AI. We offer industry-leading models,\nincluding Gemini 2.5 Pro, 2.5 Flash, Imagen 3, Veo 2, Chirp and Lyria, plus\nopen-source and third-party models like Llama 4 and Anthropic.\n\n\nWe are the leading cloud solution for companies looking to the new era of\nAI agents, a big opportunity. Our Agent Development Kit is a new open-\nsource framework to simplify the process of building sophisticated AI\nagents and multi-agent systems. And Agent Designer is a low-code tool to\nbuild AI agents and automate tasks in over 100 enterprise applications and\nsystems.\n\n\nWe are putting AI agents in the hands of employees at major global\ncompanies like KPMG. With Google Agentspace, employees can find and\nsynthesize information from within their organization, converse with AI\nagents and take action with their enterprise applications. It combines\nenterprise search, conversational AI or chat and access to Gemini and third-\nparty agents. We also offer prepackaged agents across customer engagement,\ncoding, creativity and more that are helping to provide conversational\ncustomer experiences accelerate software development and improve decision-\nmaking.\n\n\nAnd of course, Google Workspace. It delivers more than 2 billion AI assists\nmonthly, including summarizing Gmail and refining Docs.\n\n\nLastly, our cybersecurity products are helping organizations detect,\ninvestigate and respond to cybersecurity threats. Our expertise, coupled\nwith integrated Gemini AI advances, detects malware, prioritizes threats\nand speeds up investigative workflows. This quarter, we were excited to\nannounce our intent to acquire Wiz, a leading cloud security platform that\nprotects all major clouds and code environments. Together, we can make it\neasier and faster for organizations of all types and sizes to protect\nthemselves, end-to-end and across all major clouds. We think this will help\nspur more multi-cloud computing, something customers want.\n\n\nNext, YouTube. Yesterday marked a historic milestone, the 20th anniversary\nof the first video uploaded to YouTube. From that single 19-second upload,\nthe platform has grown into a global phenomenon, fundamentally changing how\nbillions of people create, share and experience content.\n\n\nThrough all this growth, subscriptions are now a big part of the business.\nWe continue to diversify subscription options, recently expanding our\nPremium Lite pilot to the U.S., giving users a new way to enjoy most videos\non YouTube ad-free.\n\n\nTV is the primary device for YouTube viewing in the U.S. According to\nNielsen, YouTube has been #1 in streaming watch time in the U.S. for the\nlast 2 years. And YouTube now has over 1 billion monthly active podcast\nusers. YouTube Music and Premium reached over 125 million subscribers,\nincluding trials, globally.\n\n\nAnd finally, Waymo is now safely serving over 0.25 million paid passenger\ntrips each week. That's up 5x from a year ago. This past quarter, Waymo\nopened up paid service in Silicon Valley. Through our partnership with\nUber, we expanded in Austin and are preparing for our public launch in\nAtlanta later this summer. We recently announced Washington, D.C. as a\nfuture ride-hailing city, going live in 2026 alongside Miami. Waymo\ncontinues progressing on 2 important capabilities for riders, airport\naccess and freeway driving.\n\n\nThanks to all of our employees for their work this quarter. It was a great\nstart to the year, and Q2 will be even more exciting.\n\n\nWith that, Philipp, over to you.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nThanks, Sundar, and hello, everyone. I'll quickly cover performance for the\nquarter and then frame the rest of my remarks around the progress we are\ndelivering across Search, Ads, YouTube and partnerships. Google Services\nrevenues were $77 billion for the quarter, up 10% year-on-year, driven by\nstrong growth in Search and YouTube, partially offset by a year-on-year\ndecline in network revenues. To add some further color to the performance.\nThe 10% increase in Search and other revenues was led by financial services\nprimarily due to strength in insurance followed by retail. YouTube saw a\nsimilar performance across verticals. It's 10% growth in advertising\nrevenues was driven by direct response followed by brand.\n\n\nSo let's start with Search, where we've seen robust growth in revenues. All\naround the world, over 2 billion people use Search every day to find\ninformation, compare products or shop. And there are more than 5 trillion\nsearches on Google annually. We've continued our efforts to help more\npeople ask entirely new questions, bringing more opportunities for\nbusinesses to connect with consumers. And as we've mentioned before, with\nthe launch of AI Overviews, the volume of commercial queries has increased.\n\n\n\nQ1 marked our largest expansion to date for AI Overviews, both in terms of\nlaunching to new users and providing responses for more questions. The\nfeature is now available in more than 15 languages across 140 countries.\nFor AI Overviews, overall, we continue to see monetization at approximately\nthe same rate, which gives us a strong base in which we can innovate even\nmore.\n\n\nTurning to visual queries. On the last earnings call, I mentioned the\nsuccess we're seeing with Lens, where shoppers use their camera or images\nto quickly find information in ways they couldn't before. In Q1, the number\nof people shopping on Lens grew by over 10%, and the majority of Lens\nqueries are incremental. Sundar mentioned the significant growth we're also\nseeing with Circle to Search as multi-modality continues to drive queries\nacross Search.\n\n\nMoving to Ads. More businesses, big and small, are adopting AI-powered\ncampaigns, and the deployment of AI across our Ads business is driving\nresults for our customers and for our business. Throughout 2024, we\nlaunched several features that leverage LLMs to enhance advertiser value,\nand we're seeing this work pay off. The combination of these launches now\nallows us to match ads to more relevant search queries. And this helps\nadvertisers reach customers and searches where we would not previously have\nshown their ads.\n\n\nFocusing on our customers, we continue to solve advertisers' pain points\nand find opportunities to help them create, distribute and measure more\nperformant ads, infusing AI at every step of the marketing process. On\nAudience Insights, we released new asset audience recommendations, which\ntell businesses the themes that resonate most with their top audiences. On\ncreatives, advertisers can now generate a broader variety of lifestyle\nimagery customized to their business to better engage their customers and\nuse them across PMax, demand gen, display and app campaigns. Additionally,\nin PMax, advertisers can automatically source images from their landing\npages and crop them, increasing the variety of their assets.\n\n\nOn media buying, advertisers continue to see how AI-powered campaigns help\nthem find new customers. In demand gen, advertisers can more precisely\nmanage ad placements across YouTube, Gmail, Discover and Google Display\nNetwork globally and understand which assets work best at a channel level.\nThanks to dozens of AI-powered improvements launched in 2024, businesses\nusing demand gen now see an average 26% year-on-year increase in\nconversions per dollar spend for goals like purchases and leads. And when\nusing demand gen with product feed, on average, they see more than double\nthe conversion per dollar spend year-over-year.\n\n\nAs an example, Royal Canin combined demand gen and PMax campaigns to find\nmore customers for its cat and dog food products. The integration resulted\nin a 2.7x higher conversion rate, a 70% lower cost per acquisition for\npurchases and increased the value per user by 8%.\n\n\nTurning to YouTube, where we saw strong growth in revenues across ads and\nsubscriptions. This week, we're celebrating YouTube's 20th anniversary.\nWe're proud of its leadership as a streaming destination where people come\nto watch everything they love from live sports and creator-produced content\nto shorts and podcasts. Creators are what drives viewership. And on\naverage, they upload 20 million videos a day to YouTube.\n\n\nOur biggest creators generate a level of fandom and viewer engagement\naround large cultural moments on YouTube that brands can't find anywhere\nelse. During March Madness, brands aligned not only with clips and\nhighlights from the game, but also with the creators who drive basketball\nculture like Jesser and The Ringer's J. Kyle Mann.\n\n\nIn Q1, the growth of our reservation-based ads business more than doubled\nyear-over-year. Brands and creators continue to use the opportunities that\ncollaborations and partnerships offer. Toyota worked with Zach King, the\nking of short magical videos with over 42 million followers to take over\nhis channel. The creator takeover and accompanying creator ad lifted\nToyota's brand awareness by 25% compared to a control group and 9% compared\nto the Toyota brand ad.\n\n\nLooking at shorts, engaged views grew by over 20% in the first quarter. We\ncontinue to be pleased with the progress we're making globally in shorts\nmonetization relative to in-stream viewing and are particularly encouraged\nby the trend in the U.S.\n\n\nAs always, I'll wrap up with the strong momentum we're seeing in\npartnerships where customers increasingly recognize the strength and\nbreadth of what Google has to offer. For instance, Roblox is partnering\nwith Google Ad Manager to bring immersive ads to gamers. Gen Z gamers are\nRoblox' biggest users. And thanks to our partnership, advertisers will be\nable to reach this audience with ads that blend seamlessly into the gaming\nexperience. We also launched a YouTube shorts effect to help people release\niconic Roblox heads and inspire fans to create content at scale.\n\n\nIn closing, I'd like to thank Googlers everywhere for their contributions\nand commitment to our success and to our customers and partners for their\ncontinued trust.\n\n\nAnat, over to you.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nThank you, Philipp. My comments will focus on year-over-year comparisons\nfor the first quarter, unless I state otherwise. I will start with results\nat the Alphabet level and will then cover our segment results. I'll end\nwith some commentary on our outlook for the second quarter and 2025.\n\n\nWe had another strong quarter in Q1. Consolidated revenues of $90.2 billion\nincreased by 12% or 14% in constant currency. Search and YouTube\nadvertising, subscription platforms and devices and Google Cloud each had\ndouble-digit revenue growth this quarter, reflecting strong momentum across\nthe business. Total cost of revenue was $36.4 billion, up 8%. Tech was\n$13.7 billion, up 6%. We continue to see a revenue mix shift with Google\nSearch growth at double-digit levels, while network revenues, which have\nmuch higher TAC rate, declined. Other cost of revenue was $22.6 billion, up\n9%, with the increase primarily driven by content acquisition costs largely\nfor YouTube, followed by depreciation and other technical infrastructure\noperations costs.\n\n\nTotal operating expenses increased 9% to $23.3 billion. R&D investments\nincreased by 14% primarily driven by increases in compensation and\ndepreciation expenses. Sales and marketing expenses decreased 4% primarily\nreflecting a decline in compensation expenses. G&A expenses increased by\n17%, reflecting the impact of charges for legal and other matters.\n\n\nOperating income increased 20% this quarter to $31 billion, and operating\nmargin increased to 33.9%, representing 2.3 points of margin expansion.\nOperating margin benefited from healthy revenue growth, a moderated pace of\ncompensation growth and a favorable mix shift towards lower TAC advertising\nrevenues, partially offset by year-on-year increase in depreciation\nexpenses of just over $1 billion.\n\n\nOther income and expenses was $11.2 billion, primarily due to unrealized\ngain on our nonmarketable equity securities related to our investment in a\nprivate company, which we noted in our 10-K is a subsequent event. Net\nincome increased 46% to $34.5 billion, and earnings per share increased 49%\nto $2.81. We delivered free cash flow of $19 billion in the first quarter\nand $74.9 billion for the trailing 12 months. We ended the quarter with $95\nbillion in cash and marketable securities.\n\n\nTurning to segment results. Google Services revenues increased 10% to $77.3\nbillion, reflecting strength in Google Search and YouTube advertising as\nsubscription. Google Search and other advertising revenues increased by 10%\nto $50.7 billion. The robust performance of Search was once again broad-\nbased across verticals led by financial services due primarily to strength\nin insurance followed by retail.\n\n\nYouTube advertising revenues increased 10% to $8.9 billion driven by direct\nresponse advertising followed by brand. Network advertising of $7.3 billion\nwere down 2%. Subscription platforms and device revenues increased 19% to\n$10.4 billion primarily reflecting growth in subscription revenues. This\ngrowth was primarily driven by YouTube subscription offerings followed by\nGoogle One, with growth in the number of subscribers being the biggest\ndriver of revenue growth. Google Services operating income increased 17% to\n$32.7 billion and operating margin increased from 39.6% to 42.3%.\n\n\nTurning to the Google Cloud segment, which continued to deliver very strong\nresults this quarter. Revenue increased by 28% to $12.3 billion in the\nfirst quarter reflecting growth in GCP across core and AI products at a\nrate that was much higher than Cloud's overall revenue growth rate. Growth\nin Google Workspace was primarily driven by an increase in average revenue\nper seat.\n\n\nGoogle Cloud operating income increased to $2.2 billion and operating\nmargin increased from 9.4% to 17.8%. As we scale our fleet, we continue to\nfocus on driving improvements in productivity, efficiency and utilization\nto offset the growth in expenses, particularly from higher depreciation.\n\n\nAs to our Other Bets, for the first quarter, revenues were $450 million,\nand operating loss was $1.2 billion. The year-on-year decline in revenue\nand increase in operating loss primarily reflect the milestone payment\nreceived in the first quarter of 2024 for one of our Other Bets.\n\n\nWith respect to CapEx, our reported CapEx in the first quarter was $17.2\nbillion, primarily reflecting investment in our technical infrastructure\nwith the largest component being investment in servers, followed by data\ncenters to support the growth of our business across Google Services,\nGoogle Cloud and Google DeepMind. In Q1, we returned value to shareholders\nin the form of $15.1 billion in share repurchases and $2.4 billion in\ndividend payments. As we announced today, our Board of Directors declared a\n5% increase in our quarterly dividend and also approved and used $70\nbillion share repurchase authorization.\n\n\nTurning to our outlook. I would like to provide some commentary on several\nfactors that will impact our business performance in the second quarter and\nthe remainder of 2025. First, in terms of revenue, I'll highlight a couple\nof items that we mentioned last quarter that will have an impact on second\nquarter and 2025 revenue. First, in Google Services, advertising revenue in\n2025 will be impacted by lapping the strength we experienced in the\nfinancial service vertical throughout 2024.\n\n\nSecond, in Cloud, we're in a tight demand-supply environment. And given\nthat revenues are correlated with the timing of deployment of new capacity,\nwe could see variability in cloud revenue growth rates depending on\ncapacity deployment each quarter. We expect relatively higher capacity\ndeployment towards the end of 2025.\n\n\nMoving to investments, starting with our expectation for CapEx for the full\nyear 2025. We still expect to invest approximately $75 billion in CapEx\nthis year. The expected CapEx investment level may fluctuate from quarter-\nto-quarter due to the impact of changes in the timing of deliveries and\nconstruction schedules.\n\n\nIn terms of expenses, first, as I mentioned on our previous earnings call,\nthe significant increase in our investments in CapEx over the past few\nyears will continue to put pressure on the P&L, primarily in the form of\nhigher depreciation. In the first quarter, we saw 31% year-on-year growth\nin depreciation from the increase in technical infrastructure assets placed\nin service. Given the increase in CapEx investments over the past few\nyears, we expect the growth rate in depreciation to accelerate throughout\n2025.\n\n\nSecond, as we've previously said, we expect some headcount growth in 2025\nin key investment area. As we've disclosed previously, due to a shift in\nthe timing of our annual employee stock-based compensation award beginning\nin 2023, our first quarter stock-based comp expenses is relatively lower\ncompared to the remaining quarters of the year.\n\n\nIn conclusion, as you heard from Sundar and Philipp, we're pleased with the\nprogress we're making across the organization, the results for the quarter\nand the opportunities ahead. Our success as a company is grounded in our\nexperience driving advancements in deep computer science that enables us to\ncreate innovative new products and services for users, businesses and\npartners around the world. We have a strong track record of incubating and\nthen building these offerings into new profitable businesses for Alphabet.\n\n\nAs we announced last quarter, YouTube and Cloud exited 2024 at a combined\nannual run rate of $110 billion. And as you heard from Sundar earlier,\nWaymo has continued to progress in building on its impressive technological\nachievements to scale rapidly and develop a sustainable business model.\nThank you.\nSundar, Philipp and I will now take your questions.\n\n\nQuestion and Answer\n\n\nOperator\n\n[Operator Instructions] And our first question comes from Brian Nowak from\nMorgan Stanley.\n\n\nBrian Thomas Nowak\nMorgan Stanley, Research Division\n\nI have 2. The first one on sort of the macro advertising backdrop, maybe,\nAnat, I know it's April 24, and you called out some factors as you're kind\nof thinking about the second quarter. Any other factors you're seeing in\nadvertising verticals or regions or categories that could be showing any\nsigns of weakness quarter-to-date, so we should think through any other\nchanges from typical seasonality in 2Q '25 versus prior quarters?\n\n\nThen the second one, on Philipp, I think I heard you mention how the volume\nof commercial queries has increased. Maybe can you just walk us through\nwhich of the products are driving that increase in commercial queries? And\nas you sort of think about the pipeline of Search products, are there any\nothers that you're particularly excited about to kind of continue to drive\nfurther commercial query growth throughout '25, '26?\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nSo let me take the first one as well. We saw broad-based strength across ad\nverticals in Q1, and we saw it -- give you a bit of vertical color here.\nSearch was led, again, by finance, due primarily to ongoing strength in the\ninsurance. Retail, health care and travel were actually also sizable\ncontributors here to growth.\n\n\nWith regard to Q2, we're only a few weeks in, so it's really too early to\ncomment. I mean we're obviously not immune to the macro environment. But we\nwouldn't want to speculate about potential impacts beyond noting that the\nchanges to the de minimis exemption will obviously cause a slight headwind\nto our ads business in 2025 primarily from APAC-based retailers. And maybe\nto zoom out, I would say we have a lot of experience in managing through\nuncertain times, and we focus on helping our customers by providing deep\ninsights into changing consumer behavior that is relevant to their\nbusiness. Examples are auction dynamics, query trend insights on topics\nlike replacement purchases and so on. So we have a lot of experience in\nthis area.\n\n\nOn the commercial query side, look, AI Overviews continue to drive higher\nsatisfaction and search usage. And as I noticed, Q1 was really our largest\nexpansion to date for AI Overviews, both in terms of launching to new users\nand providing responses for more questions. And that's really the core\nalready of the answer. AI Overviews sits at the center of your question\nhere. And when it comes to other products, look, I don't want to speculate\non this, but we're happy with what we're seeing here on AI Overviews, and\nI'm confident we can expand this to more products over time.\n\n\nOperator\n\nYour next question is from Doug Anmuth from JPMorgan.\n\n\nDouglas Till Anmuth\nJPMorgan Chase & Co, Research Division\n\nPhilipp, maybe just to go back to AI Overviews for a moment. Can you just\ntell us how we should think about the 1.5 billion AI Overviews users just\nin terms of breadth of rollout? And I know you're saying monetization at\napproximately the same rate. But what does that mean in terms of click-\nthrough rates and conversion?\n\n\nAnd then Anat, just curious if there have been any changes to Google's\napproach to durably reengineering the cost base since you've joined? And if\nmacro weakens and you see more of a slowdown, would you expect to find\nadditional opportunities to cut back more on costs?\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nYes. Look, on the ads of -- in AI Overviews, last -- late last year,\nactually, we launched them within the AI Overviews on mobile in the U.S.\nAnd this builds on our previous rollout of ads above and below. So this was\na change that we have. But as I talked about it before, for AI Overviews\noverall, we see the monetization at approximately the same rate, which\ngives us a strong base on which we can innovate even more. So I'm very\nhappy with this. I don't think this is the moment to go into the details of\nclick-through rates and conversion and so on. But overall, we're happy with\nwhat we're seeing.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd to your question on our approach to productivity and efficiency, it\nhasn't really changed. I've mentioned my approach and our approach as a\ncompany on -- at the end of 2024. And we're still focused on driving\nefficiency and productivity throughout the organization, both in our\noperating expenses and in our CapEx. I've mentioned some of these on my --\nduring my prepared remarks.\n\n\nBut certainly, this helps us, as we think about the investments we need to\nmake in innovation, to drive long-term sustainable growth profile for the\ncompany. We're able to repurpose some of these efficiencies into these\ninvestments as well as, as you think about the increase in CapEx we've seen\nover the past several years and what we're investing this year, this will\nput additional pressure on the income statement in the form of\ndepreciation. So we're working hard to try and offset some of the\nheadwinds.\n\n\nAs well as within the CapEx investments themselves, $75 billion, we're\nlooking at how do we make sure every dollar is used efficiently. We have a\nhighly rigorous process to determine the demand behind it and then the\nallocation of the compute associated with our technical infrastructure\ninvestments, ensuring that we're utilizing that appropriately and that\nwe're highly efficient with everything we're doing. You've seen some of the\nannouncement and some of the changes, but we're focusing on continuing to\nmoderate the pace of compensation growth, looking at our real estate\nfootprint and again, the build-out and utilization of our technical\ninfrastructure across the business.\n\n\nOperator\n\nOur next question comes from Eric Sheridan from Goldman Sachs.\n\n\nEric James Sheridan\nGoldman Sachs Group, Inc., Research Division\n\nFirst, maybe for Sundar. When you look across the consumer AI landscape\ntoday, how are you thinking about continuing to drive differentiation for\nGemini as a platform through the lens of usage, utility or putting product\ninnovation at the forefront of driving consumer habits?\n\n\nAnd then the second one, maybe for Anat, if the macro environment were to\nchange and become more downwardly volatile, how should investors think\nabout the investments that are must make this year, almost fixed in nature\nversus where there might be more flexibility to alter the investment\npriorities of the company if the macro environment were to worsen?\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Eric. Obviously, it's an exciting moment on the AI front. I think\nthe foundation for everything is obviously the Frontier model progress we\nare seeing. And particularly with 2.5 Pro and Flash, I think we're well\npositioned. We are seeing tremendous reception from developers, enterprises\nand consumers, too.\n\n\nAnd obviously, we are delivering consumer AI experiences across our product\nportfolio, including the primary way people experience it is obviously in\nSearch with AI Overviews. And very early days with AI Mode, but that will\nbe a consumer AI-forward experience. And we're already seeing very positive\nfeedback. Queries are -- people are typing in roughly 2x longer queries\ncompared to a traditional search. So there's a lot of excitement there.\n\n\nAnd in the Gemini app, which you asked about, we've really seen increased\nmomentum, particularly over the last few weeks as we've rolled out not just\nthe newer models, but we are seeing users are really responding well to all\nthe innovation. Gemini Live, which is based on Project Astra, has been very\nwell received. Deep Research, I think, based on 2.5 Pro, is -- that's being\nwell received. And Canvas, we've had a lot of traction as well. And so we\nare definitely investing more. We have recently organized ourselves better\nto capitalize on this momentum, and I'm excited about our road map there.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd on the investments this year and overall, should there be any\nmacroeconomic changes, as I said, we're still planning to invest\napproximately $75 billion in CapEx this year. We do see a tremendous\nopportunity ahead of us across the organization, whether it's to support\nGoogle Services, Google Cloud and Google DeepMind. Recall I've stated on\nthe Q4 call that we exited the year in Cloud specifically with more\ncustomer demand than we had capacity. And that was the case this quarter as\nwell. So we want to make sure we ramp up to support customer needs and\ncustomer demands.\n\n\nHaving said that, we're investing in long term, and we're investing in\ninnovation. That's the essence of our business. And we want to do it in a\nresponsible fashion. So you've seen us over the past couple of years, and\nwe're continuing to do this, and you're seeing this in our results, drive\nefficiency and productivity throughout the business. And we've announced\nthings such as consolidation of teams, which helps not just with cost, but\nwith velocity and speed. We're able to get things to market faster.\n\n\nSo that's one of the areas we're focused on. You heard from Sundar in the\nlast couple of calls on just the rapid pace of innovation we're bringing to\nthe marketplace. So the way we're doing this across the business to drive\nproductivity and efficiency should help us have a more resilient\norganization irrespective of macroeconomic condition. But certainly, we\ndon't ignore that. We always look at what's happening outside the\norganization as well as inside, but invest appropriately to drive both the\nshort-term growth as well as the long-term growth.\n\n\nOperator\n\nOur next question comes from Ross Sandler from Barclays.\n\n\nRoss Adam Sandler\nBarclays Bank PLC, Research Division\n\nOne for Sundar, one for Philipp. Sundar, it was disclosed this week in the\ntrial that's going on that Gemini has 35 million DAUs. And just curious,\nthat number obviously trails ChatGPT by a pretty wide margin. Could you\ntalk about the strategy to get that DAU figure much higher that you guys\nare deploying?\n\n\nAnd then Philipp, just curious to hear what you're seeing on the brand\nadvertising side at YouTube in 1Q and into early 2Q. Are brands holding up\nrelatively well, like direct response? Or are they starting to react to\nsome of these macro jitters that we're all experiencing? Any thoughts\nthere?\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Ross. I think I touched upon this to Eric's question as well, but\nwe are definitely -- I think there's been a lot of momentum in terms of\nproduct features we've been introducing. And we are definitely seeing\nreception, including increased adoption and usage based on those features.\nSo I think we are in a good positive cycle. The recent advances on the\nmodel Frontier, by many metrics, I think we have the best model out there\nnow. And I think that's going to drive increased adoption as well.\n\n\nAnd again, I would reiterate, people are using -- obviously, we have 1.5\nbillion users through AI Overviews interacting with AI in a deep way in a\nvery engaged way. Obviously, we are innovating with AI Mode. And we have a\nvery exciting road map ahead with the Gemini app as well. So across the\nboard, super excited about what's ahead.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nAnd on your brand question, look, brand and, by the way, also direct\nresponse had a very solid growth in Q1. Brand advertisers really enjoyed\nculture moments we had like Coachella, for example, or March Madness. We\nhad strong contributions overall from the finance and retail verticals in\nQ1 on this side as well. The operating metrics for YouTube were strong in\nQ1. Watch time growth remains robust, particularly in key monetization\nopportunity areas such as shorts and living room. It's also, by the way,\nnice to see the strong position of our creators who obviously benefit from\nthe brand piece, which gives us a lot of confidence when we look at it more\nclosely. And on the Q2 side, I think I mentioned it's too early to really\ncomment on that.\n\n\nOperator\n\nYour next question is from Mark Shmulik from Bernstein.\n\n\nMark Elliott Shmulik\nSanford C. Bernstein & Co., LLC., Research Division\n\nSundar, I appreciate the color on Gemini deployment across kind of the 15\nproducts with 0.5 billion users or more. It would be great to hear more\nabout where you're seeing the most usage and deployment of gen AI\ninternally at Google, perhaps whether the capabilities -- are they in a\nplace today in terms of either supplementing or augmenting the workforce?\nAnd then just to build on that earlier AI Mode-type questions. Appreciate\nAI Mode has 2x longer queries than traditional search, but any color you\ncan share perhaps on how AI Mode behavior differs from how consumers are\nusing the Gemini app?\n\n\nSundar  Pichai\nCEO & Director\n\nLook, internally, I mean, this has been an extraordinary amount of focus\nand excitement both because I think we are -- the early use cases have been\ntransformative in nature and I think this still feels like early days and\nlong ways to go. Obviously, I had mentioned a few months ago in terms of\nhow we are using AI for coding. We're continuing to make a lot of progress\nthere in terms of people using coding suggestions. I think the last time I\nhad said, the number was like 25% of code that's checked in. It involves\npeople accepting AI-suggested solutions. That number is well over 30% now.\nBut more importantly, we have deployed more deeper flows. And particularly\nwith the newer models, I think we are working on early agentic workflows\nand how we can get those coding experiences to be much deeper.\n\n\nWe are deploying it across all parts of the company. Our customer service\nteams are deeply leading the way there. We've both dramatically enhanced\nour user experience as well as made it much more efficient to do so. And we\nare actually bringing all our learnings and expertise in our solutions\nthrough cloud to our other customers. But beyond that, all the way from the\nfinance team preparing for this earnings call to everything, it's deeply\nembedded in everything we do. But I still see it as early days, and there's\ngoing to be a lot more to do.\n\n\nOn AI Mode, look, I think we are just leaning in on the early positive\nfeedback -- well, as we scaled up AI Overviews. It's been one of our most\npositive launches. And -- but it's been clear people have wanted even more\nof it. And so with AI Mode, we are bringing the -- our state-of-the-art\nGemini models right into Search.\n\n\nAnd I mentioned people typing in longer queries. There's a lot more\ncomplex, nuanced questions. People are following through more. People are\nappreciating the clean design, the fast response time and the fact that\nthey can kind of be much more open-ended, can undertake more complicated\ntasks. Product comparisons, for example, has been a positive one, exploring\nhow tos, planning a trip. So those are the kinds of early feedback we are\nseeing. And I think we are obviously really focused on improving the\nproduct across all of AI Mode, AI Overviews and the Gemini app, and we are\nseeing positive user traction as well.\n\n\nOperator\n\nYour next question is from Mark Mahaney from Evercore.\n\n\nMark Stephen F. Mahaney\nEvercore ISI Institutional Equities, Research Division\n\nOne for Anat and one for Sundar. Anat, getting back to a question, I think,\nthat Doug was asking earlier. You just put up record-high or multiyear\nrecord-high margins for both Google Services and for Google Cloud. You\ntalked, though, about depreciation expenses accelerating rapidly throughout\nthe year because of all the investments you've already -- you'd warned\npeople about. Back in the September quarter, you seem relatively confident\nthat you had enough levers to kind of offset kind of rising infrastructure\ncosts. Was that still your -- 6 months later, is that still your view that\nyou've got enough levers that even with the rising infrastructure costs,\nyou can -- there's enough in there to kind of counterbalance that?\n\n\nAnd then just briefly on Waymo, continues to rise aggressively the numbers,\nSundar. The long-term business model for Waymo, is there a reason to make a\ndecision on that soon? Or have you already made the decision of whether\nthis is a long-term licensing model or you really want to run this as a\nstand-alone ride-sharing, delivery, autonomous vehicle business?\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nThanks. On your first question on profitability and what levers do we have\nand do we still have levers to pull, first, I think every organization can\nalways push a little further. I don't view productivity goals or efficiency\nas an episodic, kind of project-based effort, but rather a continuous\neffort that when you get to a certain place, you push a little further.\n\n\nHaving said that, we do have significant investments we're making across\nthe organization, and we have been making them for the past several\nquarters. And we've been able to do it because we were able to find\nefficiency to fund those investments across the organization. Those are for\nproducts and services that are going to drive long-term growth for the\ncompany.\n\n\nSo while we're trying to offset as much of the headwind associated with the\nincrease in infrastructure costs, it will become more difficult. As I said,\nthe depreciation will accelerate. We had about a 31% year-over-year growth\nin depreciation this quarter. And it will be higher as we go throughout the\nyear. So think about that kind of as a headwind that we have to manage\nagainst, but we're continuing with pushing across the organization,\nleveraging, Sundar mentioned, the use of AI and kind of an AI-first Google\nacross several of our functions to help us manage a larger scope of work\nusing our AI, AI agents and AI tools. As Sundar mentioned, we did leverage\nit in preparation for the earnings call and we're leveraging it across\nseveral functions.\n\n\nSo there are opportunities, but there are also great opportunities for\ninvestment, and we want to make sure that we make room for -- to make these\ninvestments to drive long-term growth and ensure we have a very resilient,\nlong-term growth profile for the company.\n\n\nSundar  Pichai\nCEO & Director\n\nAnd Mark, thanks. I think this is probably the first question I've got on\nan earnings call on Waymo. So thank you, and I think it's a sign of its\nprogress. Look, the thing that excites me is I think we've been laser\nfocused and will continue to be on building the world's best driver. And I\nthink doing that well really gives you a variety of optionality in business\nmodels across geographies, et cetera.\n\n\nIt'll also require a successful ecosystem of partners, and we can't\npossibly do it all ourselves. And so I'm excited about the progress the\nteams have made through a variety of partnerships. Obviously, a highlight\nof it is our partnership with Uber. We are very pleased with what we are\nalready seeing in Austin in terms of rider satisfaction. We look forward to\noffering the first paid rides in Atlanta via Uber later this year.\n\n\nBut we are also building up a network of partners, for example, for\nmaintaining fleets of vehicles and doing all the operations related to that\nwith the recently announced partnership with Moove in Phoenix and Miami,\nobviously, partnerships with OEMs. There are future optionality around\npersonal ownership as well. So we are widely exploring and -- but at the\nsame time, clearly staying focused on making progress both in terms of\nsafety, the driver experience and progress on the business model and\noperationally scaling it up.\n\n\nOperator\n\nOur next question comes from Ken Gawrelski from Wells Fargo.\n\n\nKenneth James Gawrelski\nWells Fargo Securities, LLC, Research Division\n\nTwo, if I may, please. First, on AI-powered search. You have a number of AI-\npowered search interfaces, including 3 most prominently, AI Overviews, AI\nMode and Gemini. In the future, should we think of these as distinct\nexperiences that will be long-lasting or more experimental now and will --\nand Google will eventually focus on one approach going forward?\n\n\nAnd the second one is more on the financial side. You continue to\nexperience very healthy gross margin expansion. We see the TAC, sure, but\nyou -- Anat, you also talked about the offsetting depreciation expense.\nCould you talk about beyond those 2 buckets where you're seeing the real\nsavings on the COGS line and driving that gross margin expansion and maybe\neven how we should be thinking about that going forward?\n\n\nSundar  Pichai\nCEO & Director\n\nOkay. Now maybe on AI-powered search and how do we see our consumer\nexperience. Look, I do think Search and Gemini, obviously, will be 2\ndistinct efforts, right? I think there are obviously some areas of overlap,\nbut they're also -- like expose very, very different use cases. And so for\nexample, in Gemini, we see people iteratively coding and going much deeper\non a coding workflow, as an example. So I think both will be around.\n\n\nWithin Search, I would think of AI Overviews is scaling up and working for\nour entire user base, but an AI Mode is the tip of the tree for us pushing\nforward on an AI-forward experience. There will be things which we discover\nthere, which will make sense in the context of AI Overviews, so I think\nwill flow through to our user base. But you almost want to think of what\nare the most advanced 1 million people using Search for, the most advanced\n10 million people and then how do 1.5 billion people use Search for. And we\nwant to innovate. And so I think this allows us to do that. But the true\nnorth through all of this is user feedback, user satisfaction, user\nexperience. And so that will determine where this all works out in the\nfuture.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd to your question on gross margin, a couple of trends to highlight\nthere. And I've mentioned this in the prepared remarks, you've seen\nimprovement in TAC that's really driven by the change in revenue mix with a\ncontinued Search growth and then network revenue declines. Network revenue\nhas a much higher TAC rate. So that mix is helping us from a gross margin\nperspective. So think about that as well.\n\n\nNow we do have depreciation for technical infrastructure hits in 2 --\nprimarily in 2 places in the income statement, one is in other cost of\nsales and the rest is in R&D. So it is in that line item that's impacting\ncost of sales. Now we've had some efficiencies there, and I did mention the\nimprovement in our overall cost of -- headcount growth and compensation\nkind of moderating those growth. So that helps us as well more than offset\nthe depreciation increases in Q1. But as I mentioned, this number will be\nhigher in the coming quarters. Recall, we have -- we said approximately $75\nbillion in CapEx, which is up from $55 billion or just over $50 billion\nlast year. So there is expected to be quite a significant increase in\ndepreciation.\n\n\nOperator\n\nAnd our last question comes from Ron Josey from Citi.\n\n\nRonald Victor Josey\nCitigroup Inc., Research Division\n\nPhilipp, I wanted to touch a little bit more on your comments around direct\nresponse in YouTube. I think it's been improving and been a driver over the\npast couple of quarters. I'd love to hear more just about what's driving\nthat. Is that the demand gen and integration with PMax? Or are users\nperhaps more involved on direct response now that shorts usage is rising?\nWould love your thoughts there.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nYes. I think there's a lot of different factors. Mostly, we continue to\nhelp our customers really using our AI-powered tools, you mentioned a few\nof them, to drive performance. That's a very big one. As I mentioned\nbefore, we're also happy with the progress we're seeing on shorts and\nclosing the monetization gap here to the overall business, which is\nactually really nice to see, especially in the U.S. So we're very happy\nwith that. Yes.\n\n\nSundar  Pichai\nCEO & Director\n\nAnd I'll just chime in to say, YouTube just celebrated its 20th birthday.\nAnd we now have more than 20 billion videos on YouTube, and we get 20\nmillion videos uploaded every day. So I think it's a tremendous platform.\nAnd thanks to all the creators and users who have supported us there over\nthe years.\n\n\nOperator\n\nAnd that concludes our question-and-answer session for today. I would like\nto turn the conference back over to Jim Friedland for any further remarks.\n\n\nJames Friedland\n\nThanks, everyone, for joining us today. We look forward to speaking with\nyou again on our second quarter 2025 call. Thank you, and have a good\nevening.\n\n\nOperatorThank you, everyone. This concludes today's conference call. Thank\nyou for participating. You may now disconnect.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.\n\n",
  "presentation_text": "Operator\n\nWelcome, everyone. Thank you for standing by for the Alphabet First Quarter\n2025 Earnings Conference Call. [Operator Instructions]\n\n\nI would now like to hand the conference over to your speaker today, Jim\nFriedland, Senior Director of Investor Relations. Please go ahead.\n\n\nJames Friedland\n\nThank you. Good afternoon, everyone, and welcome to Alphabet's First\nQuarter 2025 Earnings Conference Call. With us today are Sundar Pichai,\nPhilipp Schindler and Anat Ashkenazi.\n\n\nNow I'll quickly cover the safe harbor. Some of the statements that we make\ntoday regarding our business, operations and financial performance may be\nconsidered forward-looking. Such statements are based on current\nexpectations and assumptions that are subject to a number of risks and\nuncertainties. Actual results could differ materially. Please refer to our\nForms 10-K and 10-Q, including the risk factors. We undertake no obligation\nto update any forward-looking statement.\n\n\nDuring this call, we will present both GAAP and non-GAAP financial\nmeasures. A reconciliation of non-GAAP to GAAP measures is included in\ntoday's earnings press release, which is distributed and available to the\npublic through our Investor Relations website located at abc.xyz/investor.\nOur comments will be on year-over-year comparisons unless we state\notherwise.\n\n\nAnd now I'll turn the call over to Sundar.\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Jim. Good afternoon, everyone. We are pleased with our strong\nresults this quarter. We continue to see healthy growth and momentum across\nthe business, including AI powering new features.\n\n\nIn Search, we saw continued double-digit revenue growth. AI Overviews is\ngoing very well with over 1.5 billion users per month, and we are excited\nby the early positive reaction to AI Mode. There's a lot more to come\nahead.\n\n\nIn subscriptions, we surpassed 270 million [ subscriptions ] with YouTube\nand Google One as key drivers. And Cloud grew rapidly with significant\ndemand for our solutions, and you saw our leadership in AI at Cloud Next\nacross infrastructure, agents and more.\n\n\nOur differentiated full stack approach to AI continues to be central to our\ngrowth. This quarter was super exciting as we rolled out Gemini 2.5, our\nmost intelligent AI model, which is achieving breakthroughs in performance,\nand it's widely recognized as the best model in the industry. That's an\nextraordinary foundation for our future innovation, and we are focused on\nbringing this to people and customers everywhere.\n\n\nLooking ahead to I/O, Brandcast and Google Marketing Live, I can't wait for\nour teams to showcase the innovations they've been working on.\n\n\nTurning to our AI progress this quarter, which continues to enable\nsignificant growth opportunities. The elements of the AI stack I've\npreviously mentioned are AI infrastructure; world-class research, including\nmodels and tooling; and our products and platforms.\n\n\nStarting with AI infrastructure, our long-term investments in our global\nnetwork have positioned us well. Google's network is robust and resilient,\nsupported by over 2 million miles of fiber and 33 subsea cables.\nComplementing this, we offer the industry's widest range of TPUs and GPUs\nand continue to invest in next-generation capabilities.\n\n\nIronwood, our seventh-generation TPU and most powerful to date, is the\nfirst designed specifically for inference at scale. It delivers more than\n10x improvement in compute power or a recent high-performance TPU while\nbeing nearly twice as power efficient. Our strong relationship with NVIDIA\ncontinues to be a key advantage for us and our customers. We were the first\ncloud provider to offer NVIDIA's groundbreaking B200 and GB200 Blackwell\nGPUs, and we'll be offering their next-generation Vera Rubin GPUs.\n\n\nSecond, this infrastructure powers our world-class research, including our\nindustry-leading models. We released Gemini 2.5 Pro last month, receiving\nextremely positive feedback from both developers and consumers. 2.5 Pro is\nstate-of-the-art on a wide range of benchmarks and debuted at #1 on the\nchatbot arena by a significant margin. 2.5 Pro achieved big leaps in\nreasoning, coding, science and math capabilities, opening up new\npossibilities for developers and customers. Active users in AI studio and\nGemini API have grown over 200% since the beginning of the year.\n\n\nAnd last week, we introduced 2.5 Flash, which enables developers to\noptimize quality and cost. Our latest image and video generation models,\nImagen 3 and Veo 2, are rolling out broadly and are powering incredible\ncreativity.\n\n\nTurning to open models. We launched Gemma 3 last month, delivering state-of-\nthe-art performance for its size. Gemma models have been downloaded more\nthan 140 million times.\n\n\nLastly, we are developing AI models in new areas where there's enormous\nopportunity, for example, our new Gemini Robotics models. And in health, we\nlaunched AI co-scientist, a multi-agent AI research system, while AlphaFold\nhas now been used by over 2.5 million researchers.\n\n\nThird, turning to products and platforms. All 15 of our products with 0.5\nbillion users now use Gemini models. Android and Pixel are 2 examples of\nhow we are putting the best AI in people's hands, making it super easy to\nuse AI for a wide range of tasks, just by using their camera, voice or\ntaking a screen shot.\n\n\nWe are upgrading Google Assistant on mobile devices to Gemini. And later\nthis year, we'll upgrade tablets, cars and devices that connect to your\nphones such as headphones and watches. The Pixel 9a launched very strong\nreviews, providing the best of Google's AI offerings like Gemini Live and\nAI-powered camera features. And Gemini Live camera and screen sharing is\nnow rolling out to all Android devices, including Pixel and Samsung S25.\n\n\nNow moving on to key highlights from across Search, Cloud, YouTube and\nWaymo. First, Search. AI is one of the most revolutionary technologies for\nenabling and expanding our information mission. And for Search, we see it\ngrowing the number and types of questions we can answer. We are already\nseeing this with AI Overviews, which now has more than 1.5 billion users\nevery month. Nearly a year after we launched AI Overviews in the U.S., we\ncontinue to see that usage growth is increasing as people learn that Search\nis more useful for more of their queries. So we are leaning in heavily\nhere, continuing to roll the feature out in new countries to more users and\nto more queries.\n\n\nBuilding on the positive feedback for AI Overviews, in March, we released\nAI Mode, an experiment in labs. It expands what AI Overviews can do with\nmore advanced reasoning, thinking and multimodal capabilities to help with\nquestions that need further exploration and comparisons. On average, AI\nMode queries are twice as long as traditional search queries. We're getting\nreally positive feedback from early users about its design, fast response\ntime and ability to understand complex, nuanced questions.\n\n\nWe also continue to see significant growth in multimodal queries. Circle to\nSearch is now available on more than 250 million devices with usage\nincreasing nearly 40% this quarter. And monthly visual searches with Lens\nhave increased by 5 billion since October.\n\n\nMoving on to Cloud. At Cloud Next, we announced major innovations, and over\n500 companies shared the business results they are achieving by working\nwith us. We provide leading cost, performance and reliability for AI\ntraining and inference. This enables us to deliver the best value for AI\nleaders, like Anyscale and Contextual AI, as well as global brands like\nVerizon. And for highly sensitive data and regulatory requirements, Google-\ndistributed Cloud and our sovereign AI make Gemini available on premises or\nin country.\n\n\nOur Vertex AI platform makes over 200 foundation models available, helping\ncustomers like Lowe's integrate AI. We offer industry-leading models,\nincluding Gemini 2.5 Pro, 2.5 Flash, Imagen 3, Veo 2, Chirp and Lyria, plus\nopen-source and third-party models like Llama 4 and Anthropic.\n\n\nWe are the leading cloud solution for companies looking to the new era of\nAI agents, a big opportunity. Our Agent Development Kit is a new open-\nsource framework to simplify the process of building sophisticated AI\nagents and multi-agent systems. And Agent Designer is a low-code tool to\nbuild AI agents and automate tasks in over 100 enterprise applications and\nsystems.\n\n\nWe are putting AI agents in the hands of employees at major global\ncompanies like KPMG. With Google Agentspace, employees can find and\nsynthesize information from within their organization, converse with AI\nagents and take action with their enterprise applications. It combines\nenterprise search, conversational AI or chat and access to Gemini and third-\nparty agents. We also offer prepackaged agents across customer engagement,\ncoding, creativity and more that are helping to provide conversational\ncustomer experiences accelerate software development and improve decision-\nmaking.\n\n\nAnd of course, Google Workspace. It delivers more than 2 billion AI assists\nmonthly, including summarizing Gmail and refining Docs.\n\n\nLastly, our cybersecurity products are helping organizations detect,\ninvestigate and respond to cybersecurity threats. Our expertise, coupled\nwith integrated Gemini AI advances, detects malware, prioritizes threats\nand speeds up investigative workflows. This quarter, we were excited to\nannounce our intent to acquire Wiz, a leading cloud security platform that\nprotects all major clouds and code environments. Together, we can make it\neasier and faster for organizations of all types and sizes to protect\nthemselves, end-to-end and across all major clouds. We think this will help\nspur more multi-cloud computing, something customers want.\n\n\nNext, YouTube. Yesterday marked a historic milestone, the 20th anniversary\nof the first video uploaded to YouTube. From that single 19-second upload,\nthe platform has grown into a global phenomenon, fundamentally changing how\nbillions of people create, share and experience content.\n\n\nThrough all this growth, subscriptions are now a big part of the business.\nWe continue to diversify subscription options, recently expanding our\nPremium Lite pilot to the U.S., giving users a new way to enjoy most videos\non YouTube ad-free.\n\n\nTV is the primary device for YouTube viewing in the U.S. According to\nNielsen, YouTube has been #1 in streaming watch time in the U.S. for the\nlast 2 years. And YouTube now has over 1 billion monthly active podcast\nusers. YouTube Music and Premium reached over 125 million subscribers,\nincluding trials, globally.\n\n\nAnd finally, Waymo is now safely serving over 0.25 million paid passenger\ntrips each week. That's up 5x from a year ago. This past quarter, Waymo\nopened up paid service in Silicon Valley. Through our partnership with\nUber, we expanded in Austin and are preparing for our public launch in\nAtlanta later this summer. We recently announced Washington, D.C. as a\nfuture ride-hailing city, going live in 2026 alongside Miami. Waymo\ncontinues progressing on 2 important capabilities for riders, airport\naccess and freeway driving.\n\n\nThanks to all of our employees for their work this quarter. It was a great\nstart to the year, and Q2 will be even more exciting.\n\n\nWith that, Philipp, over to you.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nThanks, Sundar, and hello, everyone. I'll quickly cover performance for the\nquarter and then frame the rest of my remarks around the progress we are\ndelivering across Search, Ads, YouTube and partnerships. Google Services\nrevenues were $77 billion for the quarter, up 10% year-on-year, driven by\nstrong growth in Search and YouTube, partially offset by a year-on-year\ndecline in network revenues. To add some further color to the performance.\nThe 10% increase in Search and other revenues was led by financial services\nprimarily due to strength in insurance followed by retail. YouTube saw a\nsimilar performance across verticals. It's 10% growth in advertising\nrevenues was driven by direct response followed by brand.\n\n\nSo let's start with Search, where we've seen robust growth in revenues. All\naround the world, over 2 billion people use Search every day to find\ninformation, compare products or shop. And there are more than 5 trillion\nsearches on Google annually. We've continued our efforts to help more\npeople ask entirely new questions, bringing more opportunities for\nbusinesses to connect with consumers. And as we've mentioned before, with\nthe launch of AI Overviews, the volume of commercial queries has increased.\n\n\n\nQ1 marked our largest expansion to date for AI Overviews, both in terms of\nlaunching to new users and providing responses for more questions. The\nfeature is now available in more than 15 languages across 140 countries.\nFor AI Overviews, overall, we continue to see monetization at approximately\nthe same rate, which gives us a strong base in which we can innovate even\nmore.\n\n\nTurning to visual queries. On the last earnings call, I mentioned the\nsuccess we're seeing with Lens, where shoppers use their camera or images\nto quickly find information in ways they couldn't before. In Q1, the number\nof people shopping on Lens grew by over 10%, and the majority of Lens\nqueries are incremental. Sundar mentioned the significant growth we're also\nseeing with Circle to Search as multi-modality continues to drive queries\nacross Search.\n\n\nMoving to Ads. More businesses, big and small, are adopting AI-powered\ncampaigns, and the deployment of AI across our Ads business is driving\nresults for our customers and for our business. Throughout 2024, we\nlaunched several features that leverage LLMs to enhance advertiser value,\nand we're seeing this work pay off. The combination of these launches now\nallows us to match ads to more relevant search queries. And this helps\nadvertisers reach customers and searches where we would not previously have\nshown their ads.\n\n\nFocusing on our customers, we continue to solve advertisers' pain points\nand find opportunities to help them create, distribute and measure more\nperformant ads, infusing AI at every step of the marketing process. On\nAudience Insights, we released new asset audience recommendations, which\ntell businesses the themes that resonate most with their top audiences. On\ncreatives, advertisers can now generate a broader variety of lifestyle\nimagery customized to their business to better engage their customers and\nuse them across PMax, demand gen, display and app campaigns. Additionally,\nin PMax, advertisers can automatically source images from their landing\npages and crop them, increasing the variety of their assets.\n\n\nOn media buying, advertisers continue to see how AI-powered campaigns help\nthem find new customers. In demand gen, advertisers can more precisely\nmanage ad placements across YouTube, Gmail, Discover and Google Display\nNetwork globally and understand which assets work best at a channel level.\nThanks to dozens of AI-powered improvements launched in 2024, businesses\nusing demand gen now see an average 26% year-on-year increase in\nconversions per dollar spend for goals like purchases and leads. And when\nusing demand gen with product feed, on average, they see more than double\nthe conversion per dollar spend year-over-year.\n\n\nAs an example, Royal Canin combined demand gen and PMax campaigns to find\nmore customers for its cat and dog food products. The integration resulted\nin a 2.7x higher conversion rate, a 70% lower cost per acquisition for\npurchases and increased the value per user by 8%.\n\n\nTurning to YouTube, where we saw strong growth in revenues across ads and\nsubscriptions. This week, we're celebrating YouTube's 20th anniversary.\nWe're proud of its leadership as a streaming destination where people come\nto watch everything they love from live sports and creator-produced content\nto shorts and podcasts. Creators are what drives viewership. And on\naverage, they upload 20 million videos a day to YouTube.\n\n\nOur biggest creators generate a level of fandom and viewer engagement\naround large cultural moments on YouTube that brands can't find anywhere\nelse. During March Madness, brands aligned not only with clips and\nhighlights from the game, but also with the creators who drive basketball\nculture like Jesser and The Ringer's J. Kyle Mann.\n\n\nIn Q1, the growth of our reservation-based ads business more than doubled\nyear-over-year. Brands and creators continue to use the opportunities that\ncollaborations and partnerships offer. Toyota worked with Zach King, the\nking of short magical videos with over 42 million followers to take over\nhis channel. The creator takeover and accompanying creator ad lifted\nToyota's brand awareness by 25% compared to a control group and 9% compared\nto the Toyota brand ad.\n\n\nLooking at shorts, engaged views grew by over 20% in the first quarter. We\ncontinue to be pleased with the progress we're making globally in shorts\nmonetization relative to in-stream viewing and are particularly encouraged\nby the trend in the U.S.\n\n\nAs always, I'll wrap up with the strong momentum we're seeing in\npartnerships where customers increasingly recognize the strength and\nbreadth of what Google has to offer. For instance, Roblox is partnering\nwith Google Ad Manager to bring immersive ads to gamers. Gen Z gamers are\nRoblox' biggest users. And thanks to our partnership, advertisers will be\nable to reach this audience with ads that blend seamlessly into the gaming\nexperience. We also launched a YouTube shorts effect to help people release\niconic Roblox heads and inspire fans to create content at scale.\n\n\nIn closing, I'd like to thank Googlers everywhere for their contributions\nand commitment to our success and to our customers and partners for their\ncontinued trust.\n\n\nAnat, over to you.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nThank you, Philipp. My comments will focus on year-over-year comparisons\nfor the first quarter, unless I state otherwise. I will start with results\nat the Alphabet level and will then cover our segment results. I'll end\nwith some commentary on our outlook for the second quarter and 2025.\n\n\nWe had another strong quarter in Q1. Consolidated revenues of $90.2 billion\nincreased by 12% or 14% in constant currency. Search and YouTube\nadvertising, subscription platforms and devices and Google Cloud each had\ndouble-digit revenue growth this quarter, reflecting strong momentum across\nthe business. Total cost of revenue was $36.4 billion, up 8%. Tech was\n$13.7 billion, up 6%. We continue to see a revenue mix shift with Google\nSearch growth at double-digit levels, while network revenues, which have\nmuch higher TAC rate, declined. Other cost of revenue was $22.6 billion, up\n9%, with the increase primarily driven by content acquisition costs largely\nfor YouTube, followed by depreciation and other technical infrastructure\noperations costs.\n\n\nTotal operating expenses increased 9% to $23.3 billion. R&D investments\nincreased by 14% primarily driven by increases in compensation and\ndepreciation expenses. Sales and marketing expenses decreased 4% primarily\nreflecting a decline in compensation expenses. G&A expenses increased by\n17%, reflecting the impact of charges for legal and other matters.\n\n\nOperating income increased 20% this quarter to $31 billion, and operating\nmargin increased to 33.9%, representing 2.3 points of margin expansion.\nOperating margin benefited from healthy revenue growth, a moderated pace of\ncompensation growth and a favorable mix shift towards lower TAC advertising\nrevenues, partially offset by year-on-year increase in depreciation\nexpenses of just over $1 billion.\n\n\nOther income and expenses was $11.2 billion, primarily due to unrealized\ngain on our nonmarketable equity securities related to our investment in a\nprivate company, which we noted in our 10-K is a subsequent event. Net\nincome increased 46% to $34.5 billion, and earnings per share increased 49%\nto $2.81. We delivered free cash flow of $19 billion in the first quarter\nand $74.9 billion for the trailing 12 months. We ended the quarter with $95\nbillion in cash and marketable securities.\n\n\nTurning to segment results. Google Services revenues increased 10% to $77.3\nbillion, reflecting strength in Google Search and YouTube advertising as\nsubscription. Google Search and other advertising revenues increased by 10%\nto $50.7 billion. The robust performance of Search was once again broad-\nbased across verticals led by financial services due primarily to strength\nin insurance followed by retail.\n\n\nYouTube advertising revenues increased 10% to $8.9 billion driven by direct\nresponse advertising followed by brand. Network advertising of $7.3 billion\nwere down 2%. Subscription platforms and device revenues increased 19% to\n$10.4 billion primarily reflecting growth in subscription revenues. This\ngrowth was primarily driven by YouTube subscription offerings followed by\nGoogle One, with growth in the number of subscribers being the biggest\ndriver of revenue growth. Google Services operating income increased 17% to\n$32.7 billion and operating margin increased from 39.6% to 42.3%.\n\n\nTurning to the Google Cloud segment, which continued to deliver very strong\nresults this quarter. Revenue increased by 28% to $12.3 billion in the\nfirst quarter reflecting growth in GCP across core and AI products at a\nrate that was much higher than Cloud's overall revenue growth rate. Growth\nin Google Workspace was primarily driven by an increase in average revenue\nper seat.\n\n\nGoogle Cloud operating income increased to $2.2 billion and operating\nmargin increased from 9.4% to 17.8%. As we scale our fleet, we continue to\nfocus on driving improvements in productivity, efficiency and utilization\nto offset the growth in expenses, particularly from higher depreciation.\n\n\nAs to our Other Bets, for the first quarter, revenues were $450 million,\nand operating loss was $1.2 billion. The year-on-year decline in revenue\nand increase in operating loss primarily reflect the milestone payment\nreceived in the first quarter of 2024 for one of our Other Bets.\n\n\nWith respect to CapEx, our reported CapEx in the first quarter was $17.2\nbillion, primarily reflecting investment in our technical infrastructure\nwith the largest component being investment in servers, followed by data\ncenters to support the growth of our business across Google Services,\nGoogle Cloud and Google DeepMind. In Q1, we returned value to shareholders\nin the form of $15.1 billion in share repurchases and $2.4 billion in\ndividend payments. As we announced today, our Board of Directors declared a\n5% increase in our quarterly dividend and also approved and used $70\nbillion share repurchase authorization.\n\n\nTurning to our outlook. I would like to provide some commentary on several\nfactors that will impact our business performance in the second quarter and\nthe remainder of 2025. First, in terms of revenue, I'll highlight a couple\nof items that we mentioned last quarter that will have an impact on second\nquarter and 2025 revenue. First, in Google Services, advertising revenue in\n2025 will be impacted by lapping the strength we experienced in the\nfinancial service vertical throughout 2024.\n\n\nSecond, in Cloud, we're in a tight demand-supply environment. And given\nthat revenues are correlated with the timing of deployment of new capacity,\nwe could see variability in cloud revenue growth rates depending on\ncapacity deployment each quarter. We expect relatively higher capacity\ndeployment towards the end of 2025.\n\n\nMoving to investments, starting with our expectation for CapEx for the full\nyear 2025. We still expect to invest approximately $75 billion in CapEx\nthis year. The expected CapEx investment level may fluctuate from quarter-\nto-quarter due to the impact of changes in the timing of deliveries and\nconstruction schedules.\n\n\nIn terms of expenses, first, as I mentioned on our previous earnings call,\nthe significant increase in our investments in CapEx over the past few\nyears will continue to put pressure on the P&L, primarily in the form of\nhigher depreciation. In the first quarter, we saw 31% year-on-year growth\nin depreciation from the increase in technical infrastructure assets placed\nin service. Given the increase in CapEx investments over the past few\nyears, we expect the growth rate in depreciation to accelerate throughout\n2025.\n\n\nSecond, as we've previously said, we expect some headcount growth in 2025\nin key investment area. As we've disclosed previously, due to a shift in\nthe timing of our annual employee stock-based compensation award beginning\nin 2023, our first quarter stock-based comp expenses is relatively lower\ncompared to the remaining quarters of the year.\n\n\nIn conclusion, as you heard from Sundar and Philipp, we're pleased with the\nprogress we're making across the organization, the results for the quarter\nand the opportunities ahead. Our success as a company is grounded in our\nexperience driving advancements in deep computer science that enables us to\ncreate innovative new products and services for users, businesses and\npartners around the world. We have a strong track record of incubating and\nthen building these offerings into new profitable businesses for Alphabet.\n\n\nAs we announced last quarter, YouTube and Cloud exited 2024 at a combined\nannual run rate of $110 billion. And as you heard from Sundar earlier,\nWaymo has continued to progress in building on its impressive technological\nachievements to scale rapidly and develop a sustainable business model.\nThank you.\nSundar, Philipp and I will now take your questions.",
  "qa_text": "Operator\n\n[Operator Instructions] And our first question comes from Brian Nowak from\nMorgan Stanley.\n\n\nBrian Thomas Nowak\nMorgan Stanley, Research Division\n\nI have 2. The first one on sort of the macro advertising backdrop, maybe,\nAnat, I know it's April 24, and you called out some factors as you're kind\nof thinking about the second quarter. Any other factors you're seeing in\nadvertising verticals or regions or categories that could be showing any\nsigns of weakness quarter-to-date, so we should think through any other\nchanges from typical seasonality in 2Q '25 versus prior quarters?\n\n\nThen the second one, on Philipp, I think I heard you mention how the volume\nof commercial queries has increased. Maybe can you just walk us through\nwhich of the products are driving that increase in commercial queries? And\nas you sort of think about the pipeline of Search products, are there any\nothers that you're particularly excited about to kind of continue to drive\nfurther commercial query growth throughout '25, '26?\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nSo let me take the first one as well. We saw broad-based strength across ad\nverticals in Q1, and we saw it -- give you a bit of vertical color here.\nSearch was led, again, by finance, due primarily to ongoing strength in the\ninsurance. Retail, health care and travel were actually also sizable\ncontributors here to growth.\n\n\nWith regard to Q2, we're only a few weeks in, so it's really too early to\ncomment. I mean we're obviously not immune to the macro environment. But we\nwouldn't want to speculate about potential impacts beyond noting that the\nchanges to the de minimis exemption will obviously cause a slight headwind\nto our ads business in 2025 primarily from APAC-based retailers. And maybe\nto zoom out, I would say we have a lot of experience in managing through\nuncertain times, and we focus on helping our customers by providing deep\ninsights into changing consumer behavior that is relevant to their\nbusiness. Examples are auction dynamics, query trend insights on topics\nlike replacement purchases and so on. So we have a lot of experience in\nthis area.\n\n\nOn the commercial query side, look, AI Overviews continue to drive higher\nsatisfaction and search usage. And as I noticed, Q1 was really our largest\nexpansion to date for AI Overviews, both in terms of launching to new users\nand providing responses for more questions. And that's really the core\nalready of the answer. AI Overviews sits at the center of your question\nhere. And when it comes to other products, look, I don't want to speculate\non this, but we're happy with what we're seeing here on AI Overviews, and\nI'm confident we can expand this to more products over time.\n\n\nOperator\n\nYour next question is from Doug Anmuth from JPMorgan.\n\n\nDouglas Till Anmuth\nJPMorgan Chase & Co, Research Division\n\nPhilipp, maybe just to go back to AI Overviews for a moment. Can you just\ntell us how we should think about the 1.5 billion AI Overviews users just\nin terms of breadth of rollout? And I know you're saying monetization at\napproximately the same rate. But what does that mean in terms of click-\nthrough rates and conversion?\n\n\nAnd then Anat, just curious if there have been any changes to Google's\napproach to durably reengineering the cost base since you've joined? And if\nmacro weakens and you see more of a slowdown, would you expect to find\nadditional opportunities to cut back more on costs?\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nYes. Look, on the ads of -- in AI Overviews, last -- late last year,\nactually, we launched them within the AI Overviews on mobile in the U.S.\nAnd this builds on our previous rollout of ads above and below. So this was\na change that we have. But as I talked about it before, for AI Overviews\noverall, we see the monetization at approximately the same rate, which\ngives us a strong base on which we can innovate even more. So I'm very\nhappy with this. I don't think this is the moment to go into the details of\nclick-through rates and conversion and so on. But overall, we're happy with\nwhat we're seeing.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd to your question on our approach to productivity and efficiency, it\nhasn't really changed. I've mentioned my approach and our approach as a\ncompany on -- at the end of 2024. And we're still focused on driving\nefficiency and productivity throughout the organization, both in our\noperating expenses and in our CapEx. I've mentioned some of these on my --\nduring my prepared remarks.\n\n\nBut certainly, this helps us, as we think about the investments we need to\nmake in innovation, to drive long-term sustainable growth profile for the\ncompany. We're able to repurpose some of these efficiencies into these\ninvestments as well as, as you think about the increase in CapEx we've seen\nover the past several years and what we're investing this year, this will\nput additional pressure on the income statement in the form of\ndepreciation. So we're working hard to try and offset some of the\nheadwinds.\n\n\nAs well as within the CapEx investments themselves, $75 billion, we're\nlooking at how do we make sure every dollar is used efficiently. We have a\nhighly rigorous process to determine the demand behind it and then the\nallocation of the compute associated with our technical infrastructure\ninvestments, ensuring that we're utilizing that appropriately and that\nwe're highly efficient with everything we're doing. You've seen some of the\nannouncement and some of the changes, but we're focusing on continuing to\nmoderate the pace of compensation growth, looking at our real estate\nfootprint and again, the build-out and utilization of our technical\ninfrastructure across the business.\n\n\nOperator\n\nOur next question comes from Eric Sheridan from Goldman Sachs.\n\n\nEric James Sheridan\nGoldman Sachs Group, Inc., Research Division\n\nFirst, maybe for Sundar. When you look across the consumer AI landscape\ntoday, how are you thinking about continuing to drive differentiation for\nGemini as a platform through the lens of usage, utility or putting product\ninnovation at the forefront of driving consumer habits?\n\n\nAnd then the second one, maybe for Anat, if the macro environment were to\nchange and become more downwardly volatile, how should investors think\nabout the investments that are must make this year, almost fixed in nature\nversus where there might be more flexibility to alter the investment\npriorities of the company if the macro environment were to worsen?\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Eric. Obviously, it's an exciting moment on the AI front. I think\nthe foundation for everything is obviously the Frontier model progress we\nare seeing. And particularly with 2.5 Pro and Flash, I think we're well\npositioned. We are seeing tremendous reception from developers, enterprises\nand consumers, too.\n\n\nAnd obviously, we are delivering consumer AI experiences across our product\nportfolio, including the primary way people experience it is obviously in\nSearch with AI Overviews. And very early days with AI Mode, but that will\nbe a consumer AI-forward experience. And we're already seeing very positive\nfeedback. Queries are -- people are typing in roughly 2x longer queries\ncompared to a traditional search. So there's a lot of excitement there.\n\n\nAnd in the Gemini app, which you asked about, we've really seen increased\nmomentum, particularly over the last few weeks as we've rolled out not just\nthe newer models, but we are seeing users are really responding well to all\nthe innovation. Gemini Live, which is based on Project Astra, has been very\nwell received. Deep Research, I think, based on 2.5 Pro, is -- that's being\nwell received. And Canvas, we've had a lot of traction as well. And so we\nare definitely investing more. We have recently organized ourselves better\nto capitalize on this momentum, and I'm excited about our road map there.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd on the investments this year and overall, should there be any\nmacroeconomic changes, as I said, we're still planning to invest\napproximately $75 billion in CapEx this year. We do see a tremendous\nopportunity ahead of us across the organization, whether it's to support\nGoogle Services, Google Cloud and Google DeepMind. Recall I've stated on\nthe Q4 call that we exited the year in Cloud specifically with more\ncustomer demand than we had capacity. And that was the case this quarter as\nwell. So we want to make sure we ramp up to support customer needs and\ncustomer demands.\n\n\nHaving said that, we're investing in long term, and we're investing in\ninnovation. That's the essence of our business. And we want to do it in a\nresponsible fashion. So you've seen us over the past couple of years, and\nwe're continuing to do this, and you're seeing this in our results, drive\nefficiency and productivity throughout the business. And we've announced\nthings such as consolidation of teams, which helps not just with cost, but\nwith velocity and speed. We're able to get things to market faster.\n\n\nSo that's one of the areas we're focused on. You heard from Sundar in the\nlast couple of calls on just the rapid pace of innovation we're bringing to\nthe marketplace. So the way we're doing this across the business to drive\nproductivity and efficiency should help us have a more resilient\norganization irrespective of macroeconomic condition. But certainly, we\ndon't ignore that. We always look at what's happening outside the\norganization as well as inside, but invest appropriately to drive both the\nshort-term growth as well as the long-term growth.\n\n\nOperator\n\nOur next question comes from Ross Sandler from Barclays.\n\n\nRoss Adam Sandler\nBarclays Bank PLC, Research Division\n\nOne for Sundar, one for Philipp. Sundar, it was disclosed this week in the\ntrial that's going on that Gemini has 35 million DAUs. And just curious,\nthat number obviously trails ChatGPT by a pretty wide margin. Could you\ntalk about the strategy to get that DAU figure much higher that you guys\nare deploying?\n\n\nAnd then Philipp, just curious to hear what you're seeing on the brand\nadvertising side at YouTube in 1Q and into early 2Q. Are brands holding up\nrelatively well, like direct response? Or are they starting to react to\nsome of these macro jitters that we're all experiencing? Any thoughts\nthere?\n\n\nSundar  Pichai\nCEO & Director\n\nThanks, Ross. I think I touched upon this to Eric's question as well, but\nwe are definitely -- I think there's been a lot of momentum in terms of\nproduct features we've been introducing. And we are definitely seeing\nreception, including increased adoption and usage based on those features.\nSo I think we are in a good positive cycle. The recent advances on the\nmodel Frontier, by many metrics, I think we have the best model out there\nnow. And I think that's going to drive increased adoption as well.\n\n\nAnd again, I would reiterate, people are using -- obviously, we have 1.5\nbillion users through AI Overviews interacting with AI in a deep way in a\nvery engaged way. Obviously, we are innovating with AI Mode. And we have a\nvery exciting road map ahead with the Gemini app as well. So across the\nboard, super excited about what's ahead.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nAnd on your brand question, look, brand and, by the way, also direct\nresponse had a very solid growth in Q1. Brand advertisers really enjoyed\nculture moments we had like Coachella, for example, or March Madness. We\nhad strong contributions overall from the finance and retail verticals in\nQ1 on this side as well. The operating metrics for YouTube were strong in\nQ1. Watch time growth remains robust, particularly in key monetization\nopportunity areas such as shorts and living room. It's also, by the way,\nnice to see the strong position of our creators who obviously benefit from\nthe brand piece, which gives us a lot of confidence when we look at it more\nclosely. And on the Q2 side, I think I mentioned it's too early to really\ncomment on that.\n\n\nOperator\n\nYour next question is from Mark Shmulik from Bernstein.\n\n\nMark Elliott Shmulik\nSanford C. Bernstein & Co., LLC., Research Division\n\nSundar, I appreciate the color on Gemini deployment across kind of the 15\nproducts with 0.5 billion users or more. It would be great to hear more\nabout where you're seeing the most usage and deployment of gen AI\ninternally at Google, perhaps whether the capabilities -- are they in a\nplace today in terms of either supplementing or augmenting the workforce?\nAnd then just to build on that earlier AI Mode-type questions. Appreciate\nAI Mode has 2x longer queries than traditional search, but any color you\ncan share perhaps on how AI Mode behavior differs from how consumers are\nusing the Gemini app?\n\n\nSundar  Pichai\nCEO & Director\n\nLook, internally, I mean, this has been an extraordinary amount of focus\nand excitement both because I think we are -- the early use cases have been\ntransformative in nature and I think this still feels like early days and\nlong ways to go. Obviously, I had mentioned a few months ago in terms of\nhow we are using AI for coding. We're continuing to make a lot of progress\nthere in terms of people using coding suggestions. I think the last time I\nhad said, the number was like 25% of code that's checked in. It involves\npeople accepting AI-suggested solutions. That number is well over 30% now.\nBut more importantly, we have deployed more deeper flows. And particularly\nwith the newer models, I think we are working on early agentic workflows\nand how we can get those coding experiences to be much deeper.\n\n\nWe are deploying it across all parts of the company. Our customer service\nteams are deeply leading the way there. We've both dramatically enhanced\nour user experience as well as made it much more efficient to do so. And we\nare actually bringing all our learnings and expertise in our solutions\nthrough cloud to our other customers. But beyond that, all the way from the\nfinance team preparing for this earnings call to everything, it's deeply\nembedded in everything we do. But I still see it as early days, and there's\ngoing to be a lot more to do.\n\n\nOn AI Mode, look, I think we are just leaning in on the early positive\nfeedback -- well, as we scaled up AI Overviews. It's been one of our most\npositive launches. And -- but it's been clear people have wanted even more\nof it. And so with AI Mode, we are bringing the -- our state-of-the-art\nGemini models right into Search.\n\n\nAnd I mentioned people typing in longer queries. There's a lot more\ncomplex, nuanced questions. People are following through more. People are\nappreciating the clean design, the fast response time and the fact that\nthey can kind of be much more open-ended, can undertake more complicated\ntasks. Product comparisons, for example, has been a positive one, exploring\nhow tos, planning a trip. So those are the kinds of early feedback we are\nseeing. And I think we are obviously really focused on improving the\nproduct across all of AI Mode, AI Overviews and the Gemini app, and we are\nseeing positive user traction as well.\n\n\nOperator\n\nYour next question is from Mark Mahaney from Evercore.\n\n\nMark Stephen F. Mahaney\nEvercore ISI Institutional Equities, Research Division\n\nOne for Anat and one for Sundar. Anat, getting back to a question, I think,\nthat Doug was asking earlier. You just put up record-high or multiyear\nrecord-high margins for both Google Services and for Google Cloud. You\ntalked, though, about depreciation expenses accelerating rapidly throughout\nthe year because of all the investments you've already -- you'd warned\npeople about. Back in the September quarter, you seem relatively confident\nthat you had enough levers to kind of offset kind of rising infrastructure\ncosts. Was that still your -- 6 months later, is that still your view that\nyou've got enough levers that even with the rising infrastructure costs,\nyou can -- there's enough in there to kind of counterbalance that?\n\n\nAnd then just briefly on Waymo, continues to rise aggressively the numbers,\nSundar. The long-term business model for Waymo, is there a reason to make a\ndecision on that soon? Or have you already made the decision of whether\nthis is a long-term licensing model or you really want to run this as a\nstand-alone ride-sharing, delivery, autonomous vehicle business?\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nThanks. On your first question on profitability and what levers do we have\nand do we still have levers to pull, first, I think every organization can\nalways push a little further. I don't view productivity goals or efficiency\nas an episodic, kind of project-based effort, but rather a continuous\neffort that when you get to a certain place, you push a little further.\n\n\nHaving said that, we do have significant investments we're making across\nthe organization, and we have been making them for the past several\nquarters. And we've been able to do it because we were able to find\nefficiency to fund those investments across the organization. Those are for\nproducts and services that are going to drive long-term growth for the\ncompany.\n\n\nSo while we're trying to offset as much of the headwind associated with the\nincrease in infrastructure costs, it will become more difficult. As I said,\nthe depreciation will accelerate. We had about a 31% year-over-year growth\nin depreciation this quarter. And it will be higher as we go throughout the\nyear. So think about that kind of as a headwind that we have to manage\nagainst, but we're continuing with pushing across the organization,\nleveraging, Sundar mentioned, the use of AI and kind of an AI-first Google\nacross several of our functions to help us manage a larger scope of work\nusing our AI, AI agents and AI tools. As Sundar mentioned, we did leverage\nit in preparation for the earnings call and we're leveraging it across\nseveral functions.\n\n\nSo there are opportunities, but there are also great opportunities for\ninvestment, and we want to make sure that we make room for -- to make these\ninvestments to drive long-term growth and ensure we have a very resilient,\nlong-term growth profile for the company.\n\n\nSundar  Pichai\nCEO & Director\n\nAnd Mark, thanks. I think this is probably the first question I've got on\nan earnings call on Waymo. So thank you, and I think it's a sign of its\nprogress. Look, the thing that excites me is I think we've been laser\nfocused and will continue to be on building the world's best driver. And I\nthink doing that well really gives you a variety of optionality in business\nmodels across geographies, et cetera.\n\n\nIt'll also require a successful ecosystem of partners, and we can't\npossibly do it all ourselves. And so I'm excited about the progress the\nteams have made through a variety of partnerships. Obviously, a highlight\nof it is our partnership with Uber. We are very pleased with what we are\nalready seeing in Austin in terms of rider satisfaction. We look forward to\noffering the first paid rides in Atlanta via Uber later this year.\n\n\nBut we are also building up a network of partners, for example, for\nmaintaining fleets of vehicles and doing all the operations related to that\nwith the recently announced partnership with Moove in Phoenix and Miami,\nobviously, partnerships with OEMs. There are future optionality around\npersonal ownership as well. So we are widely exploring and -- but at the\nsame time, clearly staying focused on making progress both in terms of\nsafety, the driver experience and progress on the business model and\noperationally scaling it up.\n\n\nOperator\n\nOur next question comes from Ken Gawrelski from Wells Fargo.\n\n\nKenneth James Gawrelski\nWells Fargo Securities, LLC, Research Division\n\nTwo, if I may, please. First, on AI-powered search. You have a number of AI-\npowered search interfaces, including 3 most prominently, AI Overviews, AI\nMode and Gemini. In the future, should we think of these as distinct\nexperiences that will be long-lasting or more experimental now and will --\nand Google will eventually focus on one approach going forward?\n\n\nAnd the second one is more on the financial side. You continue to\nexperience very healthy gross margin expansion. We see the TAC, sure, but\nyou -- Anat, you also talked about the offsetting depreciation expense.\nCould you talk about beyond those 2 buckets where you're seeing the real\nsavings on the COGS line and driving that gross margin expansion and maybe\neven how we should be thinking about that going forward?\n\n\nSundar  Pichai\nCEO & Director\n\nOkay. Now maybe on AI-powered search and how do we see our consumer\nexperience. Look, I do think Search and Gemini, obviously, will be 2\ndistinct efforts, right? I think there are obviously some areas of overlap,\nbut they're also -- like expose very, very different use cases. And so for\nexample, in Gemini, we see people iteratively coding and going much deeper\non a coding workflow, as an example. So I think both will be around.\n\n\nWithin Search, I would think of AI Overviews is scaling up and working for\nour entire user base, but an AI Mode is the tip of the tree for us pushing\nforward on an AI-forward experience. There will be things which we discover\nthere, which will make sense in the context of AI Overviews, so I think\nwill flow through to our user base. But you almost want to think of what\nare the most advanced 1 million people using Search for, the most advanced\n10 million people and then how do 1.5 billion people use Search for. And we\nwant to innovate. And so I think this allows us to do that. But the true\nnorth through all of this is user feedback, user satisfaction, user\nexperience. And so that will determine where this all works out in the\nfuture.\n\n\nAnat  Ashkenazi\nSenior VP & CFO\n\nAnd to your question on gross margin, a couple of trends to highlight\nthere. And I've mentioned this in the prepared remarks, you've seen\nimprovement in TAC that's really driven by the change in revenue mix with a\ncontinued Search growth and then network revenue declines. Network revenue\nhas a much higher TAC rate. So that mix is helping us from a gross margin\nperspective. So think about that as well.\n\n\nNow we do have depreciation for technical infrastructure hits in 2 --\nprimarily in 2 places in the income statement, one is in other cost of\nsales and the rest is in R&D. So it is in that line item that's impacting\ncost of sales. Now we've had some efficiencies there, and I did mention the\nimprovement in our overall cost of -- headcount growth and compensation\nkind of moderating those growth. So that helps us as well more than offset\nthe depreciation increases in Q1. But as I mentioned, this number will be\nhigher in the coming quarters. Recall, we have -- we said approximately $75\nbillion in CapEx, which is up from $55 billion or just over $50 billion\nlast year. So there is expected to be quite a significant increase in\ndepreciation.\n\n\nOperator\n\nAnd our last question comes from Ron Josey from Citi.\n\n\nRonald Victor Josey\nCitigroup Inc., Research Division\n\nPhilipp, I wanted to touch a little bit more on your comments around direct\nresponse in YouTube. I think it's been improving and been a driver over the\npast couple of quarters. I'd love to hear more just about what's driving\nthat. Is that the demand gen and integration with PMax? Or are users\nperhaps more involved on direct response now that shorts usage is rising?\nWould love your thoughts there.\n\n\nPhilipp  Schindler\nSenior Vice President & Chief Business Officer of Google\n\nYes. I think there's a lot of different factors. Mostly, we continue to\nhelp our customers really using our AI-powered tools, you mentioned a few\nof them, to drive performance. That's a very big one. As I mentioned\nbefore, we're also happy with the progress we're seeing on shorts and\nclosing the monetization gap here to the overall business, which is\nactually really nice to see, especially in the U.S. So we're very happy\nwith that. Yes.\n\n\nSundar  Pichai\nCEO & Director\n\nAnd I'll just chime in to say, YouTube just celebrated its 20th birthday.\nAnd we now have more than 20 billion videos on YouTube, and we get 20\nmillion videos uploaded every day. So I think it's a tremendous platform.\nAnd thanks to all the creators and users who have supported us there over\nthe years.\n\n\nOperator\n\nAnd that concludes our question-and-answer session for today. I would like\nto turn the conference back over to Jim Friedland for any further remarks.\n\n\nJames Friedland\n\nThanks, everyone, for joining us today. We look forward to speaking with\nyou again on our second quarter 2025 call. Thank you, and have a good\nevening.\n\n\nOperatorThank you, everyone. This concludes today's conference call. Thank\nyou for participating. You may now disconnect.\nCopyright  2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n 2025 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Alphabet Inc. NasdaqGS:GOOGL FQ1 2025 Earnings Call Transcripts Thursday, April 24, 2025 8:30 PM GMT S&P Global Market Intelligence Estimates Presentation"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Welcome, everyone. Thank you for standing by for the Alphabet First Quarter 2025 Earnings Conference Call. [Operator Instructions] I would now like to hand the conference over to your speaker today, Jim Friedland, Senior Director of Investor Relations. Please go ahead. James Friedland Thank you. Good afternoon, everyone, and welcome to Alphabet's First Quarter 2025 Earnings Conference Call. With us today are Sundar Pichai, Philipp Schindler and Anat Ashkenazi. Now I'll quickly cover the safe harbor. Some of the statements that we make today regarding our business, operations and financial performance may be considered forward-looking. Such statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10-K and 10-Q, including the risk factors. We undertake no obligation to update any forward-looking statement. During this call, we will present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyz/investor. Our comments will be on year-over-year comparisons unless we state otherwise. And now I'll turn the call over to Sundar."
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director Thanks, Jim. Good afternoon, everyone. We are pleased with our strong results this quarter. We continue to see healthy growth and momentum across the business, including AI powering new features. In Search, we saw continued double-digit revenue growth. AI Overviews is going very well with over 1.5 billion users per month, and we are excited by the early positive reaction to AI Mode. There's a lot more to come ahead. In subscriptions, we surpassed 270 million [ subscriptions ] with YouTube and Google One as key drivers. And Cloud grew rapidly with significant demand for our solutions, and you saw our leadership in AI at Cloud Next across infrastructure, agents and more. Our differentiated full stack approach to AI continues to be central to our growth. This quarter was super exciting as we rolled out Gemini 2.5, our most intelligent AI model, which is achieving breakthroughs in performance, and it's widely recognized as the best model in the industry. That's an extraordinary foundation for our future innovation, and we are focused on bringing this to people and customers everywhere. Looking ahead to I/O, Brandcast and Google Marketing Live, I can't wait for our teams to showcase the innovations they've been working on. Turning to our AI progress this quarter, which continues to enable significant growth opportunities. The elements of the AI stack I've previously mentioned are AI infrastructure; world-class research, including models and tooling; and our products and platforms. Starting with AI infrastructure, our long-term investments in our global network have positioned us well. Google's network is robust and resilient, supported by over 2 million miles of fiber and 33 subsea cables. Complementing this, we offer the industry's widest range of TPUs and GPUs and continue to invest in next-generation capabilities. Ironwood, our seventh-generation TPU and most powerful to date, is the first designed specifically for inference at scale. It delivers more than 10x improvement in compute power or a recent high-performance TPU while being nearly twice as power efficient. Our strong relationship with NVIDIA continues to be a key advantage for us and our customers. We were the first cloud provider to offer NVIDIA's groundbreaking B200 and GB200 Blackwell GPUs, and we'll be offering their next-generation Vera Rubin GPUs. Second, this infrastructure powers our world-class research, including our industry-leading models. We released Gemini 2.5 Pro last month, receiving extremely positive feedback from both developers and consumers. 2.5 Pro is state-of-the-art on a wide range of benchmarks and debuted at #1 on the chatbot arena by a significant margin. 2.5 Pro achieved big leaps in reasoning, coding, science and math capabilities, opening up new possibilities for developers and customers. Active users in AI studio and Gemini API have grown over 200% since the beginning of the year. And last week, we introduced 2.5 Flash, which enables developers to optimize quality and cost. Our latest image and video generation models, Imagen 3 and Veo 2, are rolling out broadly and are powering incredible creativity. Turning to open models. We launched Gemma 3 last month, delivering state-of- the-art performance for its size. Gemma models have been downloaded more than 140 million times. Lastly, we are developing AI models in new areas where there's enormous opportunity, for example, our new Gemini Robotics models. And in health, we launched AI co-scientist, a multi-agent AI research system, while AlphaFold has now been used by over 2.5 million researchers. Third, turning to products and platforms. All 15 of our products with 0.5 billion users now use Gemini models. Android and Pixel are 2 examples of how we are putting the best AI in people's hands, making it super easy to use AI for a wide range of tasks, just by using their camera, voice or taking a screen shot. We are upgrading Google Assistant on mobile devices to Gemini. And later this year, we'll upgrade tablets, cars and devices that connect to your phones such as headphones and watches. The Pixel 9a launched very strong reviews, providing the best of Google's AI offerings like Gemini Live and AI-powered camera features. And Gemini Live camera and screen sharing is now rolling out to all Android devices, including Pixel and Samsung S25. Now moving on to key highlights from across Search, Cloud, YouTube and Waymo. First, Search. AI is one of the most revolutionary technologies for enabling and expanding our information mission. And for Search, we see it growing the number and types of questions we can answer. We are already seeing this with AI Overviews, which now has more than 1.5 billion users every month. Nearly a year after we launched AI Overviews in the U.S., we continue to see that usage growth is increasing as people learn that Search is more useful for more of their queries. So we are leaning in heavily here, continuing to roll the feature out in new countries to more users and to more queries. Building on the positive feedback for AI Overviews, in March, we released AI Mode, an experiment in labs. It expands what AI Overviews can do with more advanced reasoning, thinking and multimodal capabilities to help with questions that need further exploration and comparisons. On average, AI Mode queries are twice as long as traditional search queries. We're getting really positive feedback from early users about its design, fast response time and ability to understand complex, nuanced questions. We also continue to see significant growth in multimodal queries. Circle to Search is now available on more than 250 million devices with usage increasing nearly 40% this quarter. And monthly visual searches with Lens have increased by 5 billion since October. Moving on to Cloud. At Cloud Next, we announced major innovations, and over 500 companies shared the business results they are achieving by working with us. We provide leading cost, performance and reliability for AI training and inference. This enables us to deliver the best value for AI leaders, like Anyscale and Contextual AI, as well as global brands like Verizon. And for highly sensitive data and regulatory requirements, Google- distributed Cloud and our sovereign AI make Gemini available on premises or in country. Our Vertex AI platform makes over 200 foundation models available, helping customers like Lowe's integrate AI. We offer industry-leading models, including Gemini 2.5 Pro, 2.5 Flash, Imagen 3, Veo 2, Chirp and Lyria, plus open-source and third-party models like Llama 4 and Anthropic. We are the leading cloud solution for companies looking to the new era of AI agents, a big opportunity. Our Agent Development Kit is a new open- source framework to simplify the process of building sophisticated AI agents and multi-agent systems. And Agent Designer is a low-code tool to build AI agents and automate tasks in over 100 enterprise applications and systems. We are putting AI agents in the hands of employees at major global companies like KPMG. With Google Agentspace, employees can find and synthesize information from within their organization, converse with AI agents and take action with their enterprise applications. It combines enterprise search, conversational AI or chat and access to Gemini and third- party agents. We also offer prepackaged agents across customer engagement, coding, creativity and more that are helping to provide conversational customer experiences accelerate software development and improve decision- making. And of course, Google Workspace. It delivers more than 2 billion AI assists monthly, including summarizing Gmail and refining Docs. Lastly, our cybersecurity products are helping organizations detect, investigate and respond to cybersecurity threats. Our expertise, coupled with integrated Gemini AI advances, detects malware, prioritizes threats and speeds up investigative workflows. This quarter, we were excited to announce our intent to acquire Wiz, a leading cloud security platform that protects all major clouds and code environments. Together, we can make it easier and faster for organizations of all types and sizes to protect themselves, end-to-end and across all major clouds. We think this will help spur more multi-cloud computing, something customers want. Next, YouTube. Yesterday marked a historic milestone, the 20th anniversary of the first video uploaded to YouTube. From that single 19-second upload, the platform has grown into a global phenomenon, fundamentally changing how billions of people create, share and experience content. Through all this growth, subscriptions are now a big part of the business. We continue to diversify subscription options, recently expanding our Premium Lite pilot to the U.S., giving users a new way to enjoy most videos on YouTube ad-free. TV is the primary device for YouTube viewing in the U.S. According to Nielsen, YouTube has been #1 in streaming watch time in the U.S. for the last 2 years. And YouTube now has over 1 billion monthly active podcast users. YouTube Music and Premium reached over 125 million subscribers, including trials, globally. And finally, Waymo is now safely serving over 0.25 million paid passenger trips each week. That's up 5x from a year ago. This past quarter, Waymo opened up paid service in Silicon Valley. Through our partnership with Uber, we expanded in Austin and are preparing for our public launch in Atlanta later this summer. We recently announced Washington, D.C. as a future ride-hailing city, going live in 2026 alongside Miami. Waymo continues progressing on 2 important capabilities for riders, airport access and freeway driving. Thanks to all of our employees for their work this quarter. It was a great start to the year, and Q2 will be even more exciting. With that, Philipp, over to you."
    },
    {
      "speaker": "Philipp  Schindler",
      "role": "Senior Vice President & Chief Business Officer of Google",
      "text": "Senior Vice President & Chief Business Officer of Google Thanks, Sundar, and hello, everyone. I'll quickly cover performance for the quarter and then frame the rest of my remarks around the progress we are delivering across Search, Ads, YouTube and partnerships. Google Services revenues were $77 billion for the quarter, up 10% year-on-year, driven by strong growth in Search and YouTube, partially offset by a year-on-year decline in network revenues. To add some further color to the performance. The 10% increase in Search and other revenues was led by financial services primarily due to strength in insurance followed by retail. YouTube saw a similar performance across verticals. It's 10% growth in advertising revenues was driven by direct response followed by brand. So let's start with Search, where we've seen robust growth in revenues. All around the world, over 2 billion people use Search every day to find information, compare products or shop. And there are more than 5 trillion searches on Google annually. We've continued our efforts to help more people ask entirely new questions, bringing more opportunities for businesses to connect with consumers. And as we've mentioned before, with the launch of AI Overviews, the volume of commercial queries has increased. Q1 marked our largest expansion to date for AI Overviews, both in terms of launching to new users and providing responses for more questions. The feature is now available in more than 15 languages across 140 countries. For AI Overviews, overall, we continue to see monetization at approximately the same rate, which gives us a strong base in which we can innovate even more. Turning to visual queries. On the last earnings call, I mentioned the success we're seeing with Lens, where shoppers use their camera or images to quickly find information in ways they couldn't before. In Q1, the number of people shopping on Lens grew by over 10%, and the majority of Lens queries are incremental. Sundar mentioned the significant growth we're also seeing with Circle to Search as multi-modality continues to drive queries across Search. Moving to Ads. More businesses, big and small, are adopting AI-powered campaigns, and the deployment of AI across our Ads business is driving results for our customers and for our business. Throughout 2024, we launched several features that leverage LLMs to enhance advertiser value, and we're seeing this work pay off. The combination of these launches now allows us to match ads to more relevant search queries. And this helps advertisers reach customers and searches where we would not previously have shown their ads. Focusing on our customers, we continue to solve advertisers' pain points and find opportunities to help them create, distribute and measure more performant ads, infusing AI at every step of the marketing process. On Audience Insights, we released new asset audience recommendations, which tell businesses the themes that resonate most with their top audiences. On creatives, advertisers can now generate a broader variety of lifestyle imagery customized to their business to better engage their customers and use them across PMax, demand gen, display and app campaigns. Additionally, in PMax, advertisers can automatically source images from their landing pages and crop them, increasing the variety of their assets. On media buying, advertisers continue to see how AI-powered campaigns help them find new customers. In demand gen, advertisers can more precisely manage ad placements across YouTube, Gmail, Discover and Google Display Network globally and understand which assets work best at a channel level. Thanks to dozens of AI-powered improvements launched in 2024, businesses using demand gen now see an average 26% year-on-year increase in conversions per dollar spend for goals like purchases and leads. And when using demand gen with product feed, on average, they see more than double the conversion per dollar spend year-over-year. As an example, Royal Canin combined demand gen and PMax campaigns to find more customers for its cat and dog food products. The integration resulted in a 2.7x higher conversion rate, a 70% lower cost per acquisition for purchases and increased the value per user by 8%. Turning to YouTube, where we saw strong growth in revenues across ads and subscriptions. This week, we're celebrating YouTube's 20th anniversary. We're proud of its leadership as a streaming destination where people come to watch everything they love from live sports and creator-produced content to shorts and podcasts. Creators are what drives viewership. And on average, they upload 20 million videos a day to YouTube. Our biggest creators generate a level of fandom and viewer engagement around large cultural moments on YouTube that brands can't find anywhere else. During March Madness, brands aligned not only with clips and highlights from the game, but also with the creators who drive basketball culture like Jesser and The Ringer's J. Kyle Mann. In Q1, the growth of our reservation-based ads business more than doubled year-over-year. Brands and creators continue to use the opportunities that collaborations and partnerships offer. Toyota worked with Zach King, the king of short magical videos with over 42 million followers to take over his channel. The creator takeover and accompanying creator ad lifted Toyota's brand awareness by 25% compared to a control group and 9% compared to the Toyota brand ad. Looking at shorts, engaged views grew by over 20% in the first quarter. We continue to be pleased with the progress we're making globally in shorts monetization relative to in-stream viewing and are particularly encouraged by the trend in the U.S. As always, I'll wrap up with the strong momentum we're seeing in partnerships where customers increasingly recognize the strength and breadth of what Google has to offer. For instance, Roblox is partnering with Google Ad Manager to bring immersive ads to gamers. Gen Z gamers are Roblox' biggest users. And thanks to our partnership, advertisers will be able to reach this audience with ads that blend seamlessly into the gaming experience. We also launched a YouTube shorts effect to help people release iconic Roblox heads and inspire fans to create content at scale. In closing, I'd like to thank Googlers everywhere for their contributions and commitment to our success and to our customers and partners for their continued trust. Anat, over to you."
    },
    {
      "speaker": "Anat  Ashkenazi",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Thank you, Philipp. My comments will focus on year-over-year comparisons for the first quarter, unless I state otherwise. I will start with results at the Alphabet level and will then cover our segment results. I'll end with some commentary on our outlook for the second quarter and 2025. We had another strong quarter in Q1. Consolidated revenues of $90.2 billion increased by 12% or 14% in constant currency. Search and YouTube advertising, subscription platforms and devices and Google Cloud each had double-digit revenue growth this quarter, reflecting strong momentum across the business. Total cost of revenue was $36.4 billion, up 8%. Tech was $13.7 billion, up 6%. We continue to see a revenue mix shift with Google Search growth at double-digit levels, while network revenues, which have much higher TAC rate, declined. Other cost of revenue was $22.6 billion, up 9%, with the increase primarily driven by content acquisition costs largely for YouTube, followed by depreciation and other technical infrastructure operations costs. Total operating expenses increased 9% to $23.3 billion. R&D investments increased by 14% primarily driven by increases in compensation and depreciation expenses. Sales and marketing expenses decreased 4% primarily reflecting a decline in compensation expenses. G&A expenses increased by 17%, reflecting the impact of charges for legal and other matters. Operating income increased 20% this quarter to $31 billion, and operating margin increased to 33.9%, representing 2.3 points of margin expansion. Operating margin benefited from healthy revenue growth, a moderated pace of compensation growth and a favorable mix shift towards lower TAC advertising revenues, partially offset by year-on-year increase in depreciation expenses of just over $1 billion. Other income and expenses was $11.2 billion, primarily due to unrealized gain on our nonmarketable equity securities related to our investment in a private company, which we noted in our 10-K is a subsequent event. Net income increased 46% to $34.5 billion, and earnings per share increased 49% to $2.81. We delivered free cash flow of $19 billion in the first quarter and $74.9 billion for the trailing 12 months. We ended the quarter with $95 billion in cash and marketable securities. Turning to segment results. Google Services revenues increased 10% to $77.3 billion, reflecting strength in Google Search and YouTube advertising as subscription. Google Search and other advertising revenues increased by 10% to $50.7 billion. The robust performance of Search was once again broad- based across verticals led by financial services due primarily to strength in insurance followed by retail. YouTube advertising revenues increased 10% to $8.9 billion driven by direct response advertising followed by brand. Network advertising of $7.3 billion were down 2%. Subscription platforms and device revenues increased 19% to $10.4 billion primarily reflecting growth in subscription revenues. This growth was primarily driven by YouTube subscription offerings followed by Google One, with growth in the number of subscribers being the biggest driver of revenue growth. Google Services operating income increased 17% to $32.7 billion and operating margin increased from 39.6% to 42.3%. Turning to the Google Cloud segment, which continued to deliver very strong results this quarter. Revenue increased by 28% to $12.3 billion in the first quarter reflecting growth in GCP across core and AI products at a rate that was much higher than Cloud's overall revenue growth rate. Growth in Google Workspace was primarily driven by an increase in average revenue per seat. Google Cloud operating income increased to $2.2 billion and operating margin increased from 9.4% to 17.8%. As we scale our fleet, we continue to focus on driving improvements in productivity, efficiency and utilization to offset the growth in expenses, particularly from higher depreciation. As to our Other Bets, for the first quarter, revenues were $450 million, and operating loss was $1.2 billion. The year-on-year decline in revenue and increase in operating loss primarily reflect the milestone payment received in the first quarter of 2024 for one of our Other Bets. With respect to CapEx, our reported CapEx in the first quarter was $17.2 billion, primarily reflecting investment in our technical infrastructure with the largest component being investment in servers, followed by data centers to support the growth of our business across Google Services, Google Cloud and Google DeepMind. In Q1, we returned value to shareholders in the form of $15.1 billion in share repurchases and $2.4 billion in dividend payments. As we announced today, our Board of Directors declared a 5% increase in our quarterly dividend and also approved and used $70 billion share repurchase authorization. Turning to our outlook. I would like to provide some commentary on several factors that will impact our business performance in the second quarter and the remainder of 2025. First, in terms of revenue, I'll highlight a couple of items that we mentioned last quarter that will have an impact on second quarter and 2025 revenue. First, in Google Services, advertising revenue in 2025 will be impacted by lapping the strength we experienced in the financial service vertical throughout 2024. Second, in Cloud, we're in a tight demand-supply environment. And given that revenues are correlated with the timing of deployment of new capacity, we could see variability in cloud revenue growth rates depending on capacity deployment each quarter. We expect relatively higher capacity deployment towards the end of 2025. Moving to investments, starting with our expectation for CapEx for the full year 2025. We still expect to invest approximately $75 billion in CapEx this year. The expected CapEx investment level may fluctuate from quarter- to-quarter due to the impact of changes in the timing of deliveries and construction schedules. In terms of expenses, first, as I mentioned on our previous earnings call, the significant increase in our investments in CapEx over the past few years will continue to put pressure on the P&L, primarily in the form of higher depreciation. In the first quarter, we saw 31% year-on-year growth in depreciation from the increase in technical infrastructure assets placed in service. Given the increase in CapEx investments over the past few years, we expect the growth rate in depreciation to accelerate throughout 2025. Second, as we've previously said, we expect some headcount growth in 2025 in key investment area. As we've disclosed previously, due to a shift in the timing of our annual employee stock-based compensation award beginning in 2023, our first quarter stock-based comp expenses is relatively lower compared to the remaining quarters of the year. In conclusion, as you heard from Sundar and Philipp, we're pleased with the progress we're making across the organization, the results for the quarter and the opportunities ahead. Our success as a company is grounded in our experience driving advancements in deep computer science that enables us to create innovative new products and services for users, businesses and partners around the world. We have a strong track record of incubating and then building these offerings into new profitable businesses for Alphabet. As we announced last quarter, YouTube and Cloud exited 2024 at a combined annual run rate of $110 billion. And as you heard from Sundar earlier, Waymo has continued to progress in building on its impressive technological achievements to scale rapidly and develop a sustainable business model. Thank you. Sundar, Philipp and I will now take your questions. Question and Answer"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] And our first question comes from Brian Nowak from Morgan Stanley."
    },
    {
      "speaker": "Brian Thomas Nowak",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division I have 2. The first one on sort of the macro advertising backdrop, maybe, Anat, I know it's April 24, and you called out some factors as you're kind of thinking about the second quarter. Any other factors you're seeing in advertising verticals or regions or categories that could be showing any signs of weakness quarter-to-date, so we should think through any other changes from typical seasonality in 2Q '25 versus prior quarters? Then the second one, on Philipp, I think I heard you mention how the volume of commercial queries has increased. Maybe can you just walk us through which of the products are driving that increase in commercial queries? And as you sort of think about the pipeline of Search products, are there any others that you're particularly excited about to kind of continue to drive further commercial query growth throughout '25, '26?"
    },
    {
      "speaker": "Philipp  Schindler",
      "role": "Senior Vice President & Chief Business Officer of Google",
      "text": "Senior Vice President & Chief Business Officer of Google So let me take the first one as well. We saw broad-based strength across ad verticals in Q1, and we saw it -- give you a bit of vertical color here. Search was led, again, by finance, due primarily to ongoing strength in the insurance. Retail, health care and travel were actually also sizable contributors here to growth. With regard to Q2, we're only a few weeks in, so it's really too early to comment. I mean we're obviously not immune to the macro environment. But we wouldn't want to speculate about potential impacts beyond noting that the changes to the de minimis exemption will obviously cause a slight headwind to our ads business in 2025 primarily from APAC-based retailers. And maybe to zoom out, I would say we have a lot of experience in managing through uncertain times, and we focus on helping our customers by providing deep insights into changing consumer behavior that is relevant to their business. Examples are auction dynamics, query trend insights on topics like replacement purchases and so on. So we have a lot of experience in this area. On the commercial query side, look, AI Overviews continue to drive higher satisfaction and search usage. And as I noticed, Q1 was really our largest expansion to date for AI Overviews, both in terms of launching to new users and providing responses for more questions. And that's really the core already of the answer. AI Overviews sits at the center of your question here. And when it comes to other products, look, I don't want to speculate on this, but we're happy with what we're seeing here on AI Overviews, and I'm confident we can expand this to more products over time."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Your next question is from Doug Anmuth from JPMorgan."
    },
    {
      "speaker": "Douglas Till Anmuth",
      "role": "JPMorgan Chase & Co, Research Division",
      "text": "JPMorgan Chase & Co, Research Division Philipp, maybe just to go back to AI Overviews for a moment. Can you just tell us how we should think about the 1.5 billion AI Overviews users just in terms of breadth of rollout? And I know you're saying monetization at approximately the same rate. But what does that mean in terms of click- through rates and conversion? And then Anat, just curious if there have been any changes to Google's approach to durably reengineering the cost base since you've joined? And if macro weakens and you see more of a slowdown, would you expect to find additional opportunities to cut back more on costs?"
    },
    {
      "speaker": "Philipp  Schindler",
      "role": "Senior Vice President & Chief Business Officer of Google",
      "text": "Senior Vice President & Chief Business Officer of Google Yes. Look, on the ads of -- in AI Overviews, last -- late last year, actually, we launched them within the AI Overviews on mobile in the U.S. And this builds on our previous rollout of ads above and below. So this was a change that we have. But as I talked about it before, for AI Overviews overall, we see the monetization at approximately the same rate, which gives us a strong base on which we can innovate even more. So I'm very happy with this. I don't think this is the moment to go into the details of click-through rates and conversion and so on. But overall, we're happy with what we're seeing."
    },
    {
      "speaker": "Anat  Ashkenazi",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO And to your question on our approach to productivity and efficiency, it hasn't really changed. I've mentioned my approach and our approach as a company on -- at the end of 2024. And we're still focused on driving efficiency and productivity throughout the organization, both in our operating expenses and in our CapEx. I've mentioned some of these on my -- during my prepared remarks. But certainly, this helps us, as we think about the investments we need to make in innovation, to drive long-term sustainable growth profile for the company. We're able to repurpose some of these efficiencies into these investments as well as, as you think about the increase in CapEx we've seen over the past several years and what we're investing this year, this will put additional pressure on the income statement in the form of depreciation. So we're working hard to try and offset some of the headwinds. As well as within the CapEx investments themselves, $75 billion, we're looking at how do we make sure every dollar is used efficiently. We have a highly rigorous process to determine the demand behind it and then the allocation of the compute associated with our technical infrastructure investments, ensuring that we're utilizing that appropriately and that we're highly efficient with everything we're doing. You've seen some of the announcement and some of the changes, but we're focusing on continuing to moderate the pace of compensation growth, looking at our real estate footprint and again, the build-out and utilization of our technical infrastructure across the business."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from Eric Sheridan from Goldman Sachs."
    },
    {
      "speaker": "Eric James Sheridan",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division First, maybe for Sundar. When you look across the consumer AI landscape today, how are you thinking about continuing to drive differentiation for Gemini as a platform through the lens of usage, utility or putting product innovation at the forefront of driving consumer habits? And then the second one, maybe for Anat, if the macro environment were to change and become more downwardly volatile, how should investors think about the investments that are must make this year, almost fixed in nature versus where there might be more flexibility to alter the investment priorities of the company if the macro environment were to worsen?"
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director Thanks, Eric. Obviously, it's an exciting moment on the AI front. I think the foundation for everything is obviously the Frontier model progress we are seeing. And particularly with 2.5 Pro and Flash, I think we're well positioned. We are seeing tremendous reception from developers, enterprises and consumers, too. And obviously, we are delivering consumer AI experiences across our product portfolio, including the primary way people experience it is obviously in Search with AI Overviews. And very early days with AI Mode, but that will be a consumer AI-forward experience. And we're already seeing very positive feedback. Queries are -- people are typing in roughly 2x longer queries compared to a traditional search. So there's a lot of excitement there. And in the Gemini app, which you asked about, we've really seen increased momentum, particularly over the last few weeks as we've rolled out not just the newer models, but we are seeing users are really responding well to all the innovation. Gemini Live, which is based on Project Astra, has been very well received. Deep Research, I think, based on 2.5 Pro, is -- that's being well received. And Canvas, we've had a lot of traction as well. And so we are definitely investing more. We have recently organized ourselves better to capitalize on this momentum, and I'm excited about our road map there."
    },
    {
      "speaker": "Anat  Ashkenazi",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO And on the investments this year and overall, should there be any macroeconomic changes, as I said, we're still planning to invest approximately $75 billion in CapEx this year. We do see a tremendous opportunity ahead of us across the organization, whether it's to support Google Services, Google Cloud and Google DeepMind. Recall I've stated on the Q4 call that we exited the year in Cloud specifically with more customer demand than we had capacity. And that was the case this quarter as well. So we want to make sure we ramp up to support customer needs and customer demands. Having said that, we're investing in long term, and we're investing in innovation. That's the essence of our business. And we want to do it in a responsible fashion. So you've seen us over the past couple of years, and we're continuing to do this, and you're seeing this in our results, drive efficiency and productivity throughout the business. And we've announced things such as consolidation of teams, which helps not just with cost, but with velocity and speed. We're able to get things to market faster. So that's one of the areas we're focused on. You heard from Sundar in the last couple of calls on just the rapid pace of innovation we're bringing to the marketplace. So the way we're doing this across the business to drive productivity and efficiency should help us have a more resilient organization irrespective of macroeconomic condition. But certainly, we don't ignore that. We always look at what's happening outside the organization as well as inside, but invest appropriately to drive both the short-term growth as well as the long-term growth."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from Ross Sandler from Barclays."
    },
    {
      "speaker": "Ross Adam Sandler",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division One for Sundar, one for Philipp. Sundar, it was disclosed this week in the trial that's going on that Gemini has 35 million DAUs. And just curious, that number obviously trails ChatGPT by a pretty wide margin. Could you talk about the strategy to get that DAU figure much higher that you guys are deploying? And then Philipp, just curious to hear what you're seeing on the brand advertising side at YouTube in 1Q and into early 2Q. Are brands holding up relatively well, like direct response? Or are they starting to react to some of these macro jitters that we're all experiencing? Any thoughts there?"
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director Thanks, Ross. I think I touched upon this to Eric's question as well, but we are definitely -- I think there's been a lot of momentum in terms of product features we've been introducing. And we are definitely seeing reception, including increased adoption and usage based on those features. So I think we are in a good positive cycle. The recent advances on the model Frontier, by many metrics, I think we have the best model out there now. And I think that's going to drive increased adoption as well. And again, I would reiterate, people are using -- obviously, we have 1.5 billion users through AI Overviews interacting with AI in a deep way in a very engaged way. Obviously, we are innovating with AI Mode. And we have a very exciting road map ahead with the Gemini app as well. So across the board, super excited about what's ahead."
    },
    {
      "speaker": "Philipp  Schindler",
      "role": "Senior Vice President & Chief Business Officer of Google",
      "text": "Senior Vice President & Chief Business Officer of Google And on your brand question, look, brand and, by the way, also direct response had a very solid growth in Q1. Brand advertisers really enjoyed culture moments we had like Coachella, for example, or March Madness. We had strong contributions overall from the finance and retail verticals in Q1 on this side as well. The operating metrics for YouTube were strong in Q1. Watch time growth remains robust, particularly in key monetization opportunity areas such as shorts and living room. It's also, by the way, nice to see the strong position of our creators who obviously benefit from the brand piece, which gives us a lot of confidence when we look at it more closely. And on the Q2 side, I think I mentioned it's too early to really comment on that."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Your next question is from Mark Shmulik from Bernstein."
    },
    {
      "speaker": "Mark Elliott Shmulik",
      "role": "Sanford C. Bernstein & Co., LLC., Research Division",
      "text": "Sanford C. Bernstein & Co., LLC., Research Division Sundar, I appreciate the color on Gemini deployment across kind of the 15 products with 0.5 billion users or more. It would be great to hear more about where you're seeing the most usage and deployment of gen AI internally at Google, perhaps whether the capabilities -- are they in a place today in terms of either supplementing or augmenting the workforce? And then just to build on that earlier AI Mode-type questions. Appreciate AI Mode has 2x longer queries than traditional search, but any color you can share perhaps on how AI Mode behavior differs from how consumers are using the Gemini app?"
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director Look, internally, I mean, this has been an extraordinary amount of focus and excitement both because I think we are -- the early use cases have been transformative in nature and I think this still feels like early days and long ways to go. Obviously, I had mentioned a few months ago in terms of how we are using AI for coding. We're continuing to make a lot of progress there in terms of people using coding suggestions. I think the last time I had said, the number was like 25% of code that's checked in. It involves people accepting AI-suggested solutions. That number is well over 30% now. But more importantly, we have deployed more deeper flows. And particularly with the newer models, I think we are working on early agentic workflows and how we can get those coding experiences to be much deeper. We are deploying it across all parts of the company. Our customer service teams are deeply leading the way there. We've both dramatically enhanced our user experience as well as made it much more efficient to do so. And we are actually bringing all our learnings and expertise in our solutions through cloud to our other customers. But beyond that, all the way from the finance team preparing for this earnings call to everything, it's deeply embedded in everything we do. But I still see it as early days, and there's going to be a lot more to do. On AI Mode, look, I think we are just leaning in on the early positive feedback -- well, as we scaled up AI Overviews. It's been one of our most positive launches. And -- but it's been clear people have wanted even more of it. And so with AI Mode, we are bringing the -- our state-of-the-art Gemini models right into Search. And I mentioned people typing in longer queries. There's a lot more complex, nuanced questions. People are following through more. People are appreciating the clean design, the fast response time and the fact that they can kind of be much more open-ended, can undertake more complicated tasks. Product comparisons, for example, has been a positive one, exploring how tos, planning a trip. So those are the kinds of early feedback we are seeing. And I think we are obviously really focused on improving the product across all of AI Mode, AI Overviews and the Gemini app, and we are seeing positive user traction as well."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Your next question is from Mark Mahaney from Evercore."
    },
    {
      "speaker": "Mark Stephen F. Mahaney",
      "role": "Evercore ISI Institutional Equities, Research Division",
      "text": "Evercore ISI Institutional Equities, Research Division One for Anat and one for Sundar. Anat, getting back to a question, I think, that Doug was asking earlier. You just put up record-high or multiyear record-high margins for both Google Services and for Google Cloud. You talked, though, about depreciation expenses accelerating rapidly throughout the year because of all the investments you've already -- you'd warned people about. Back in the September quarter, you seem relatively confident that you had enough levers to kind of offset kind of rising infrastructure costs. Was that still your -- 6 months later, is that still your view that you've got enough levers that even with the rising infrastructure costs, you can -- there's enough in there to kind of counterbalance that? And then just briefly on Waymo, continues to rise aggressively the numbers, Sundar. The long-term business model for Waymo, is there a reason to make a decision on that soon? Or have you already made the decision of whether this is a long-term licensing model or you really want to run this as a stand-alone ride-sharing, delivery, autonomous vehicle business?"
    },
    {
      "speaker": "Anat  Ashkenazi",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO Thanks. On your first question on profitability and what levers do we have and do we still have levers to pull, first, I think every organization can always push a little further. I don't view productivity goals or efficiency as an episodic, kind of project-based effort, but rather a continuous effort that when you get to a certain place, you push a little further. Having said that, we do have significant investments we're making across the organization, and we have been making them for the past several quarters. And we've been able to do it because we were able to find efficiency to fund those investments across the organization. Those are for products and services that are going to drive long-term growth for the company. So while we're trying to offset as much of the headwind associated with the increase in infrastructure costs, it will become more difficult. As I said, the depreciation will accelerate. We had about a 31% year-over-year growth in depreciation this quarter. And it will be higher as we go throughout the year. So think about that kind of as a headwind that we have to manage against, but we're continuing with pushing across the organization, leveraging, Sundar mentioned, the use of AI and kind of an AI-first Google across several of our functions to help us manage a larger scope of work using our AI, AI agents and AI tools. As Sundar mentioned, we did leverage it in preparation for the earnings call and we're leveraging it across several functions. So there are opportunities, but there are also great opportunities for investment, and we want to make sure that we make room for -- to make these investments to drive long-term growth and ensure we have a very resilient, long-term growth profile for the company."
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director And Mark, thanks. I think this is probably the first question I've got on an earnings call on Waymo. So thank you, and I think it's a sign of its progress. Look, the thing that excites me is I think we've been laser focused and will continue to be on building the world's best driver. And I think doing that well really gives you a variety of optionality in business models across geographies, et cetera. It'll also require a successful ecosystem of partners, and we can't possibly do it all ourselves. And so I'm excited about the progress the teams have made through a variety of partnerships. Obviously, a highlight of it is our partnership with Uber. We are very pleased with what we are already seeing in Austin in terms of rider satisfaction. We look forward to offering the first paid rides in Atlanta via Uber later this year. But we are also building up a network of partners, for example, for maintaining fleets of vehicles and doing all the operations related to that with the recently announced partnership with Moove in Phoenix and Miami, obviously, partnerships with OEMs. There are future optionality around personal ownership as well. So we are widely exploring and -- but at the same time, clearly staying focused on making progress both in terms of safety, the driver experience and progress on the business model and operationally scaling it up."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from Ken Gawrelski from Wells Fargo."
    },
    {
      "speaker": "Kenneth James Gawrelski",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division Two, if I may, please. First, on AI-powered search. You have a number of AI- powered search interfaces, including 3 most prominently, AI Overviews, AI Mode and Gemini. In the future, should we think of these as distinct experiences that will be long-lasting or more experimental now and will -- and Google will eventually focus on one approach going forward? And the second one is more on the financial side. You continue to experience very healthy gross margin expansion. We see the TAC, sure, but you -- Anat, you also talked about the offsetting depreciation expense. Could you talk about beyond those 2 buckets where you're seeing the real savings on the COGS line and driving that gross margin expansion and maybe even how we should be thinking about that going forward?"
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director Okay. Now maybe on AI-powered search and how do we see our consumer experience. Look, I do think Search and Gemini, obviously, will be 2 distinct efforts, right? I think there are obviously some areas of overlap, but they're also -- like expose very, very different use cases. And so for example, in Gemini, we see people iteratively coding and going much deeper on a coding workflow, as an example. So I think both will be around. Within Search, I would think of AI Overviews is scaling up and working for our entire user base, but an AI Mode is the tip of the tree for us pushing forward on an AI-forward experience. There will be things which we discover there, which will make sense in the context of AI Overviews, so I think will flow through to our user base. But you almost want to think of what are the most advanced 1 million people using Search for, the most advanced 10 million people and then how do 1.5 billion people use Search for. And we want to innovate. And so I think this allows us to do that. But the true north through all of this is user feedback, user satisfaction, user experience. And so that will determine where this all works out in the future."
    },
    {
      "speaker": "Anat  Ashkenazi",
      "role": "Senior VP & CFO",
      "text": "Senior VP & CFO And to your question on gross margin, a couple of trends to highlight there. And I've mentioned this in the prepared remarks, you've seen improvement in TAC that's really driven by the change in revenue mix with a continued Search growth and then network revenue declines. Network revenue has a much higher TAC rate. So that mix is helping us from a gross margin perspective. So think about that as well. Now we do have depreciation for technical infrastructure hits in 2 -- primarily in 2 places in the income statement, one is in other cost of sales and the rest is in R&D. So it is in that line item that's impacting cost of sales. Now we've had some efficiencies there, and I did mention the improvement in our overall cost of -- headcount growth and compensation kind of moderating those growth. So that helps us as well more than offset the depreciation increases in Q1. But as I mentioned, this number will be higher in the coming quarters. Recall, we have -- we said approximately $75 billion in CapEx, which is up from $55 billion or just over $50 billion last year. So there is expected to be quite a significant increase in depreciation."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And our last question comes from Ron Josey from Citi."
    },
    {
      "speaker": "Ronald Victor Josey",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division Philipp, I wanted to touch a little bit more on your comments around direct response in YouTube. I think it's been improving and been a driver over the past couple of quarters. I'd love to hear more just about what's driving that. Is that the demand gen and integration with PMax? Or are users perhaps more involved on direct response now that shorts usage is rising? Would love your thoughts there."
    },
    {
      "speaker": "Philipp  Schindler",
      "role": "Senior Vice President & Chief Business Officer of Google",
      "text": "Senior Vice President & Chief Business Officer of Google Yes. I think there's a lot of different factors. Mostly, we continue to help our customers really using our AI-powered tools, you mentioned a few of them, to drive performance. That's a very big one. As I mentioned before, we're also happy with the progress we're seeing on shorts and closing the monetization gap here to the overall business, which is actually really nice to see, especially in the U.S. So we're very happy with that. Yes."
    },
    {
      "speaker": "Sundar  Pichai",
      "role": "CEO & Director",
      "text": "CEO & Director And I'll just chime in to say, YouTube just celebrated its 20th birthday. And we now have more than 20 billion videos on YouTube, and we get 20 million videos uploaded every day. So I think it's a tremendous platform. And thanks to all the creators and users who have supported us there over the years."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "And that concludes our question-and-answer session for today. I would like to turn the conference back over to Jim Friedland for any further remarks. James Friedland Thanks, everyone, for joining us today. We look forward to speaking with you again on our second quarter 2025 call. Thank you, and have a good evening. OperatorThank you, everyone. This concludes today's conference call. Thank you for participating. You may now disconnect. Copyright  2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.  2025 S&P Global Market Intelligence."
    }
  ],
  "source_file": "Alphabet Inc., Q1 2025 Earnings Call, Apr 24, 2025.rtf"
}