{
  "event_id": "MU_2025-09-23",
  "ticker": "MU",
  "company": "Micron Technology, Inc.",
  "quarter": 4,
  "fiscal_year": 2025,
  "call_date": "2025-09-23",
  "call_start_ts": "2025-09-23 22:00:00+00:00",
  "raw_text": "\n|[pic]                     |\n\nMicron Technology, Inc. NasdaqGS:MU\nFQ4 2025 Earnings Call Transcripts\nTuesday, September 23, 2025 10:00 PM GMT\nS&P Global Market Intelligence Estimates\n|      |-FQ4 2025-           |-FQ1  |-FY 2025-            |-FY   |\n|      |                     |2026- |                     |2026- |\n|                              |CONSENSUS      |ACTUAL         |SURPRISE       |\n|                   |CONSENSUS          |ACTUAL             |SURPRISE           |\n|FQ1 2025           |1.77               |1.79               |[pic]1.13 %        |\n|FQ2 2025           |1.42               |1.56               |[pic]9.86 %        |\n|FQ3 2025           |1.59               |1.91               |[pic]20.13 %       |\n|FQ4 2025           |2.86               |3.03               |[pic]5.94 %        |\n\n|Table of Contents                                     |   |\n|Call Participants          |..............................................|3      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Presentation               |..............................................|4      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|Question and Answer        |..............................................|5      |\n|                           |..............................................|       |\n|                           |..............................................|       |\n|                           |..............                                |       |\n|                                                                                  |\n|Call Participants                                                                 |\n|                           |                           |                           |\n|EXECUTIVES                 |                           |                           |\n|                           |Nathaniel Quinn  Bolton    |                           |\n|                           |Needham & Company, LLC,    |                           |\n|Manish H. Bhatia           |Research Division          |                           |\n|Executive Vice President of|                           |                           |\n|Global Operations          |                           |                           |\n|                           |Thomas James O'Malley      |                           |\n|                           |Barclays Bank PLC, Research|                           |\n|Mark J. Murphy             |Division                   |                           |\n|Executive VP & CFO         |                           |                           |\n|                           |                           |                           |\n|                           |Vijay Raghavan Rakesh      |                           |\n|Satya  Kumar               |Mizuho Securities USA LLC, |                           |\n|Corporate VP of Investor   |Research Division          |                           |\n|Relations & Treasurer      |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Sumit Sadana               |                           |                           |\n|Executive VP & Chief       |                           |                           |\n|Business Officer           |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|ANALYSTS                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Aaron Christopher Rakers   |                           |                           |\n|Wells Fargo Securities,    |                           |                           |\n|LLC, Research Division     |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Brian Edward Chin          |                           |                           |\n|Stifel, Nicolaus & Company,|                           |                           |\n|Incorporated, Research     |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Christopher Brett Danely   |                           |                           |\n|Citigroup Inc., Research   |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|James Edward Schneider     |                           |                           |\n|Goldman Sachs Group, Inc., |                           |                           |\n|Research Division          |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|John Nguyen Vinh           |                           |                           |\n|KeyBanc Capital Markets    |                           |                           |\n|Inc., Research Division    |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Joseph Lawrence Moore      |                           |                           |\n|Morgan Stanley, Research   |                           |                           |\n|Division                   |                           |                           |\n|                           |                           |                           |\n|                           |                           |                           |\n|Kevin Edward Cassidy       |                           |                           |\n|Rosenblatt Securities Inc.,|                           |                           |\n|Research Division          |                           |                           |\n|                                                                                  |\n\n\nPresentation\n\n\nOperator\n\nThank you for standing by, and welcome to Micron Technology's Post-Earnings\nAnalyst Conference call. [Operator Instructions]\n\n\nI would now like to hand the call over to Satya Kumar, Investor Relations.\nPlease go ahead.\n\n\nSatya  Kumar\nCorporate VP of Investor Relations & Treasurer\n\nThank you, and welcome to Micron Technology's fiscal fourth quarter 2025\npost-earnings analyst call. On the call with me today are Sumit Sadana,\nMicron's Chief Business Officer; Manish Bhatia, EVP of Global Operations;\nand Mark Murphy, our CFO.\n\n\nAs a reminder, the matters we're discussing today include forward-looking\nstatements regarding market demand and supply, market trends and drivers\nand our expected results and guidance and other matters. These forward-\nlooking statements are subject to risks and uncertainties that may cause\nactual results to differ materially from statements made today. We refer\nyou to documents that we have filed with the SEC, including our most recent\nForm 10-Q and upcoming 10-K for a discussion of risks that may affect our\nresults. Although we believe that the expectations reflected in the forward-\nlooking statements are reasonable, we cannot guarantee future results,\nlevels of activity, performance and achievements. We are under no duty to\nupdate any of the forward-looking statements to conform these statements to\nactual results.\nWith that, we can now open up for Q&A.\n\n\nQuestion and Answer\n\n\nOperator\n\n[Operator Instructions] Our first question comes from the line of Tom\nO'Malley of Barclays.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nMy first one is just on the state of industry of NAND. So over the last\ncouple of weeks, you've heard a lot of reports about hyperscalers stepping\nin, you've heard about tightness, pricing increases. And if you look at\nyour current quarter that you just reported, you had bit down in the\nquarter and then I've tried a couple of different ways here, tell me if I'm\ncrazy, but it seems like you need to have bits down again in your guide to\nkind of get there, so largely driven by ASP. Is that the right way to think\nabout the world right now? And like some of your peers are talking about\nsome bit growth going into the back half. So is that something that you're\ngoing to look to ease up with potentially some capacity additions? Just\nanything that you can comment on to the state of the world right now?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nThis is Sumit. I'll just take the question. So in terms of the NAND\nindustry, I wouldn't read too much into the bits for F Q4. It's really just\nnoise based on just a few things, different segments moving around in our\nmix. So it's really just some mix-driven noise for the various segments.\n\n\nIn terms of the demand profile and what is shaping up looking ahead,\ncertainly, the large hyperscalers are looking like they will be needing a\nsignificantly more storage capability for their AI server deployment\nbecause they have shortages on that side from the HDD segment of the\nmarket. And so the deployment of NAND SSDs and servers and data centers\nmore broadly is going to increase in calendar '26.  So we expect, driven by\nthat tailwind for the NAND industry conditions to start improving.\n\n\nAnd certainly, our position in the data center SSD market where we have\nbeen hitting record share after record share for several years now and have\na really strong position in the market, for us to benefit from that data\ncenter SSD position, competitive position that we have. And we have\nannounced a lot of new products. We have a very exciting portfolio. So we\nexpect to be able to leverage that going forward.\n\n\nSo I think the NAND industry will improve. The improvement in the DRAM\nbusiness is definitely ahead from a time perspective in terms of being\ntight. NAND is improving and getting tighter, but DRAM is tight already\ntoday and getting even tighter going forward.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes, Tom. It's Mark. I would just add on the supply side, to continue. We\nstructurally brought down wafer outs and NAND. We continue to slow node\ntransitions there and pace new node ramps. Still have low levels of CapEx,\nand so we're working down inventories there.\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nI was going to add, we're working down inventories. And now with our\ndecision to exit managed NAND, there will be more supply availability for\nus to focus on the data center market, as Sumit was mentioning.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nHelpful. And then just as a quick follow-up. If I look at the CapEx\nguidance, you're saying kind of annualized Q1, you get to $18 billion. And\nI just want to make sure you're saying that's a net number, so obviously\nsomething higher in aggregate. And in your commentary in the slides, it\nseems like very little additional NAND spend and more on the DRAM side. So\njust on a very high level, I know you're not guiding specifically, should\nwe be taking away from this that you're moving from $13 billion something\nto close to $20 billion something? And that incremental is largely a\nfunction of additional DRAM spend?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes. We're just going to give that number, Tom. So we're saying that we're\ngoing to go from $13 billion to $18 billion net in '25 and net\napproximately $18 billion in '26. And the vast majority of that is for\nDRAM, construction and equipment.\n\n\nOperator\n\nOur next question comes from the line of Joe Moore of Morgan Stanley.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nGreat. Sanjay, early on in the call, talked about taking market share in\nHBM in calendar '26, if I heard him right. But I know that would sort of\nhappen mechanically because you got to your target share towards the end of\nthis year so you would gain share. Can you just talk about what are your\nshare gain aspirations in HBM, if any? Are you content with holding your\nDRAM share? Does that need to go higher?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. In terms of our HBM share, you're right. I mean, we have ramped our\nshare through calendar '26, and we expect to be in the vicinity of our DRAM\nsupply share in calendar Q3 in 2025. So in 2026, for the full calendar\nyear, we will expect to have higher share in HBM compared to calendar '25.\n\n\nHBM has now become a very robust part of our portfolio, and we treat it\nlike any other part of our portfolio where we focus on ROI of the\nportfolio. We focus on deplaned investments. We're focused on getting to be\nthe best from a product perspective and creating that value with our\ncustomers. And then ensuring that we are taking full advantage of the\ncompetitive landscape as it evolves over time. So those are some of the\nthings we do. So we're not going to provide any more specifics beyond that,\nbut that's how we are thinking about it.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nOkay. That's helpful. And then the gross margins in HBM, will that continue\nto be higher than sort of non-HBM DRAM? And if given that you're locked in\nthrough most of 2025 and DDR5 is moving up, is it possible that, that\nchanges? Is that -- could that lock in actually hurt you if DDR5 prices\nrise faster?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean I don't think about the lock-in as \"hurting us\" because the\nbusinesses, the HBM portion of it and the non-HBM DRAM are just different\ntypes of businesses. The HBM business, we are working with customers with\nlong lead times, long order visibility, lock in of volumes, lock in of\npricing well ahead of time, a lot more stable ROI over the years. So that\nkind of a profile is helpful because no matter what the rest of the\nbusiness does, our expectation is that the HBM business will have higher\nthrough-cycle ROI. So we managed that business in that different way. It\ncreates a lot of value for our customers, and we have that expectation of a\nhigher ROI for us in our portfolio.\n\n\nNow will there be times when the rest of the DRAM portfolio will become\nvery profitable and can challenge or even exceed at times the profitability\nof the HBM business? Of course, that is possible and we don't think of that\nas a bad thing. We think of that as a positive thing that the whole\nbusiness has become dramatically better. And so that's how we think of it\nas those outcomes are a good place to be because that means the whole\nindustry is extraordinarily healthy from a supply-demand balance\nperspective, and that helps us drive really robust financial outcomes.\n\n\nOperator\n\nOur next question comes from the line of Jim Schneider of Goldman Sachs.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nTwo quick ones. One follow-up on Joe's question, which is just in general,\ngiven all the performance benefits you talked about relative to your\nposition on the HBM4, would you expect your HBM4 share to be higher than it\nwas for HBM3 in a sustainable way going forward?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nI mean we do feel we have very strong capabilities entering the HBM4\nbusiness. I mean, we certainly believe that we have the best HBM3E product\nin the world with highest performance and 30% lower power consumption than\nany other competitor. What we did not have at the start of the HBM3E\nbusiness ramp though, is that we didn't have that installed capacity and\nthat base capability. We were ramping from very low levels. And now with\nthe very strong performance from our operations team, we have been able to\nget our capacity, our yields, our performance, our quality to extremely\ngood levels. We have met our market share goal that we had articulated many\nquarters ago to you.\n\n\nAnd so we are starting off our HBM4 in a very different position in terms\nof being able to meet the expectations and requirements of our customers\nfrom a volume support perspective. So we feel that from a competitive\npositioning, that aspect of the business is in much better shape. Now with\nHBM4, it is -- there has been a lot of chatter in the market and the media\nabout what is our HBM4 performance compared to those who are doing the base\ntime, the foundry, et cetera. And we just wanted to mentioned and lay some\nof those doubts to rest that we today believe that our HBM4 has the highest\nperformance amongst any competing product out there. And we don't believe\nthat others can match this performance with this level of capability,\nquality, power consumption and so on.\n\n\nAnd so we believe that there will be tremendous customer preference for our\nproducts. Of course, we have increases in our HBM supply that we have\ncreated through our investments and we have confidence that we will sell\nout that supply for calendar '26. And there may be some HBM share shifts\nhappening on the competitive landscape but it is our belief that most of\nthat is most likely going to be between our 2 competitors rather than\nimpacting our share in any material way.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nAnd then as a follow-up on the CapEx side, could you maybe give us some\ncolor on the split of WFE versus facility CapEx you saw in fiscal '25? And\nthen whether we should expect any significant change in that mix heading\ninto next year?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nJim, it's Mark. No, we're not going to provide that breakout, just that the\nvast majority of the spend is for DRAM construction equipment.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nAnd any significant change in the facility piece of that for next year or\nso?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nWe're not going to comment on that. As you know, we're expanding in a\nnumber of sites, including -- we talked about our first fab in Idaho, and\nwe're also equipping those fabs as well. I should say, equipping the fab\nand then also doing tech transitions.\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nYou mean -- sorry, just to be clear, you're saying in Idaho, we're in\nconstruction, we expect production there in second half of '27. But we are\ninvesting in technology transitions and optimizing production across our\nfootprint in Japan and Taiwan, where we have available clean room space.\n\n\nOperator\n\nOur next question comes from the line of Chris Danely of Citi.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nCan you hear me okay?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nSo far.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nI've been having phone problems all day. So a quick clarification. As far\nas the DRAM revs go, you guys gave us the HBM breakout. Can we assume\nroughly the same ratio for DDR4 roughly high single digits and then the\nrest, DDR5? And any commentary on the relative contributions to incremental\ngross margin between, say, DDR5 and HBM?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. So we have said earlier to you that the DDR4 plus LP4 we had provided\nsome guidance earlier. We are pretty close to those levels. I'm not going\nto say that it's going to sustain throughout the fiscal year because the\nmix changes over time. But DDR4 just by itself, not counting LP4 has\nactually been a low single-digit percentage of the business. So it's been\nrelatively small. But we have EOL this, we have extended some of our EOL\ntime line based on extreme shortages at customers. And of course, the\nmargins have become dramatically better as this shortage has continued. But\nyes, I think that's that.\n\n\nI think in terms of the relative margin, if I understood your question\ncorrectly, relative margin between DDR and HBM, we are not going to comment\non that because while the HBM, as I mentioned earlier, they run like 2\ndifferent business models. So while the HBM pricing is set ahead of time\nfor the upcoming calendar year, the pricing on the rest of the DRAM\nportfolio, and of course NAND portfolio also, is moving around based on\nquarterly trends. And we have mentioned to you that the DRAM industry is\ntight.\n\n\nAnd as we get into 2026, we expect it to further tighten due to all of the\nrobust demand that we are seeing and the limits on the supply growth caused\nby a number of factors that were discussed. So we believe that, that\ntightening is going to enable improving pricing and margins on the non-HBM\nportion of the portfolio. So that will move around. So it's not really\npractical or possible to give you sort of a relationship between the 2.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nThat's great. That's still super helpful. And then for my follow-up,\nquestion for Mark on gross margin. So Mark, remember, we had lunch earlier\nthis year, and I asked you about could you guys get back to 50% gross\nmargin? You said it's possible, who knows. It depends on a lot of things.\nIt's going to be tough. And here we are. And now we're going past that. So\ncan you just maybe talk about what changed or what was the key to that? And\nthen what are the limiting factors on gross margin going forward? Is it\njust essentially a function of how many more quarters pricing keeps going\nup? Or is there something else going on as far as mix goes?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nSo Chris, since through the fourth quarter, market conditions continue to\nimprove. And as you know, we updated in mid-August, the 11th, and we\nreported a margin 120 basis points higher than that. update. So prices\ncontinue to improve. The market conditions are very good. very tight on\nDRAM and they've improved in NAND and continue to improve. Yes, the margin\nwe reported is now above where it was in mid fiscal '22 and DRAM margins\nare higher than that mid-'22 period. The operating margin is the highest\nthat it's been since November '18.\n\n\nFrom here, the NAND business can continue to improve. There's been good\nsupply response by us. And we've focused on higher-value SSD products in\nthat business. So while that business is below '22 levels, it can continue\nto improve, and that will help overall margins. And then furthermore, as we\ntalked about, DRAM is very tight now. And incremental supply is --\nmeaningful incremental supply is difficult to bring on. You have a number\nof factors that are structural here. Our inventory levels are low below\ntargets. We've got this extended life on DDR4 LP4, which is constraining\nthe ability to tech node transitions.\n\n\nYou have, obviously, the silicon intensity of HBM as that continues to grow\nquickly. And then incremental capacity, as you know, to bring on a fab\ntakes a long time. And our -- for example, our new fab, Idaho will come on,\nwafer production starts and meaningful wafer production starts in second\nhalf. So that constrained supply focus on diverting bits to the best\nproducts and also our continued good cost improvements, those all offer the\nability to expand margins, and we've indicated that we expect second\nquarter gross margin to be up relative to first.\n\n\nOperator\n\nOur next question comes from the line of Vijay Rakesh of Mizuho.\n\n\nVijay Raghavan Rakesh\nMizuho Securities USA LLC, Research Division\n\nJust a quick question on the DRAM side. I know you mentioned 1-gamma is\nstarting now. But if you look at your 1-beta, which is -- it looks like\nmost of the HBM4 will be on 1-beta as well. Any thoughts on what the mix\nwill be for you, 1-gamma versus 1-beta now versus exiting the year fiscal\n'26 per se?\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nSure. Thanks, Vijay. This is Manish. We are very pleased with 1-gamma ramp.\nWe were able to achieve both mature yield this quarter as well as first\nrevenue shipments into hyperscalers as well as other applications. So we're\nreally, really pleased with how that ramp is going. We expect to be able to\nhave 1-gamma be the primary area where we're going to be -- that's going to\nbe providing us a bit growth for fiscal in terms of supply, and we're going\nto be qualifying across multiple different product areas as we go through\nthe year. We are already at a point where the 1-gamma production plus the 1-\nbeta production are the significant majority of our bid output. And that\nmix will continue to grow towards 1-gamma as we go through calendar year --\nexcuse me, fiscal year '26.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nI would I just maybe add one thing. We talked quite a bit about supply\nconstraints on the last question, and a very important part of our supply\nsolution in '26 is this ramping of 1-gamma, which as Manish said, has been\ndoing very well. And then, Chris, just one additional note on your margin\nquestion is this just improved mix to in our business, the data center and\nthe higher performance requirements of that market, and the favorable\neffect of that on the business.\n\n\nVijay Raghavan Rakesh\nMizuho Securities USA LLC, Research Division\n\nGot it. And then on HBM4, given your higher speeds and lower, power I guess\nit die is bigger to your own logic die, would you expect the margins on\nHBM4 to be better versus HBM3, I guess, equal, high?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean we are very confident in the capabilities of our product. And\ncertainly, the HBM4 cost is higher than the HBM3 cost and the HBM4 price\nwill be meaningfully higher than the HBM3E price. We don't really talk\nabout margins by product line or within the product line, which product has\nwhat kind of relative margin. But overall, for HBM, we certainly expect\nthat we'll have really good ROI capability for many years for the company\nnot just driven by the huge complexity of HBM, but also driven by the\ndramatic value it creates for our customers and our intent to ensure that\nwe are benefiting from providing that value.\n\n\nOperator\n\nOur next question comes from the line of Aaron Rakers of Wells Fargo.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI'll ask 2 as well. I guess kind of building on some of the prior\nquestions. I'm curious, I know, Mark, you had talked about your ability to\nexecute, I think it was high single-digit cost down with HBM in DRAM in\nfiscal '25, and then I think it was teens or something, low teens on NAND.\nI'm curious if as we make these process node transitions as well as G9 and\nNAND, how do you think about the cost down curve as these process nodes\nmaterialize through this next fiscal year?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nJust to be clear, I think on cost downs, we gave for fiscal '25 or slightly\nbetter than high single digits for DRAM front-end ex-HBM and mid-teens for\nNAND. And I think as -- and then for DRAM with HBM down low single-digit\npercentage and NAND cost reductions, low teens. So these are consistent\nwith commentary we've given in the past at that or better.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. Okay. And then I'm curious just like structurally, the NAND market.\nThere's a lot of discussion around these high-cap enterprise SSDs pushing\n250 terabytes and plus. As we look at that market, I'm curious how you guys\nsee the average capacity trending on these AI servers for SSDs? And whether\nwe should really be expecting that to inflect materially higher as we move\nthrough fiscal '26 and some of these high cap drives really hit through\nvolume?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I think the average capacities is going to continue to escalate\nrapidly. We had 60 terabyte drives and then 102 terabyte drives, and we\nhave ourselves announced at our last FMS event 122 terabyte drives, 245\nterabyte drives. And so we are very excited with the demand that we see for\nthese drives, and we do think there will be a meaningful uptake of these\nhigh-capacity drives, and they will drive the average capacities higher.\nAnd I also mentioned that there is expected to be a shortage of hard drive\nstorage for these hyperscalers. And so more meaningful usage of NAND, even\nbeyond previous plans should drive a positive outcome here as well as an\nadded tailwind.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nWhere do you think the average capacity is today per server? Just curious.\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nIt's moving around quite a bit because in any given quarter, the mix of\ngeneral-purpose servers and AI servers keeps changing and AI servers\ngenerally tend to use the highest capacity that is available in very\nmeaningful quantities. So AI servers have been -- there are AI servers that\nare focused on just ensuring a huge amount of capacity, but then with\ndifferent workloads of inference that are also increasing more\nfragmentation is happening in the configurations that are getting shipped.\nBut generally speaking, the highest capacity drives that the industry has\nbeen able to produce do get used by AI servers. So they are going from 100\n-- they're going from 60 terabytes to 120 and actively using a lot of 245\ngoing forward.\n\n\nOperator\n\nOur next question comes from the line of Brian Chin of Stifel.\n\n\nBrian Edward Chin\nStifel, Nicolaus & Company, Incorporated, Research Division\n\nI'll ask a few questions. Maybe I know there's a couple of questions on\ncost down or cost reduction. But I was just curious, you've obviously\ntalked about in the past, HBM3E, some efficiencies you've gained as you've\nkind of moved into relative maturity from where you started. And I know\nyou're not -- you don't want to provide too much detail around pricing in\n2026 for 3E, while your tone does suggest you have -- you should have\nsufficient leverage, I guess, in terms of those negotiations. But I'm\nwondering, is there more efficiency in terms of improvement in assembly and\npackaging yields for 3E that maybe could also help you out a little bit in\nterms of margins, margin profile next year?\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nThanks, Brian. So we are very happy with how the HBM3E 12-high ramp has\ngone. We talked about being able to get our yields to maturity on 12-high\nsignificantly faster than we did on 8-high, which was really our first\nmajor HBM volume node. And we've now gotten production capacity up to\nmeaningful volumes as we kind of gave you. So there will be continued\nopportunity, but I would say that really, the biggest part of that benefit\nand ramp has happened as we've gone through the 12-high over the last\ncouple of quarters.\n\n\nBrian Edward Chin\nStifel, Nicolaus & Company, Incorporated, Research Division\n\nGot it. And I appreciate that. Maybe a quick follow-up. I know there's been\nsome discussion here about sort of your guys reattaining this 50% plus\nblended gross margin first time since 2017, 2018 time frame. I know you\nwouldn't recast or you can't recast cloud and core enterprise server\nrevenue back that far. You did give us sort of the sequential and the year-\nover-year compare today. But those segments are roughly mid-50% of sales\nnow. What roughly did they represent back then? Clearly, it must have been\na much smaller proportion, and that's obviously a structural shift in\nbusiness period-to-period.\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean without giving you specifics for any one particular time line,\nI'll just mention to you that most segments that are part of the TAM over\nthe different time horizons in the past prior to generative AI coming on\nthe scene had peaked around 1/3 of the overall market in terms of segment\nsize, right? So if you think about data center segment or you think about\nthe mobile segment, when they would go into this big spurt, it would peak\naround roughly speaking, give or take, 1/3 of the overall market. And this\ntime around, of course, that pseudo ceiling of 1/3 is no longer in place\nbecause data center has become more than half and continues to outgrow the\nrest of the market. and very robust profitability levels.\n\n\nSo we do think that AI has radically changed the landscape. Not only is the\nmix due to AI growth in the data center across the data center to become a\nmuch larger part of the TAM, but it is also a higher value as well as\nhigher margin opportunity. We did mention that HBM and high-capacity DIMMs,\nand the LP that goes into the data center, these 3 categories alone were\n$10 billion in fiscal '25, so a very large part of our fiscal '25 revenue.\nAnd these are all high value-add portions of the portfolio. This doesn't\neven account for regular DDR5 that is in 64 gigabytes and below type of\nDIMMs that are going into the data center, doesn't account for data center\nSSDs that are part of the data center portfolio.\n\n\nSo there is a lot of that shift that is going on, but it's also a shift\nthat has a lot of legs to continue. And that's also the demand coming from\nthe data center that's creating a lot of this tightness in the industry and\ncausing pricing to -- and enabling us to be able to increase pricing across\nall of the segments of the market, not just the data center. So it's\nhelping the profitability of the entire portfolio of the company, even\nthough it's driven largely from the data center.\n\n\nOperator\n\nOur next question comes from the line of Quinn Bolton of Needham & Company.\n\n\n\nNathaniel Quinn  Bolton\nNeedham & Company, LLC, Research Division\n\nMark, maybe I just missed your answer. I just want to clarify your answer\nto Aaron's question on the cost downs. You did low single digits in DRAM\ninclusive of HBM and low teens in NAND. Did you say that those are good\nranges to think about in '26? Or did you not give a cost-down target for\nfiscal '26?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nWe didn't give a -- we just gave '25.\n\n\nNathaniel Quinn  Bolton\nNeedham & Company, LLC, Research Division\n\nOkay. And then, I guess, maybe just kind of a bigger picture question. As\nyou look at the inferencing market, NVIDIA recently introduced their CPX\nGPU that uses GDDR7 instead of HBM memory and to the extent that, that\narchitecture takes off, do you think that, that lower HBM content on\ninferencing platforms, would that have any impact on your broader outlook\nfor the HBM market over the next few years? Or do you think that, that CPX\narchitecture represents sort of only a small portion of the inference\nmarket?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. As the AI market continues to grow and evolve, it is for sure going to\nhave a lot of different use cases come up a lot of different types of\nworkloads for which optimized architectures would have to be evolved. And\nthis is just another step in that direction. The AI market is going to\nbecome very, very big over time, and it is going to have needs that are not\ngoing to be one size fits all. And that optimization will be necessary to\nscale out the capabilities in a cost-effective way. So certainly, this is\njust one example. There will be more in the future.\n\n\nOne important thing to keep in mind, as all of this happens is that A lot\nof the inferencing workloads tend to be memory-bound workloads. And\nconsequently, as inference becomes larger and larger part of the AI market\nand over time will likely become 80% of the AI market over the years, a lot\nof that being memory bound means customers will be looking for different\narchitectures that increase memory capacity and memory bandwidth. And\ndepending on the latency requirements and time to first token and those\ntypes of different KPIs that these architectures have to hit different\ntypes of solutions will be appropriate for various workloads.\n\n\nAnd we are having a strategy to ensure that we are very strong in HBM as we\nhave discussed at length. We have an industry-leading product with GDDR7.\nWe are the pioneers of LPDRAM in the data center, which is going to be used\nmore and more over time, not just because of its energy efficiency. But\nbecause more industry players are going to, from an ecosystem perspective,\nfrom a enablement perspective, going to start supporting LP over time. So\nall of these capabilities that we have developed that are industry-leading\nwill serve us really well and our intent is to create those high-value\nsolutions across the rich frontier of evolving architectures that our\ncustomers will be driving.\n\n\nOperator\n\nOur next question comes from the line of John Vinh of KeyBanc Capital\nMarkets.\n\n\nJohn Nguyen Vinh\nKeyBanc Capital Markets Inc., Research Division\n\nI just had couple follow-ups. So first on HBM, Sanjay, on the call really\nwent out of his way to kind of say, hey, we can support 2.8 terabytes per\nsecond and 11 gigabits per second. It seems like these performance specs\nare greater than the original JEDEC standards that were set. And it looks\nlike customers are asking for more. I'm just curious why are customers\nincreasing kind of the original specifications for HBM4 and then asking for\nhigher performance?\n\n\nAnd then just a quick housekeeping question for Mark. Just looking at your\nguidance, given the midpoint of all the ranges that you provided, it looks\nlike to get to $3.75 million in EPS, it implies that interest income is\npositive in the quarter. Is that the case of what's implied there?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nI'll just answer the first part of your question and then hand it over to\nMark. In terms of the HBM4 specs and its evolution, no doubt that the JEDEC\nspecs were definitely exceeded by a significant margin by some of the\nnumbers that we have quoted to you today with greater than 11 gigabits per\nsecond in speed and 2.8 terabytes per second of bandwidth. We have sampled\nthese products.\n\n\nCustomers obviously are looking for as much improvement as they can get in\nthe ROI that they can offer to their end customers. That typically means\nthat if there is a way to really drive higher bandwidth. You can increase\nthe tokens. You can reduce the time to first token. You can get to a lower\ncost per token kind of a metric, and that becomes a more attractive\nsolution for their end customers.\n\n\nSo that's really what is happening. But certainly, the HBM4 specs that we\nhave been able to produce will create a new bar for performance that would\nbe needed to really enable these type of high-performing systems. So that's\nreally what has happened on that front, and I'll pass it on to Mark to talk\nabout the second part of your question.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes. John, we do expect net interest to flip the income. We have greater\ncapitalized interest. We have lower debt, we have higher cash balances. All\nthose will flip that line.\n\n\nOperator\n\nOur next question comes from the line of Kevin Cassidy of Rosenblatt\nSecurities.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nYes. With the supply/demand going -- favoring the demand side, is there any\ndiscussions yet for long-term agreements with all of your clients or your\ncustomers?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes, there is certainly interest in some of these agreements, but we have\ncertainly experimented with different types of long-term agreements in the\npast and innovated with some ideas on how to do some of these things. I do\nthink that we are going to be very thoughtful about what we do here and\nwhat term and lifetime of these agreements we sign up for. We also have\nU.S. manufacturing that we are going to be building online. We also have\nchanges that are likely to happen on the landscape due to tariffs, and\nwe'll have to respond to that when they become when they are announced\nSection 232 semiconductor tariffs.\n\n\nSo there's all kinds of reasons to be thoughtful about what happens to\npricing, what happens to how we create value for customers, whether it is\nthrough U.S. manufacturing or product capabilities. And there's also,\nobviously, there's very significant shift towards data center that I had\nbeen describing and you have been watching that's been happening in the mix\nof the overall industry as well as for Micron. So we are being thoughtful\nabout all of these different factors, and we will definitely be leveraging\nthese in the discussions with customers. What that comes out on the other\nend of these, I would rather not speculate at this time.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nYes. Understood. Maybe just a question on your decision to drop the managed\nNAND for the smartphone market. Is there a lower cost supplier out there, a\nnew supplier that is taking that type of business?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nWell, it's not about a lower cost supplier. It's just about, for us, the\nROI in the business. The NAND business ROI is certainly has been for the\npast several years lower than that of DRAM. And our approach has been that\nas we have strengthened our portfolio in NAND, particularly with the growth\nof our data center SSD business, we wanted to leverage that to improve the\noverall portfolio mix. And we determined that the pricing expectations and\nthe level of competitiveness in the mobile NAND market did not lend itself\nfor robust ROI over time. And we determined that it was better to exit that\nand concentrate our resources in other places where we can drive better\nROI.\n\n\nSo one of the things that you have seen us do over time is dramatically\nimprove our product portfolio. And as our portfolio has improved, it has\ngiven us the flexibility that we are now leveraging to mix into those parts\nof the portfolio which offer the highest profitability so we can have a\nbigger share of the industry's profit pool, and that's been our strategy\nnow. We can drive it more aggressively with the improved portfolio that we\nnow have. We have been investing to get these capabilities for several\nyears now, and we are in a good place to be able to leverage it now.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nAnd maybe just to add, to build on Sumit's comments, we don't report or\noperate the business by technology, but we do view that we've completed a\nsecond year of positive free cash flow in NAND.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nOkay. Great. If I'm allowed to ask one more on that. Just your smartphone\ncustomers didn't have a problem with that with but does it affect your DRAM\nsales to them?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nNo. I mean, customers are never happy when your one important supplier is\nleaving a segment. So I wouldn't say that they're happy to see us exit\nthat. But we have a very strong relationship with all of these customers\nand the DRAM business is super critical to them, and they have far fewer\nchoices on the DRAM side compared to what they do on the NAND side. So we\nhave worked with them to transition their products to other suppliers, so\nwe have supported them through that transition on the NAND side. And we\ncontinue to remain very robust suppliers to them on the DRAM side.\n\n\nOperatorThank you. That is all the time we have for our Q&A session. This\nconcludes today's conference call. Thank you for participating. You may now\ndisconnect.\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence.\n\n",
  "presentation_text": "Operator\n\nThank you for standing by, and welcome to Micron Technology's Post-Earnings\nAnalyst Conference call. [Operator Instructions]\n\n\nI would now like to hand the call over to Satya Kumar, Investor Relations.\nPlease go ahead.\n\n\nSatya  Kumar\nCorporate VP of Investor Relations & Treasurer\n\nThank you, and welcome to Micron Technology's fiscal fourth quarter 2025\npost-earnings analyst call. On the call with me today are Sumit Sadana,\nMicron's Chief Business Officer; Manish Bhatia, EVP of Global Operations;\nand Mark Murphy, our CFO.\n\n\nAs a reminder, the matters we're discussing today include forward-looking\nstatements regarding market demand and supply, market trends and drivers\nand our expected results and guidance and other matters. These forward-\nlooking statements are subject to risks and uncertainties that may cause\nactual results to differ materially from statements made today. We refer\nyou to documents that we have filed with the SEC, including our most recent\nForm 10-Q and upcoming 10-K for a discussion of risks that may affect our\nresults. Although we believe that the expectations reflected in the forward-\nlooking statements are reasonable, we cannot guarantee future results,\nlevels of activity, performance and achievements. We are under no duty to\nupdate any of the forward-looking statements to conform these statements to\nactual results.\nWith that, we can now open up for Q&A.",
  "qa_text": "Operator\n\n[Operator Instructions] Our first question comes from the line of Tom\nO'Malley of Barclays.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nMy first one is just on the state of industry of NAND. So over the last\ncouple of weeks, you've heard a lot of reports about hyperscalers stepping\nin, you've heard about tightness, pricing increases. And if you look at\nyour current quarter that you just reported, you had bit down in the\nquarter and then I've tried a couple of different ways here, tell me if I'm\ncrazy, but it seems like you need to have bits down again in your guide to\nkind of get there, so largely driven by ASP. Is that the right way to think\nabout the world right now? And like some of your peers are talking about\nsome bit growth going into the back half. So is that something that you're\ngoing to look to ease up with potentially some capacity additions? Just\nanything that you can comment on to the state of the world right now?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nThis is Sumit. I'll just take the question. So in terms of the NAND\nindustry, I wouldn't read too much into the bits for F Q4. It's really just\nnoise based on just a few things, different segments moving around in our\nmix. So it's really just some mix-driven noise for the various segments.\n\n\nIn terms of the demand profile and what is shaping up looking ahead,\ncertainly, the large hyperscalers are looking like they will be needing a\nsignificantly more storage capability for their AI server deployment\nbecause they have shortages on that side from the HDD segment of the\nmarket. And so the deployment of NAND SSDs and servers and data centers\nmore broadly is going to increase in calendar '26.  So we expect, driven by\nthat tailwind for the NAND industry conditions to start improving.\n\n\nAnd certainly, our position in the data center SSD market where we have\nbeen hitting record share after record share for several years now and have\na really strong position in the market, for us to benefit from that data\ncenter SSD position, competitive position that we have. And we have\nannounced a lot of new products. We have a very exciting portfolio. So we\nexpect to be able to leverage that going forward.\n\n\nSo I think the NAND industry will improve. The improvement in the DRAM\nbusiness is definitely ahead from a time perspective in terms of being\ntight. NAND is improving and getting tighter, but DRAM is tight already\ntoday and getting even tighter going forward.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes, Tom. It's Mark. I would just add on the supply side, to continue. We\nstructurally brought down wafer outs and NAND. We continue to slow node\ntransitions there and pace new node ramps. Still have low levels of CapEx,\nand so we're working down inventories there.\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nI was going to add, we're working down inventories. And now with our\ndecision to exit managed NAND, there will be more supply availability for\nus to focus on the data center market, as Sumit was mentioning.\n\n\nThomas James O'Malley\nBarclays Bank PLC, Research Division\n\nHelpful. And then just as a quick follow-up. If I look at the CapEx\nguidance, you're saying kind of annualized Q1, you get to $18 billion. And\nI just want to make sure you're saying that's a net number, so obviously\nsomething higher in aggregate. And in your commentary in the slides, it\nseems like very little additional NAND spend and more on the DRAM side. So\njust on a very high level, I know you're not guiding specifically, should\nwe be taking away from this that you're moving from $13 billion something\nto close to $20 billion something? And that incremental is largely a\nfunction of additional DRAM spend?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes. We're just going to give that number, Tom. So we're saying that we're\ngoing to go from $13 billion to $18 billion net in '25 and net\napproximately $18 billion in '26. And the vast majority of that is for\nDRAM, construction and equipment.\n\n\nOperator\n\nOur next question comes from the line of Joe Moore of Morgan Stanley.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nGreat. Sanjay, early on in the call, talked about taking market share in\nHBM in calendar '26, if I heard him right. But I know that would sort of\nhappen mechanically because you got to your target share towards the end of\nthis year so you would gain share. Can you just talk about what are your\nshare gain aspirations in HBM, if any? Are you content with holding your\nDRAM share? Does that need to go higher?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. In terms of our HBM share, you're right. I mean, we have ramped our\nshare through calendar '26, and we expect to be in the vicinity of our DRAM\nsupply share in calendar Q3 in 2025. So in 2026, for the full calendar\nyear, we will expect to have higher share in HBM compared to calendar '25.\n\n\nHBM has now become a very robust part of our portfolio, and we treat it\nlike any other part of our portfolio where we focus on ROI of the\nportfolio. We focus on deplaned investments. We're focused on getting to be\nthe best from a product perspective and creating that value with our\ncustomers. And then ensuring that we are taking full advantage of the\ncompetitive landscape as it evolves over time. So those are some of the\nthings we do. So we're not going to provide any more specifics beyond that,\nbut that's how we are thinking about it.\n\n\nJoseph Lawrence Moore\nMorgan Stanley, Research Division\n\nOkay. That's helpful. And then the gross margins in HBM, will that continue\nto be higher than sort of non-HBM DRAM? And if given that you're locked in\nthrough most of 2025 and DDR5 is moving up, is it possible that, that\nchanges? Is that -- could that lock in actually hurt you if DDR5 prices\nrise faster?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean I don't think about the lock-in as \"hurting us\" because the\nbusinesses, the HBM portion of it and the non-HBM DRAM are just different\ntypes of businesses. The HBM business, we are working with customers with\nlong lead times, long order visibility, lock in of volumes, lock in of\npricing well ahead of time, a lot more stable ROI over the years. So that\nkind of a profile is helpful because no matter what the rest of the\nbusiness does, our expectation is that the HBM business will have higher\nthrough-cycle ROI. So we managed that business in that different way. It\ncreates a lot of value for our customers, and we have that expectation of a\nhigher ROI for us in our portfolio.\n\n\nNow will there be times when the rest of the DRAM portfolio will become\nvery profitable and can challenge or even exceed at times the profitability\nof the HBM business? Of course, that is possible and we don't think of that\nas a bad thing. We think of that as a positive thing that the whole\nbusiness has become dramatically better. And so that's how we think of it\nas those outcomes are a good place to be because that means the whole\nindustry is extraordinarily healthy from a supply-demand balance\nperspective, and that helps us drive really robust financial outcomes.\n\n\nOperator\n\nOur next question comes from the line of Jim Schneider of Goldman Sachs.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nTwo quick ones. One follow-up on Joe's question, which is just in general,\ngiven all the performance benefits you talked about relative to your\nposition on the HBM4, would you expect your HBM4 share to be higher than it\nwas for HBM3 in a sustainable way going forward?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nI mean we do feel we have very strong capabilities entering the HBM4\nbusiness. I mean, we certainly believe that we have the best HBM3E product\nin the world with highest performance and 30% lower power consumption than\nany other competitor. What we did not have at the start of the HBM3E\nbusiness ramp though, is that we didn't have that installed capacity and\nthat base capability. We were ramping from very low levels. And now with\nthe very strong performance from our operations team, we have been able to\nget our capacity, our yields, our performance, our quality to extremely\ngood levels. We have met our market share goal that we had articulated many\nquarters ago to you.\n\n\nAnd so we are starting off our HBM4 in a very different position in terms\nof being able to meet the expectations and requirements of our customers\nfrom a volume support perspective. So we feel that from a competitive\npositioning, that aspect of the business is in much better shape. Now with\nHBM4, it is -- there has been a lot of chatter in the market and the media\nabout what is our HBM4 performance compared to those who are doing the base\ntime, the foundry, et cetera. And we just wanted to mentioned and lay some\nof those doubts to rest that we today believe that our HBM4 has the highest\nperformance amongst any competing product out there. And we don't believe\nthat others can match this performance with this level of capability,\nquality, power consumption and so on.\n\n\nAnd so we believe that there will be tremendous customer preference for our\nproducts. Of course, we have increases in our HBM supply that we have\ncreated through our investments and we have confidence that we will sell\nout that supply for calendar '26. And there may be some HBM share shifts\nhappening on the competitive landscape but it is our belief that most of\nthat is most likely going to be between our 2 competitors rather than\nimpacting our share in any material way.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nAnd then as a follow-up on the CapEx side, could you maybe give us some\ncolor on the split of WFE versus facility CapEx you saw in fiscal '25? And\nthen whether we should expect any significant change in that mix heading\ninto next year?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nJim, it's Mark. No, we're not going to provide that breakout, just that the\nvast majority of the spend is for DRAM construction equipment.\n\n\nJames Edward Schneider\nGoldman Sachs Group, Inc., Research Division\n\nAnd any significant change in the facility piece of that for next year or\nso?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nWe're not going to comment on that. As you know, we're expanding in a\nnumber of sites, including -- we talked about our first fab in Idaho, and\nwe're also equipping those fabs as well. I should say, equipping the fab\nand then also doing tech transitions.\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nYou mean -- sorry, just to be clear, you're saying in Idaho, we're in\nconstruction, we expect production there in second half of '27. But we are\ninvesting in technology transitions and optimizing production across our\nfootprint in Japan and Taiwan, where we have available clean room space.\n\n\nOperator\n\nOur next question comes from the line of Chris Danely of Citi.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nCan you hear me okay?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nSo far.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nI've been having phone problems all day. So a quick clarification. As far\nas the DRAM revs go, you guys gave us the HBM breakout. Can we assume\nroughly the same ratio for DDR4 roughly high single digits and then the\nrest, DDR5? And any commentary on the relative contributions to incremental\ngross margin between, say, DDR5 and HBM?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. So we have said earlier to you that the DDR4 plus LP4 we had provided\nsome guidance earlier. We are pretty close to those levels. I'm not going\nto say that it's going to sustain throughout the fiscal year because the\nmix changes over time. But DDR4 just by itself, not counting LP4 has\nactually been a low single-digit percentage of the business. So it's been\nrelatively small. But we have EOL this, we have extended some of our EOL\ntime line based on extreme shortages at customers. And of course, the\nmargins have become dramatically better as this shortage has continued. But\nyes, I think that's that.\n\n\nI think in terms of the relative margin, if I understood your question\ncorrectly, relative margin between DDR and HBM, we are not going to comment\non that because while the HBM, as I mentioned earlier, they run like 2\ndifferent business models. So while the HBM pricing is set ahead of time\nfor the upcoming calendar year, the pricing on the rest of the DRAM\nportfolio, and of course NAND portfolio also, is moving around based on\nquarterly trends. And we have mentioned to you that the DRAM industry is\ntight.\n\n\nAnd as we get into 2026, we expect it to further tighten due to all of the\nrobust demand that we are seeing and the limits on the supply growth caused\nby a number of factors that were discussed. So we believe that, that\ntightening is going to enable improving pricing and margins on the non-HBM\nportion of the portfolio. So that will move around. So it's not really\npractical or possible to give you sort of a relationship between the 2.\n\n\nChristopher Brett Danely\nCitigroup Inc., Research Division\n\nThat's great. That's still super helpful. And then for my follow-up,\nquestion for Mark on gross margin. So Mark, remember, we had lunch earlier\nthis year, and I asked you about could you guys get back to 50% gross\nmargin? You said it's possible, who knows. It depends on a lot of things.\nIt's going to be tough. And here we are. And now we're going past that. So\ncan you just maybe talk about what changed or what was the key to that? And\nthen what are the limiting factors on gross margin going forward? Is it\njust essentially a function of how many more quarters pricing keeps going\nup? Or is there something else going on as far as mix goes?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nSo Chris, since through the fourth quarter, market conditions continue to\nimprove. And as you know, we updated in mid-August, the 11th, and we\nreported a margin 120 basis points higher than that. update. So prices\ncontinue to improve. The market conditions are very good. very tight on\nDRAM and they've improved in NAND and continue to improve. Yes, the margin\nwe reported is now above where it was in mid fiscal '22 and DRAM margins\nare higher than that mid-'22 period. The operating margin is the highest\nthat it's been since November '18.\n\n\nFrom here, the NAND business can continue to improve. There's been good\nsupply response by us. And we've focused on higher-value SSD products in\nthat business. So while that business is below '22 levels, it can continue\nto improve, and that will help overall margins. And then furthermore, as we\ntalked about, DRAM is very tight now. And incremental supply is --\nmeaningful incremental supply is difficult to bring on. You have a number\nof factors that are structural here. Our inventory levels are low below\ntargets. We've got this extended life on DDR4 LP4, which is constraining\nthe ability to tech node transitions.\n\n\nYou have, obviously, the silicon intensity of HBM as that continues to grow\nquickly. And then incremental capacity, as you know, to bring on a fab\ntakes a long time. And our -- for example, our new fab, Idaho will come on,\nwafer production starts and meaningful wafer production starts in second\nhalf. So that constrained supply focus on diverting bits to the best\nproducts and also our continued good cost improvements, those all offer the\nability to expand margins, and we've indicated that we expect second\nquarter gross margin to be up relative to first.\n\n\nOperator\n\nOur next question comes from the line of Vijay Rakesh of Mizuho.\n\n\nVijay Raghavan Rakesh\nMizuho Securities USA LLC, Research Division\n\nJust a quick question on the DRAM side. I know you mentioned 1-gamma is\nstarting now. But if you look at your 1-beta, which is -- it looks like\nmost of the HBM4 will be on 1-beta as well. Any thoughts on what the mix\nwill be for you, 1-gamma versus 1-beta now versus exiting the year fiscal\n'26 per se?\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nSure. Thanks, Vijay. This is Manish. We are very pleased with 1-gamma ramp.\nWe were able to achieve both mature yield this quarter as well as first\nrevenue shipments into hyperscalers as well as other applications. So we're\nreally, really pleased with how that ramp is going. We expect to be able to\nhave 1-gamma be the primary area where we're going to be -- that's going to\nbe providing us a bit growth for fiscal in terms of supply, and we're going\nto be qualifying across multiple different product areas as we go through\nthe year. We are already at a point where the 1-gamma production plus the 1-\nbeta production are the significant majority of our bid output. And that\nmix will continue to grow towards 1-gamma as we go through calendar year --\nexcuse me, fiscal year '26.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nI would I just maybe add one thing. We talked quite a bit about supply\nconstraints on the last question, and a very important part of our supply\nsolution in '26 is this ramping of 1-gamma, which as Manish said, has been\ndoing very well. And then, Chris, just one additional note on your margin\nquestion is this just improved mix to in our business, the data center and\nthe higher performance requirements of that market, and the favorable\neffect of that on the business.\n\n\nVijay Raghavan Rakesh\nMizuho Securities USA LLC, Research Division\n\nGot it. And then on HBM4, given your higher speeds and lower, power I guess\nit die is bigger to your own logic die, would you expect the margins on\nHBM4 to be better versus HBM3, I guess, equal, high?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean we are very confident in the capabilities of our product. And\ncertainly, the HBM4 cost is higher than the HBM3 cost and the HBM4 price\nwill be meaningfully higher than the HBM3E price. We don't really talk\nabout margins by product line or within the product line, which product has\nwhat kind of relative margin. But overall, for HBM, we certainly expect\nthat we'll have really good ROI capability for many years for the company\nnot just driven by the huge complexity of HBM, but also driven by the\ndramatic value it creates for our customers and our intent to ensure that\nwe are benefiting from providing that value.\n\n\nOperator\n\nOur next question comes from the line of Aaron Rakers of Wells Fargo.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nI'll ask 2 as well. I guess kind of building on some of the prior\nquestions. I'm curious, I know, Mark, you had talked about your ability to\nexecute, I think it was high single-digit cost down with HBM in DRAM in\nfiscal '25, and then I think it was teens or something, low teens on NAND.\nI'm curious if as we make these process node transitions as well as G9 and\nNAND, how do you think about the cost down curve as these process nodes\nmaterialize through this next fiscal year?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nJust to be clear, I think on cost downs, we gave for fiscal '25 or slightly\nbetter than high single digits for DRAM front-end ex-HBM and mid-teens for\nNAND. And I think as -- and then for DRAM with HBM down low single-digit\npercentage and NAND cost reductions, low teens. So these are consistent\nwith commentary we've given in the past at that or better.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nYes. Okay. And then I'm curious just like structurally, the NAND market.\nThere's a lot of discussion around these high-cap enterprise SSDs pushing\n250 terabytes and plus. As we look at that market, I'm curious how you guys\nsee the average capacity trending on these AI servers for SSDs? And whether\nwe should really be expecting that to inflect materially higher as we move\nthrough fiscal '26 and some of these high cap drives really hit through\nvolume?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I think the average capacities is going to continue to escalate\nrapidly. We had 60 terabyte drives and then 102 terabyte drives, and we\nhave ourselves announced at our last FMS event 122 terabyte drives, 245\nterabyte drives. And so we are very excited with the demand that we see for\nthese drives, and we do think there will be a meaningful uptake of these\nhigh-capacity drives, and they will drive the average capacities higher.\nAnd I also mentioned that there is expected to be a shortage of hard drive\nstorage for these hyperscalers. And so more meaningful usage of NAND, even\nbeyond previous plans should drive a positive outcome here as well as an\nadded tailwind.\n\n\nAaron Christopher Rakers\nWells Fargo Securities, LLC, Research Division\n\nWhere do you think the average capacity is today per server? Just curious.\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nIt's moving around quite a bit because in any given quarter, the mix of\ngeneral-purpose servers and AI servers keeps changing and AI servers\ngenerally tend to use the highest capacity that is available in very\nmeaningful quantities. So AI servers have been -- there are AI servers that\nare focused on just ensuring a huge amount of capacity, but then with\ndifferent workloads of inference that are also increasing more\nfragmentation is happening in the configurations that are getting shipped.\nBut generally speaking, the highest capacity drives that the industry has\nbeen able to produce do get used by AI servers. So they are going from 100\n-- they're going from 60 terabytes to 120 and actively using a lot of 245\ngoing forward.\n\n\nOperator\n\nOur next question comes from the line of Brian Chin of Stifel.\n\n\nBrian Edward Chin\nStifel, Nicolaus & Company, Incorporated, Research Division\n\nI'll ask a few questions. Maybe I know there's a couple of questions on\ncost down or cost reduction. But I was just curious, you've obviously\ntalked about in the past, HBM3E, some efficiencies you've gained as you've\nkind of moved into relative maturity from where you started. And I know\nyou're not -- you don't want to provide too much detail around pricing in\n2026 for 3E, while your tone does suggest you have -- you should have\nsufficient leverage, I guess, in terms of those negotiations. But I'm\nwondering, is there more efficiency in terms of improvement in assembly and\npackaging yields for 3E that maybe could also help you out a little bit in\nterms of margins, margin profile next year?\n\n\nManish H. Bhatia\nExecutive Vice President of Global Operations\n\nThanks, Brian. So we are very happy with how the HBM3E 12-high ramp has\ngone. We talked about being able to get our yields to maturity on 12-high\nsignificantly faster than we did on 8-high, which was really our first\nmajor HBM volume node. And we've now gotten production capacity up to\nmeaningful volumes as we kind of gave you. So there will be continued\nopportunity, but I would say that really, the biggest part of that benefit\nand ramp has happened as we've gone through the 12-high over the last\ncouple of quarters.\n\n\nBrian Edward Chin\nStifel, Nicolaus & Company, Incorporated, Research Division\n\nGot it. And I appreciate that. Maybe a quick follow-up. I know there's been\nsome discussion here about sort of your guys reattaining this 50% plus\nblended gross margin first time since 2017, 2018 time frame. I know you\nwouldn't recast or you can't recast cloud and core enterprise server\nrevenue back that far. You did give us sort of the sequential and the year-\nover-year compare today. But those segments are roughly mid-50% of sales\nnow. What roughly did they represent back then? Clearly, it must have been\na much smaller proportion, and that's obviously a structural shift in\nbusiness period-to-period.\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. I mean without giving you specifics for any one particular time line,\nI'll just mention to you that most segments that are part of the TAM over\nthe different time horizons in the past prior to generative AI coming on\nthe scene had peaked around 1/3 of the overall market in terms of segment\nsize, right? So if you think about data center segment or you think about\nthe mobile segment, when they would go into this big spurt, it would peak\naround roughly speaking, give or take, 1/3 of the overall market. And this\ntime around, of course, that pseudo ceiling of 1/3 is no longer in place\nbecause data center has become more than half and continues to outgrow the\nrest of the market. and very robust profitability levels.\n\n\nSo we do think that AI has radically changed the landscape. Not only is the\nmix due to AI growth in the data center across the data center to become a\nmuch larger part of the TAM, but it is also a higher value as well as\nhigher margin opportunity. We did mention that HBM and high-capacity DIMMs,\nand the LP that goes into the data center, these 3 categories alone were\n$10 billion in fiscal '25, so a very large part of our fiscal '25 revenue.\nAnd these are all high value-add portions of the portfolio. This doesn't\neven account for regular DDR5 that is in 64 gigabytes and below type of\nDIMMs that are going into the data center, doesn't account for data center\nSSDs that are part of the data center portfolio.\n\n\nSo there is a lot of that shift that is going on, but it's also a shift\nthat has a lot of legs to continue. And that's also the demand coming from\nthe data center that's creating a lot of this tightness in the industry and\ncausing pricing to -- and enabling us to be able to increase pricing across\nall of the segments of the market, not just the data center. So it's\nhelping the profitability of the entire portfolio of the company, even\nthough it's driven largely from the data center.\n\n\nOperator\n\nOur next question comes from the line of Quinn Bolton of Needham & Company.\n\n\n\nNathaniel Quinn  Bolton\nNeedham & Company, LLC, Research Division\n\nMark, maybe I just missed your answer. I just want to clarify your answer\nto Aaron's question on the cost downs. You did low single digits in DRAM\ninclusive of HBM and low teens in NAND. Did you say that those are good\nranges to think about in '26? Or did you not give a cost-down target for\nfiscal '26?\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nWe didn't give a -- we just gave '25.\n\n\nNathaniel Quinn  Bolton\nNeedham & Company, LLC, Research Division\n\nOkay. And then, I guess, maybe just kind of a bigger picture question. As\nyou look at the inferencing market, NVIDIA recently introduced their CPX\nGPU that uses GDDR7 instead of HBM memory and to the extent that, that\narchitecture takes off, do you think that, that lower HBM content on\ninferencing platforms, would that have any impact on your broader outlook\nfor the HBM market over the next few years? Or do you think that, that CPX\narchitecture represents sort of only a small portion of the inference\nmarket?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes. As the AI market continues to grow and evolve, it is for sure going to\nhave a lot of different use cases come up a lot of different types of\nworkloads for which optimized architectures would have to be evolved. And\nthis is just another step in that direction. The AI market is going to\nbecome very, very big over time, and it is going to have needs that are not\ngoing to be one size fits all. And that optimization will be necessary to\nscale out the capabilities in a cost-effective way. So certainly, this is\njust one example. There will be more in the future.\n\n\nOne important thing to keep in mind, as all of this happens is that A lot\nof the inferencing workloads tend to be memory-bound workloads. And\nconsequently, as inference becomes larger and larger part of the AI market\nand over time will likely become 80% of the AI market over the years, a lot\nof that being memory bound means customers will be looking for different\narchitectures that increase memory capacity and memory bandwidth. And\ndepending on the latency requirements and time to first token and those\ntypes of different KPIs that these architectures have to hit different\ntypes of solutions will be appropriate for various workloads.\n\n\nAnd we are having a strategy to ensure that we are very strong in HBM as we\nhave discussed at length. We have an industry-leading product with GDDR7.\nWe are the pioneers of LPDRAM in the data center, which is going to be used\nmore and more over time, not just because of its energy efficiency. But\nbecause more industry players are going to, from an ecosystem perspective,\nfrom a enablement perspective, going to start supporting LP over time. So\nall of these capabilities that we have developed that are industry-leading\nwill serve us really well and our intent is to create those high-value\nsolutions across the rich frontier of evolving architectures that our\ncustomers will be driving.\n\n\nOperator\n\nOur next question comes from the line of John Vinh of KeyBanc Capital\nMarkets.\n\n\nJohn Nguyen Vinh\nKeyBanc Capital Markets Inc., Research Division\n\nI just had couple follow-ups. So first on HBM, Sanjay, on the call really\nwent out of his way to kind of say, hey, we can support 2.8 terabytes per\nsecond and 11 gigabits per second. It seems like these performance specs\nare greater than the original JEDEC standards that were set. And it looks\nlike customers are asking for more. I'm just curious why are customers\nincreasing kind of the original specifications for HBM4 and then asking for\nhigher performance?\n\n\nAnd then just a quick housekeeping question for Mark. Just looking at your\nguidance, given the midpoint of all the ranges that you provided, it looks\nlike to get to $3.75 million in EPS, it implies that interest income is\npositive in the quarter. Is that the case of what's implied there?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nI'll just answer the first part of your question and then hand it over to\nMark. In terms of the HBM4 specs and its evolution, no doubt that the JEDEC\nspecs were definitely exceeded by a significant margin by some of the\nnumbers that we have quoted to you today with greater than 11 gigabits per\nsecond in speed and 2.8 terabytes per second of bandwidth. We have sampled\nthese products.\n\n\nCustomers obviously are looking for as much improvement as they can get in\nthe ROI that they can offer to their end customers. That typically means\nthat if there is a way to really drive higher bandwidth. You can increase\nthe tokens. You can reduce the time to first token. You can get to a lower\ncost per token kind of a metric, and that becomes a more attractive\nsolution for their end customers.\n\n\nSo that's really what is happening. But certainly, the HBM4 specs that we\nhave been able to produce will create a new bar for performance that would\nbe needed to really enable these type of high-performing systems. So that's\nreally what has happened on that front, and I'll pass it on to Mark to talk\nabout the second part of your question.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nYes. John, we do expect net interest to flip the income. We have greater\ncapitalized interest. We have lower debt, we have higher cash balances. All\nthose will flip that line.\n\n\nOperator\n\nOur next question comes from the line of Kevin Cassidy of Rosenblatt\nSecurities.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nYes. With the supply/demand going -- favoring the demand side, is there any\ndiscussions yet for long-term agreements with all of your clients or your\ncustomers?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nYes, there is certainly interest in some of these agreements, but we have\ncertainly experimented with different types of long-term agreements in the\npast and innovated with some ideas on how to do some of these things. I do\nthink that we are going to be very thoughtful about what we do here and\nwhat term and lifetime of these agreements we sign up for. We also have\nU.S. manufacturing that we are going to be building online. We also have\nchanges that are likely to happen on the landscape due to tariffs, and\nwe'll have to respond to that when they become when they are announced\nSection 232 semiconductor tariffs.\n\n\nSo there's all kinds of reasons to be thoughtful about what happens to\npricing, what happens to how we create value for customers, whether it is\nthrough U.S. manufacturing or product capabilities. And there's also,\nobviously, there's very significant shift towards data center that I had\nbeen describing and you have been watching that's been happening in the mix\nof the overall industry as well as for Micron. So we are being thoughtful\nabout all of these different factors, and we will definitely be leveraging\nthese in the discussions with customers. What that comes out on the other\nend of these, I would rather not speculate at this time.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nYes. Understood. Maybe just a question on your decision to drop the managed\nNAND for the smartphone market. Is there a lower cost supplier out there, a\nnew supplier that is taking that type of business?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nWell, it's not about a lower cost supplier. It's just about, for us, the\nROI in the business. The NAND business ROI is certainly has been for the\npast several years lower than that of DRAM. And our approach has been that\nas we have strengthened our portfolio in NAND, particularly with the growth\nof our data center SSD business, we wanted to leverage that to improve the\noverall portfolio mix. And we determined that the pricing expectations and\nthe level of competitiveness in the mobile NAND market did not lend itself\nfor robust ROI over time. And we determined that it was better to exit that\nand concentrate our resources in other places where we can drive better\nROI.\n\n\nSo one of the things that you have seen us do over time is dramatically\nimprove our product portfolio. And as our portfolio has improved, it has\ngiven us the flexibility that we are now leveraging to mix into those parts\nof the portfolio which offer the highest profitability so we can have a\nbigger share of the industry's profit pool, and that's been our strategy\nnow. We can drive it more aggressively with the improved portfolio that we\nnow have. We have been investing to get these capabilities for several\nyears now, and we are in a good place to be able to leverage it now.\n\n\nMark J. Murphy\nExecutive VP & CFO\n\nAnd maybe just to add, to build on Sumit's comments, we don't report or\noperate the business by technology, but we do view that we've completed a\nsecond year of positive free cash flow in NAND.\n\n\nKevin Edward Cassidy\nRosenblatt Securities Inc., Research Division\n\nOkay. Great. If I'm allowed to ask one more on that. Just your smartphone\ncustomers didn't have a problem with that with but does it affect your DRAM\nsales to them?\n\n\nSumit Sadana\nExecutive VP & Chief Business Officer\n\nNo. I mean, customers are never happy when your one important supplier is\nleaving a segment. So I wouldn't say that they're happy to see us exit\nthat. But we have a very strong relationship with all of these customers\nand the DRAM business is super critical to them, and they have far fewer\nchoices on the DRAM side compared to what they do on the NAND side. So we\nhave worked with them to transition their products to other suppliers, so\nwe have supported them through that transition on the NAND side. And we\ncontinue to remain very robust suppliers to them on the DRAM side.\n\n\nOperatorThank you. That is all the time we have for our Q&A session. This\nconcludes today's conference call. Thank you for participating. You may now\ndisconnect.\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P\nGlobal Inc. All rights reserved.\n\n\nThese materials have been prepared solely for information purposes based\nupon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-\nrelated analyses and data, research, model, software or other application\nor output therefrom) or any part thereof (Content) may be modified, reverse\nengineered, reproduced or distributed in any form by any means, or stored\nin a database or retrieval system, without the prior written permission of\nS&P Global Market Intelligence or its affiliates (collectively, S&P\nGlobal). The Content shall not be used for any unlawful or unauthorized\npurposes. S&P Global and any third-party providers, (collectively S&P\nGlobal Parties) do not guarantee the accuracy, completeness, timeliness or\navailability of the Content. S&P Global Parties are not responsible for any\nerrors or omissions, regardless of the cause, for the results obtained from\nthe use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P\nGLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS\nFOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR\nDEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE\nCONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no\nevent shall S&P Global Parties be liable to any party for any direct,\nindirect, incidental, exemplary, compensatory, punitive, special or\nconsequential damages, costs, expenses, legal fees, or losses (including,\nwithout limitation, lost income or lost profits and opportunity costs or\nlosses caused by negligence) in connection with any use of the Content even\nif advised of the possibility of such damages. S&P Global Market\nIntelligence's opinions, quotes and credit-related and other analyses are\nstatements of opinion as of the date they are expressed and not statements\nof fact or recommendations to purchase, hold, or sell any securities or to\nmake any investment decisions, and do not address the suitability of any\nsecurity. S&P Global Market Intelligence may provide index data. Direct\ninvestment in an index is not possible. Exposure to an asset class\nrepresented by an index is available through investable instruments based\non that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content\nshould not be relied on and is not a substitute for the skill, judgment and\nexperience of the user, its management, employees, advisors and/or clients\nwhen making investment and other business decisions. S&P Global Market\nIntelligence does not act as a fiduciary or an investment advisor except\nwhere registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence\nand objectivity of their respective activities. As a result, certain\ndivisions of S&P Global may have information that is not available to other\nS&P Global divisions. S&P Global has established policies and procedures to\nmaintain the confidentiality of certain nonpublic information received in\nconnection with each analytical process.\n\n\nS&P Global may receive compensation for its ratings and certain analyses,\nnormally from issuers or underwriters of securities or from obligors. S&P\nGlobal reserves the right to disseminate its opinions and analyses. S&P\nGlobal's public ratings and analyses are made available on its Web sites,\nwww.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and\nwww.globalcreditportal.com (subscription), and may be distributed through\nother means, including via S&P Global publications and third-party\nredistributors. Additional information about our ratings fees is available\nat www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence.",
  "has_qa": 1,
  "speaker_turns": [
    {
      "speaker": "Unknown",
      "role": "",
      "text": "Micron Technology, Inc. NasdaqGS:MU FQ4 2025 Earnings Call Transcripts Tuesday, September 23, 2025 10:00 PM GMT S&P Global Market Intelligence Estimates Presentation"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Thank you for standing by, and welcome to Micron Technology's Post-Earnings Analyst Conference call. [Operator Instructions] I would now like to hand the call over to Satya Kumar, Investor Relations. Please go ahead."
    },
    {
      "speaker": "Satya  Kumar",
      "role": "Corporate VP of Investor Relations & Treasurer",
      "text": "Corporate VP of Investor Relations & Treasurer Thank you, and welcome to Micron Technology's fiscal fourth quarter 2025 post-earnings analyst call. On the call with me today are Sumit Sadana, Micron's Chief Business Officer; Manish Bhatia, EVP of Global Operations; and Mark Murphy, our CFO. As a reminder, the matters we're discussing today include forward-looking statements regarding market demand and supply, market trends and drivers and our expected results and guidance and other matters. These forward- looking statements are subject to risks and uncertainties that may cause actual results to differ materially from statements made today. We refer you to documents that we have filed with the SEC, including our most recent Form 10-Q and upcoming 10-K for a discussion of risks that may affect our results. Although we believe that the expectations reflected in the forward- looking statements are reasonable, we cannot guarantee future results, levels of activity, performance and achievements. We are under no duty to update any of the forward-looking statements to conform these statements to actual results. With that, we can now open up for Q&A. Question and Answer"
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "[Operator Instructions] Our first question comes from the line of Tom O'Malley of Barclays."
    },
    {
      "speaker": "Thomas James O'Malley",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division My first one is just on the state of industry of NAND. So over the last couple of weeks, you've heard a lot of reports about hyperscalers stepping in, you've heard about tightness, pricing increases. And if you look at your current quarter that you just reported, you had bit down in the quarter and then I've tried a couple of different ways here, tell me if I'm crazy, but it seems like you need to have bits down again in your guide to kind of get there, so largely driven by ASP. Is that the right way to think about the world right now? And like some of your peers are talking about some bit growth going into the back half. So is that something that you're going to look to ease up with potentially some capacity additions? Just anything that you can comment on to the state of the world right now?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer This is Sumit. I'll just take the question. So in terms of the NAND industry, I wouldn't read too much into the bits for F Q4. It's really just noise based on just a few things, different segments moving around in our mix. So it's really just some mix-driven noise for the various segments. In terms of the demand profile and what is shaping up looking ahead, certainly, the large hyperscalers are looking like they will be needing a significantly more storage capability for their AI server deployment because they have shortages on that side from the HDD segment of the market. And so the deployment of NAND SSDs and servers and data centers more broadly is going to increase in calendar '26.  So we expect, driven by that tailwind for the NAND industry conditions to start improving. And certainly, our position in the data center SSD market where we have been hitting record share after record share for several years now and have a really strong position in the market, for us to benefit from that data center SSD position, competitive position that we have. And we have announced a lot of new products. We have a very exciting portfolio. So we expect to be able to leverage that going forward. So I think the NAND industry will improve. The improvement in the DRAM business is definitely ahead from a time perspective in terms of being tight. NAND is improving and getting tighter, but DRAM is tight already today and getting even tighter going forward."
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Yes, Tom. It's Mark. I would just add on the supply side, to continue. We structurally brought down wafer outs and NAND. We continue to slow node transitions there and pace new node ramps. Still have low levels of CapEx, and so we're working down inventories there."
    },
    {
      "speaker": "Manish H. Bhatia",
      "role": "Executive Vice President of Global Operations",
      "text": "Executive Vice President of Global Operations I was going to add, we're working down inventories. And now with our decision to exit managed NAND, there will be more supply availability for us to focus on the data center market, as Sumit was mentioning."
    },
    {
      "speaker": "Thomas James O'Malley",
      "role": "Barclays Bank PLC, Research Division",
      "text": "Barclays Bank PLC, Research Division Helpful. And then just as a quick follow-up. If I look at the CapEx guidance, you're saying kind of annualized Q1, you get to $18 billion. And I just want to make sure you're saying that's a net number, so obviously something higher in aggregate. And in your commentary in the slides, it seems like very little additional NAND spend and more on the DRAM side. So just on a very high level, I know you're not guiding specifically, should we be taking away from this that you're moving from $13 billion something to close to $20 billion something? And that incremental is largely a function of additional DRAM spend?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Yes. We're just going to give that number, Tom. So we're saying that we're going to go from $13 billion to $18 billion net in '25 and net approximately $18 billion in '26. And the vast majority of that is for DRAM, construction and equipment."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Joe Moore of Morgan Stanley."
    },
    {
      "speaker": "Joseph Lawrence Moore",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Great. Sanjay, early on in the call, talked about taking market share in HBM in calendar '26, if I heard him right. But I know that would sort of happen mechanically because you got to your target share towards the end of this year so you would gain share. Can you just talk about what are your share gain aspirations in HBM, if any? Are you content with holding your DRAM share? Does that need to go higher?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. In terms of our HBM share, you're right. I mean, we have ramped our share through calendar '26, and we expect to be in the vicinity of our DRAM supply share in calendar Q3 in 2025. So in 2026, for the full calendar year, we will expect to have higher share in HBM compared to calendar '25. HBM has now become a very robust part of our portfolio, and we treat it like any other part of our portfolio where we focus on ROI of the portfolio. We focus on deplaned investments. We're focused on getting to be the best from a product perspective and creating that value with our customers. And then ensuring that we are taking full advantage of the competitive landscape as it evolves over time. So those are some of the things we do. So we're not going to provide any more specifics beyond that, but that's how we are thinking about it."
    },
    {
      "speaker": "Joseph Lawrence Moore",
      "role": "Morgan Stanley, Research Division",
      "text": "Morgan Stanley, Research Division Okay. That's helpful. And then the gross margins in HBM, will that continue to be higher than sort of non-HBM DRAM? And if given that you're locked in through most of 2025 and DDR5 is moving up, is it possible that, that changes? Is that -- could that lock in actually hurt you if DDR5 prices rise faster?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. I mean I don't think about the lock-in as \"hurting us\" because the businesses, the HBM portion of it and the non-HBM DRAM are just different types of businesses. The HBM business, we are working with customers with long lead times, long order visibility, lock in of volumes, lock in of pricing well ahead of time, a lot more stable ROI over the years. So that kind of a profile is helpful because no matter what the rest of the business does, our expectation is that the HBM business will have higher through-cycle ROI. So we managed that business in that different way. It creates a lot of value for our customers, and we have that expectation of a higher ROI for us in our portfolio. Now will there be times when the rest of the DRAM portfolio will become very profitable and can challenge or even exceed at times the profitability of the HBM business? Of course, that is possible and we don't think of that as a bad thing. We think of that as a positive thing that the whole business has become dramatically better. And so that's how we think of it as those outcomes are a good place to be because that means the whole industry is extraordinarily healthy from a supply-demand balance perspective, and that helps us drive really robust financial outcomes."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Jim Schneider of Goldman Sachs."
    },
    {
      "speaker": "James Edward Schneider",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division Two quick ones. One follow-up on Joe's question, which is just in general, given all the performance benefits you talked about relative to your position on the HBM4, would you expect your HBM4 share to be higher than it was for HBM3 in a sustainable way going forward?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer I mean we do feel we have very strong capabilities entering the HBM4 business. I mean, we certainly believe that we have the best HBM3E product in the world with highest performance and 30% lower power consumption than any other competitor. What we did not have at the start of the HBM3E business ramp though, is that we didn't have that installed capacity and that base capability. We were ramping from very low levels. And now with the very strong performance from our operations team, we have been able to get our capacity, our yields, our performance, our quality to extremely good levels. We have met our market share goal that we had articulated many quarters ago to you. And so we are starting off our HBM4 in a very different position in terms of being able to meet the expectations and requirements of our customers from a volume support perspective. So we feel that from a competitive positioning, that aspect of the business is in much better shape. Now with HBM4, it is -- there has been a lot of chatter in the market and the media about what is our HBM4 performance compared to those who are doing the base time, the foundry, et cetera. And we just wanted to mentioned and lay some of those doubts to rest that we today believe that our HBM4 has the highest performance amongst any competing product out there. And we don't believe that others can match this performance with this level of capability, quality, power consumption and so on. And so we believe that there will be tremendous customer preference for our products. Of course, we have increases in our HBM supply that we have created through our investments and we have confidence that we will sell out that supply for calendar '26. And there may be some HBM share shifts happening on the competitive landscape but it is our belief that most of that is most likely going to be between our 2 competitors rather than impacting our share in any material way."
    },
    {
      "speaker": "James Edward Schneider",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division And then as a follow-up on the CapEx side, could you maybe give us some color on the split of WFE versus facility CapEx you saw in fiscal '25? And then whether we should expect any significant change in that mix heading into next year?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Jim, it's Mark. No, we're not going to provide that breakout, just that the vast majority of the spend is for DRAM construction equipment."
    },
    {
      "speaker": "James Edward Schneider",
      "role": "Goldman Sachs Group, Inc., Research Division",
      "text": "Goldman Sachs Group, Inc., Research Division And any significant change in the facility piece of that for next year or so?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO We're not going to comment on that. As you know, we're expanding in a number of sites, including -- we talked about our first fab in Idaho, and we're also equipping those fabs as well. I should say, equipping the fab and then also doing tech transitions."
    },
    {
      "speaker": "Manish H. Bhatia",
      "role": "Executive Vice President of Global Operations",
      "text": "Executive Vice President of Global Operations You mean -- sorry, just to be clear, you're saying in Idaho, we're in construction, we expect production there in second half of '27. But we are investing in technology transitions and optimizing production across our footprint in Japan and Taiwan, where we have available clean room space."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Chris Danely of Citi."
    },
    {
      "speaker": "Christopher Brett Danely",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division Can you hear me okay?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer So far."
    },
    {
      "speaker": "Christopher Brett Danely",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division I've been having phone problems all day. So a quick clarification. As far as the DRAM revs go, you guys gave us the HBM breakout. Can we assume roughly the same ratio for DDR4 roughly high single digits and then the rest, DDR5? And any commentary on the relative contributions to incremental gross margin between, say, DDR5 and HBM?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. So we have said earlier to you that the DDR4 plus LP4 we had provided some guidance earlier. We are pretty close to those levels. I'm not going to say that it's going to sustain throughout the fiscal year because the mix changes over time. But DDR4 just by itself, not counting LP4 has actually been a low single-digit percentage of the business. So it's been relatively small. But we have EOL this, we have extended some of our EOL time line based on extreme shortages at customers. And of course, the margins have become dramatically better as this shortage has continued. But yes, I think that's that. I think in terms of the relative margin, if I understood your question correctly, relative margin between DDR and HBM, we are not going to comment on that because while the HBM, as I mentioned earlier, they run like 2 different business models. So while the HBM pricing is set ahead of time for the upcoming calendar year, the pricing on the rest of the DRAM portfolio, and of course NAND portfolio also, is moving around based on quarterly trends. And we have mentioned to you that the DRAM industry is tight. And as we get into 2026, we expect it to further tighten due to all of the robust demand that we are seeing and the limits on the supply growth caused by a number of factors that were discussed. So we believe that, that tightening is going to enable improving pricing and margins on the non-HBM portion of the portfolio. So that will move around. So it's not really practical or possible to give you sort of a relationship between the 2."
    },
    {
      "speaker": "Christopher Brett Danely",
      "role": "Citigroup Inc., Research Division",
      "text": "Citigroup Inc., Research Division That's great. That's still super helpful. And then for my follow-up, question for Mark on gross margin. So Mark, remember, we had lunch earlier this year, and I asked you about could you guys get back to 50% gross margin? You said it's possible, who knows. It depends on a lot of things. It's going to be tough. And here we are. And now we're going past that. So can you just maybe talk about what changed or what was the key to that? And then what are the limiting factors on gross margin going forward? Is it just essentially a function of how many more quarters pricing keeps going up? Or is there something else going on as far as mix goes?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO So Chris, since through the fourth quarter, market conditions continue to improve. And as you know, we updated in mid-August, the 11th, and we reported a margin 120 basis points higher than that. update. So prices continue to improve. The market conditions are very good. very tight on DRAM and they've improved in NAND and continue to improve. Yes, the margin we reported is now above where it was in mid fiscal '22 and DRAM margins are higher than that mid-'22 period. The operating margin is the highest that it's been since November '18. From here, the NAND business can continue to improve. There's been good supply response by us. And we've focused on higher-value SSD products in that business. So while that business is below '22 levels, it can continue to improve, and that will help overall margins. And then furthermore, as we talked about, DRAM is very tight now. And incremental supply is -- meaningful incremental supply is difficult to bring on. You have a number of factors that are structural here. Our inventory levels are low below targets. We've got this extended life on DDR4 LP4, which is constraining the ability to tech node transitions. You have, obviously, the silicon intensity of HBM as that continues to grow quickly. And then incremental capacity, as you know, to bring on a fab takes a long time. And our -- for example, our new fab, Idaho will come on, wafer production starts and meaningful wafer production starts in second half. So that constrained supply focus on diverting bits to the best products and also our continued good cost improvements, those all offer the ability to expand margins, and we've indicated that we expect second quarter gross margin to be up relative to first."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Vijay Rakesh of Mizuho."
    },
    {
      "speaker": "Vijay Raghavan Rakesh",
      "role": "Mizuho Securities USA LLC, Research Division",
      "text": "Mizuho Securities USA LLC, Research Division Just a quick question on the DRAM side. I know you mentioned 1-gamma is starting now. But if you look at your 1-beta, which is -- it looks like most of the HBM4 will be on 1-beta as well. Any thoughts on what the mix will be for you, 1-gamma versus 1-beta now versus exiting the year fiscal '26 per se?"
    },
    {
      "speaker": "Manish H. Bhatia",
      "role": "Executive Vice President of Global Operations",
      "text": "Executive Vice President of Global Operations Sure. Thanks, Vijay. This is Manish. We are very pleased with 1-gamma ramp. We were able to achieve both mature yield this quarter as well as first revenue shipments into hyperscalers as well as other applications. So we're really, really pleased with how that ramp is going. We expect to be able to have 1-gamma be the primary area where we're going to be -- that's going to be providing us a bit growth for fiscal in terms of supply, and we're going to be qualifying across multiple different product areas as we go through the year. We are already at a point where the 1-gamma production plus the 1- beta production are the significant majority of our bid output. And that mix will continue to grow towards 1-gamma as we go through calendar year -- excuse me, fiscal year '26."
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO I would I just maybe add one thing. We talked quite a bit about supply constraints on the last question, and a very important part of our supply solution in '26 is this ramping of 1-gamma, which as Manish said, has been doing very well. And then, Chris, just one additional note on your margin question is this just improved mix to in our business, the data center and the higher performance requirements of that market, and the favorable effect of that on the business."
    },
    {
      "speaker": "Vijay Raghavan Rakesh",
      "role": "Mizuho Securities USA LLC, Research Division",
      "text": "Mizuho Securities USA LLC, Research Division Got it. And then on HBM4, given your higher speeds and lower, power I guess it die is bigger to your own logic die, would you expect the margins on HBM4 to be better versus HBM3, I guess, equal, high?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. I mean we are very confident in the capabilities of our product. And certainly, the HBM4 cost is higher than the HBM3 cost and the HBM4 price will be meaningfully higher than the HBM3E price. We don't really talk about margins by product line or within the product line, which product has what kind of relative margin. But overall, for HBM, we certainly expect that we'll have really good ROI capability for many years for the company not just driven by the huge complexity of HBM, but also driven by the dramatic value it creates for our customers and our intent to ensure that we are benefiting from providing that value."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Aaron Rakers of Wells Fargo."
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division I'll ask 2 as well. I guess kind of building on some of the prior questions. I'm curious, I know, Mark, you had talked about your ability to execute, I think it was high single-digit cost down with HBM in DRAM in fiscal '25, and then I think it was teens or something, low teens on NAND. I'm curious if as we make these process node transitions as well as G9 and NAND, how do you think about the cost down curve as these process nodes materialize through this next fiscal year?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Just to be clear, I think on cost downs, we gave for fiscal '25 or slightly better than high single digits for DRAM front-end ex-HBM and mid-teens for NAND. And I think as -- and then for DRAM with HBM down low single-digit percentage and NAND cost reductions, low teens. So these are consistent with commentary we've given in the past at that or better."
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division Yes. Okay. And then I'm curious just like structurally, the NAND market. There's a lot of discussion around these high-cap enterprise SSDs pushing 250 terabytes and plus. As we look at that market, I'm curious how you guys see the average capacity trending on these AI servers for SSDs? And whether we should really be expecting that to inflect materially higher as we move through fiscal '26 and some of these high cap drives really hit through volume?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. I think the average capacities is going to continue to escalate rapidly. We had 60 terabyte drives and then 102 terabyte drives, and we have ourselves announced at our last FMS event 122 terabyte drives, 245 terabyte drives. And so we are very excited with the demand that we see for these drives, and we do think there will be a meaningful uptake of these high-capacity drives, and they will drive the average capacities higher. And I also mentioned that there is expected to be a shortage of hard drive storage for these hyperscalers. And so more meaningful usage of NAND, even beyond previous plans should drive a positive outcome here as well as an added tailwind."
    },
    {
      "speaker": "Aaron Christopher Rakers",
      "role": "Wells Fargo Securities, LLC, Research Division",
      "text": "Wells Fargo Securities, LLC, Research Division Where do you think the average capacity is today per server? Just curious."
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer It's moving around quite a bit because in any given quarter, the mix of general-purpose servers and AI servers keeps changing and AI servers generally tend to use the highest capacity that is available in very meaningful quantities. So AI servers have been -- there are AI servers that are focused on just ensuring a huge amount of capacity, but then with different workloads of inference that are also increasing more fragmentation is happening in the configurations that are getting shipped. But generally speaking, the highest capacity drives that the industry has been able to produce do get used by AI servers. So they are going from 100 -- they're going from 60 terabytes to 120 and actively using a lot of 245 going forward."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Brian Chin of Stifel."
    },
    {
      "speaker": "Brian Edward Chin",
      "role": "Stifel, Nicolaus & Company, Incorporated, Research Division",
      "text": "Stifel, Nicolaus & Company, Incorporated, Research Division I'll ask a few questions. Maybe I know there's a couple of questions on cost down or cost reduction. But I was just curious, you've obviously talked about in the past, HBM3E, some efficiencies you've gained as you've kind of moved into relative maturity from where you started. And I know you're not -- you don't want to provide too much detail around pricing in 2026 for 3E, while your tone does suggest you have -- you should have sufficient leverage, I guess, in terms of those negotiations. But I'm wondering, is there more efficiency in terms of improvement in assembly and packaging yields for 3E that maybe could also help you out a little bit in terms of margins, margin profile next year?"
    },
    {
      "speaker": "Manish H. Bhatia",
      "role": "Executive Vice President of Global Operations",
      "text": "Executive Vice President of Global Operations Thanks, Brian. So we are very happy with how the HBM3E 12-high ramp has gone. We talked about being able to get our yields to maturity on 12-high significantly faster than we did on 8-high, which was really our first major HBM volume node. And we've now gotten production capacity up to meaningful volumes as we kind of gave you. So there will be continued opportunity, but I would say that really, the biggest part of that benefit and ramp has happened as we've gone through the 12-high over the last couple of quarters."
    },
    {
      "speaker": "Brian Edward Chin",
      "role": "Stifel, Nicolaus & Company, Incorporated, Research Division",
      "text": "Stifel, Nicolaus & Company, Incorporated, Research Division Got it. And I appreciate that. Maybe a quick follow-up. I know there's been some discussion here about sort of your guys reattaining this 50% plus blended gross margin first time since 2017, 2018 time frame. I know you wouldn't recast or you can't recast cloud and core enterprise server revenue back that far. You did give us sort of the sequential and the year- over-year compare today. But those segments are roughly mid-50% of sales now. What roughly did they represent back then? Clearly, it must have been a much smaller proportion, and that's obviously a structural shift in business period-to-period."
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. I mean without giving you specifics for any one particular time line, I'll just mention to you that most segments that are part of the TAM over the different time horizons in the past prior to generative AI coming on the scene had peaked around 1/3 of the overall market in terms of segment size, right? So if you think about data center segment or you think about the mobile segment, when they would go into this big spurt, it would peak around roughly speaking, give or take, 1/3 of the overall market. And this time around, of course, that pseudo ceiling of 1/3 is no longer in place because data center has become more than half and continues to outgrow the rest of the market. and very robust profitability levels. So we do think that AI has radically changed the landscape. Not only is the mix due to AI growth in the data center across the data center to become a much larger part of the TAM, but it is also a higher value as well as higher margin opportunity. We did mention that HBM and high-capacity DIMMs, and the LP that goes into the data center, these 3 categories alone were $10 billion in fiscal '25, so a very large part of our fiscal '25 revenue. And these are all high value-add portions of the portfolio. This doesn't even account for regular DDR5 that is in 64 gigabytes and below type of DIMMs that are going into the data center, doesn't account for data center SSDs that are part of the data center portfolio. So there is a lot of that shift that is going on, but it's also a shift that has a lot of legs to continue. And that's also the demand coming from the data center that's creating a lot of this tightness in the industry and causing pricing to -- and enabling us to be able to increase pricing across all of the segments of the market, not just the data center. So it's helping the profitability of the entire portfolio of the company, even though it's driven largely from the data center."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Quinn Bolton of Needham & Company."
    },
    {
      "speaker": "Nathaniel Quinn  Bolton",
      "role": "Needham & Company, LLC, Research Division",
      "text": "Needham & Company, LLC, Research Division Mark, maybe I just missed your answer. I just want to clarify your answer to Aaron's question on the cost downs. You did low single digits in DRAM inclusive of HBM and low teens in NAND. Did you say that those are good ranges to think about in '26? Or did you not give a cost-down target for fiscal '26?"
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO We didn't give a -- we just gave '25."
    },
    {
      "speaker": "Nathaniel Quinn  Bolton",
      "role": "Needham & Company, LLC, Research Division",
      "text": "Needham & Company, LLC, Research Division Okay. And then, I guess, maybe just kind of a bigger picture question. As you look at the inferencing market, NVIDIA recently introduced their CPX GPU that uses GDDR7 instead of HBM memory and to the extent that, that architecture takes off, do you think that, that lower HBM content on inferencing platforms, would that have any impact on your broader outlook for the HBM market over the next few years? Or do you think that, that CPX architecture represents sort of only a small portion of the inference market?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes. As the AI market continues to grow and evolve, it is for sure going to have a lot of different use cases come up a lot of different types of workloads for which optimized architectures would have to be evolved. And this is just another step in that direction. The AI market is going to become very, very big over time, and it is going to have needs that are not going to be one size fits all. And that optimization will be necessary to scale out the capabilities in a cost-effective way. So certainly, this is just one example. There will be more in the future. One important thing to keep in mind, as all of this happens is that A lot of the inferencing workloads tend to be memory-bound workloads. And consequently, as inference becomes larger and larger part of the AI market and over time will likely become 80% of the AI market over the years, a lot of that being memory bound means customers will be looking for different architectures that increase memory capacity and memory bandwidth. And depending on the latency requirements and time to first token and those types of different KPIs that these architectures have to hit different types of solutions will be appropriate for various workloads. And we are having a strategy to ensure that we are very strong in HBM as we have discussed at length. We have an industry-leading product with GDDR7. We are the pioneers of LPDRAM in the data center, which is going to be used more and more over time, not just because of its energy efficiency. But because more industry players are going to, from an ecosystem perspective, from a enablement perspective, going to start supporting LP over time. So all of these capabilities that we have developed that are industry-leading will serve us really well and our intent is to create those high-value solutions across the rich frontier of evolving architectures that our customers will be driving."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of John Vinh of KeyBanc Capital Markets."
    },
    {
      "speaker": "John Nguyen Vinh",
      "role": "KeyBanc Capital Markets Inc., Research Division",
      "text": "KeyBanc Capital Markets Inc., Research Division I just had couple follow-ups. So first on HBM, Sanjay, on the call really went out of his way to kind of say, hey, we can support 2.8 terabytes per second and 11 gigabits per second. It seems like these performance specs are greater than the original JEDEC standards that were set. And it looks like customers are asking for more. I'm just curious why are customers increasing kind of the original specifications for HBM4 and then asking for higher performance? And then just a quick housekeeping question for Mark. Just looking at your guidance, given the midpoint of all the ranges that you provided, it looks like to get to $3.75 million in EPS, it implies that interest income is positive in the quarter. Is that the case of what's implied there?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer I'll just answer the first part of your question and then hand it over to Mark. In terms of the HBM4 specs and its evolution, no doubt that the JEDEC specs were definitely exceeded by a significant margin by some of the numbers that we have quoted to you today with greater than 11 gigabits per second in speed and 2.8 terabytes per second of bandwidth. We have sampled these products. Customers obviously are looking for as much improvement as they can get in the ROI that they can offer to their end customers. That typically means that if there is a way to really drive higher bandwidth. You can increase the tokens. You can reduce the time to first token. You can get to a lower cost per token kind of a metric, and that becomes a more attractive solution for their end customers. So that's really what is happening. But certainly, the HBM4 specs that we have been able to produce will create a new bar for performance that would be needed to really enable these type of high-performing systems. So that's really what has happened on that front, and I'll pass it on to Mark to talk about the second part of your question."
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO Yes. John, we do expect net interest to flip the income. We have greater capitalized interest. We have lower debt, we have higher cash balances. All those will flip that line."
    },
    {
      "speaker": "Operator",
      "role": "Operator",
      "text": "Our next question comes from the line of Kevin Cassidy of Rosenblatt Securities."
    },
    {
      "speaker": "Kevin Edward Cassidy",
      "role": "Rosenblatt Securities Inc., Research Division",
      "text": "Rosenblatt Securities Inc., Research Division Yes. With the supply/demand going -- favoring the demand side, is there any discussions yet for long-term agreements with all of your clients or your customers?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Yes, there is certainly interest in some of these agreements, but we have certainly experimented with different types of long-term agreements in the past and innovated with some ideas on how to do some of these things. I do think that we are going to be very thoughtful about what we do here and what term and lifetime of these agreements we sign up for. We also have U.S. manufacturing that we are going to be building online. We also have changes that are likely to happen on the landscape due to tariffs, and we'll have to respond to that when they become when they are announced Section 232 semiconductor tariffs. So there's all kinds of reasons to be thoughtful about what happens to pricing, what happens to how we create value for customers, whether it is through U.S. manufacturing or product capabilities. And there's also, obviously, there's very significant shift towards data center that I had been describing and you have been watching that's been happening in the mix of the overall industry as well as for Micron. So we are being thoughtful about all of these different factors, and we will definitely be leveraging these in the discussions with customers. What that comes out on the other end of these, I would rather not speculate at this time."
    },
    {
      "speaker": "Kevin Edward Cassidy",
      "role": "Rosenblatt Securities Inc., Research Division",
      "text": "Rosenblatt Securities Inc., Research Division Yes. Understood. Maybe just a question on your decision to drop the managed NAND for the smartphone market. Is there a lower cost supplier out there, a new supplier that is taking that type of business?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer Well, it's not about a lower cost supplier. It's just about, for us, the ROI in the business. The NAND business ROI is certainly has been for the past several years lower than that of DRAM. And our approach has been that as we have strengthened our portfolio in NAND, particularly with the growth of our data center SSD business, we wanted to leverage that to improve the overall portfolio mix. And we determined that the pricing expectations and the level of competitiveness in the mobile NAND market did not lend itself for robust ROI over time. And we determined that it was better to exit that and concentrate our resources in other places where we can drive better ROI. So one of the things that you have seen us do over time is dramatically improve our product portfolio. And as our portfolio has improved, it has given us the flexibility that we are now leveraging to mix into those parts of the portfolio which offer the highest profitability so we can have a bigger share of the industry's profit pool, and that's been our strategy now. We can drive it more aggressively with the improved portfolio that we now have. We have been investing to get these capabilities for several years now, and we are in a good place to be able to leverage it now."
    },
    {
      "speaker": "Mark J. Murphy",
      "role": "Executive VP & CFO",
      "text": "Executive VP & CFO And maybe just to add, to build on Sumit's comments, we don't report or operate the business by technology, but we do view that we've completed a second year of positive free cash flow in NAND."
    },
    {
      "speaker": "Kevin Edward Cassidy",
      "role": "Rosenblatt Securities Inc., Research Division",
      "text": "Rosenblatt Securities Inc., Research Division Okay. Great. If I'm allowed to ask one more on that. Just your smartphone customers didn't have a problem with that with but does it affect your DRAM sales to them?"
    },
    {
      "speaker": "Sumit Sadana",
      "role": "Executive VP & Chief Business Officer",
      "text": "Executive VP & Chief Business Officer No. I mean, customers are never happy when your one important supplier is leaving a segment. So I wouldn't say that they're happy to see us exit that. But we have a very strong relationship with all of these customers and the DRAM business is super critical to them, and they have far fewer choices on the DRAM side compared to what they do on the NAND side. So we have worked with them to transition their products to other suppliers, so we have supported them through that transition on the NAND side. And we continue to remain very robust suppliers to them on the DRAM side. OperatorThank you. That is all the time we have for our Q&A session. This concludes today's conference call. Thank you for participating. You may now disconnect. Copyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources believed to be reliable. No content (including index data, ratings, credit- related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or unauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com  (free of charge), and www.ratingsdirect.com  and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at www.standardandpoors.com/usratingsfees. © 2025 S&P Global Market Intelligence."
    }
  ],
  "source_file": "Micron Technology, Inc., Q4 2025 Earnings Call, Sep 23, 2025.rtf"
}